[{"input": "A student reads 38.45 pages per hour. After studying for 2.93 hours, the total pages read are", "output": 112.65850000000002}, {"input": "In the classroom, there were 5 red chairs and 10 blue chairs. The total number of chairs was", "output": 15.0}, {"input": "Henry had 26 pieces of candy. He ate 2 pieces, so he was left with", "output": 24.0}, {"input": "At the concert, 399 tickets were sold online and 269 tickets were sold at the door. The total tickets sold were", "output": 668.0}, {"input": "A company sells 333.33 units of product per month. If it operates for 5.65 months, the total units sold are", "output": 1883.3145}, {"input": "On a bus, there were 29 passengers initially and 19 more got on at the next stop. The total number of passengers was", "output": 48.0}, {"input": "In the classroom, there were 14 red chairs and 13 blue chairs. The total number of chairs was", "output": 27.0}, {"input": "Each student gets 5 pencils, and there are 19 students. They distributed", "output": 95.0}, {"input": "A printer prints 18.89 pages per minute. Over 43.33 minutes, it prints", "output": 818.5037}, {"input": "A park had 243 trees. After 61 were cut down for safety reasons, the remaining number of trees was", "output": 182.0}, {"input": "A printer prints 16 pages per minute. After 2 minutes, the total pages printed are", "output": 32.0}, {"input": "In a library, there were 66 books on the first shelf and 40 books on the second shelf. Altogether, the shelves held", "output": 106.0}, {"input": "A student reads 15.54 pages per hour. After studying for 3.79 hours, the total pages read are", "output": 58.8966}, {"input": "A building has 71 floors and each floor has 9 apartments. Total number of apartments in the building is", "output": 639.0}, {"input": "A park had 277 trees. After 82 were cut down for safety reasons, the remaining number of trees was", "output": 195.0}, {"input": "During a fundraiser, Alex raised 167 dollars and Jamie raised 154. Together, they raised", "output": 321.0}, {"input": "A classroom had 59 pencils. After giving 22 to students, left were", "output": 37.0}, {"input": "Liam had 30 pieces of gum. After sharing 19 pieces with his friend, he had", "output": 11.0}, {"input": "Tom had 25 trading cards and his brother gave him 49. Now he has", "output": 74.0}, {"input": "A farmer harvested 292 bushels of corn and sold 63 bushels. He had left", "output": 229.0}, {"input": "A gym has 81 members. Each member pays a monthly fee of 57 dollars. Total monthly income is", "output": 4617.0}, {"input": "In the garden, there were 77 red flowers and 61 yellow flowers. The total number of flowers is", "output": 138.0}, {"input": "At the start of the day, a parking lot had 185 cars. By evening, 26 cars had left. The number of cars remaining was", "output": 159.0}, {"input": "On a bus, there were 16 passengers initially and 11 more got on at the next stop. The total number of passengers was", "output": 27.0}, {"input": "In a store, there were 93 candies. After 31 were eaten during a party, there were", "output": 62.0}, {"input": "Each pack of stickers contains 24 stickers, and Sarah bought 7 packs. She has", "output": 168.0}, {"input": "A classroom had 47 chairs. After removing 19 broken chairs, the remaining chairs are", "output": 28.0}, {"input": "A teacher has 14 students in each class and teaches 4 classes. She teaches", "output": 56.0}, {"input": "In a store, there were 80 candies. After 37 were eaten during a party, there were", "output": 43.0}, {"input": "A warehouse stored 1362 boxes. After relocating 460 boxes, the remaining boxes are", "output": 902.0}, {"input": "During the game, the team scored 1 goals in the first half and 4 goals in the second half, making a total of", "output": 5.0}, {"input": "At the concert, 114 tickets were sold online and 301 tickets were sold at the door. The total tickets sold were", "output": 415.0}, {"input": "In the school library, there are 77 books in the fiction section and 36 books in the non-fiction section. Total books in both sections are", "output": 113.0}, {"input": "A gym has 69 members. Each member pays a monthly fee of 47 dollars. Total monthly income is", "output": 3243.0}, {"input": "During a fundraiser, Alex raised 478 dollars and Jamie raised 144. Together, they raised", "output": 622.0}, {"input": "A farmer harvested 239 bushels of corn and sold 50 bushels. He had left", "output": 189.0}, {"input": "A printer prints 3.21 pages per minute. Over 46.76 minutes, it prints", "output": 150.09959999999998}, {"input": "A blog gets 220 views per article. If 6 articles are published, the total views are", "output": 1320.0}, {"input": "The teacher distributed 84 cookies among 2 students. Each student received", "output": 42.0}, {"input": "A classroom had 60 pencils. After giving 15 to students, left were", "output": 45.0}, {"input": "In a marathon, 304 runners finished in less than four hours and 270 in more than four hours. The total number of runners was", "output": 574.0}, {"input": "At the start of the day, a parking lot had 145 cars. By evening, 30 cars had left. The number of cars remaining was", "output": 115.0}, {"input": "A classroom had 51 pencils. After giving 27 to students, left were", "output": 24.0}, {"input": "A tour guide has 143 brochures to distribute evenly among 11 tourists. Each tourist gets", "output": 13.0}, {"input": "In the classroom, there were 18 red chairs and 12 blue chairs. The total number of chairs was", "output": 30.0}, {"input": "Max had 111.81 dollars, but after buying a toy for 39.57 dollars, he has", "output": 72.24000000000001}, {"input": "A company sells 272.74 units of product per month. If it operates for 7.20 months, the total units sold are", "output": 1963.728}, {"input": "During a fundraiser, Alex raised 296 dollars and Jamie raised 200. Together, they raised", "output": 496.0}, {"input": "A restaurant serves 60.61 meals per hour. During an 5.59-hour shift, the total meals served are", "output": 338.80989999999997}, {"input": "A marathon runner completed 169.55 miles and took 1.80 breaks. He ran an average of", "output": 94.19444444444444}, {"input": "Each box contains 50 apples, and there are 9 boxes. The total number of apples is", "output": 450.0}, {"input": "In a factory, 47 workers each assemble 8 parts per day. Total parts assembled are", "output": 376.0}, {"input": "In the garden, there were 68 red flowers and 42 yellow flowers. The total number of flowers is", "output": 110.0}, {"input": "An office started the day with 924 sheets of paper. After using 287 for printing, remaining sheets are", "output": 637.0}, {"input": "A marathon runner completed 57.18 miles and took 2.38 breaks. He ran an average of", "output": 24.025210084033613}, {"input": "In a library, there were 31 books on the first shelf and 35 books on the second shelf. Altogether, the shelves held", "output": 66.0}, {"input": "A farmer harvested 25 apples from one tree and 20 from another. Total apples harvested were", "output": 45.0}, {"input": "Sally picked 15 flowers and Molly picked 4. Together they picked", "output": 19.0}, {"input": "Wendy uploaded 28 pictures to Facebook. She dsitributes the pictures  uniformly into 4 different albums. Then, in each album there were", "output": 7.0}, {"input": "A student reads 37.16 pages per hour. After studying for 3.70 hours, the total pages read are", "output": 137.492}, {"input": "After finding 14 loose coins in the sofa and 21 coins in his backpack, Tim counted", "output": 35.0}, {"input": "A restaurant serves 39.05 meals per hour. During an 9.13-hour shift, the total meals served are", "output": 356.5265}, {"input": "In a marathon, 347 runners finished in less than four hours and 195 in more than four hours. The total number of runners was", "output": 542.0}, {"input": "A baker baked 117 cookies. After selling 31 cookies, he was left with", "output": 86.0}, {"input": "A movie theater has 18 rows of seats and each row has 19 seats. The total number of seats is", "output": 342.0}, {"input": "A warehouse stored 1027 boxes. After relocating 595 boxes, the remaining boxes are", "output": 432.0}, {"input": "A movie theater had 207 seats filled. After 71 people left, the number of occupied seats was", "output": 136.0}, {"input": "In the classroom, there were 10 red chairs and 20 blue chairs. The total number of chairs was", "output": 30.0}, {"input": "Each box contains 43 apples, and there are 10 boxes. The total number of apples is", "output": 430.0}, {"input": "A blog gets 218 views per article. If 3 articles are published, the total views are", "output": 654.0}, {"input": "A classroom had 43 pencils. After giving 20 to students, left were", "output": 23.0}, {"input": "The library had 141 books in stock. After lending out 20 books, they had", "output": 121.0}, {"input": "A gym has 61 members. Each member pays a monthly fee of 54 dollars. Total monthly income is", "output": 3294.0}, {"input": "In the school library, there are 78 books in the fiction section and 53 books in the non-fiction section. Total books in both sections are", "output": 131.0}, {"input": "A library had 217 books. After losing 40 books due to damage, the remaining books are", "output": 177.0}, {"input": "A park had 255 trees. After 65 were cut down for safety reasons, the remaining number of trees was", "output": 190.0}, {"input": "120 candies were shared equally among 10 friends. Each friend got", "output": 12.0}, {"input": "A craftsman makes 13 ornaments each week. Each is sold for 96 dollars. Weekly income from sales is", "output": 1248.0}, {"input": "A printer prints 29 pages per minute. After 12 minutes, the total pages printed are", "output": 348.0}, {"input": "A bookshelf held 298 books. After donating 82 to a library, it held", "output": 216.0}, {"input": "During a fundraiser, Alex raised 189 dollars and Jamie raised 249. Together, they raised", "output": 438.0}, {"input": "A blog gets 297 views per article. If 17 articles are published, the total views are", "output": 5049.0}, {"input": "Each pack of stickers contains 15 stickers, and Sarah bought 10 packs. She has", "output": 150.0}, {"input": "Liam had 44 pieces of gum. After sharing 6 pieces with his friend, he had", "output": 38.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 20 pieces of candy while her sister had 17. Together, they had", "output": 37.0}, {"input": "A movie theater had 206 seats filled. After 79 people left, the number of occupied seats was", "output": 127.0}, {"input": "An author writes 11.74 pages per session. After 2.14 sessions, the total pages written are", "output": 25.123600000000003}, {"input": "A student reads 37.15 pages per hour. After studying for 1.53 hours, the total pages read are", "output": 56.8395}, {"input": "At the start of the day, a parking lot had 132 cars. By evening, 25 cars had left. The number of cars remaining was", "output": 107.0}, {"input": "A tank had 109.51 liters of water. After watering the garden with 53.56 liters, the amount remaining is", "output": 55.95}, {"input": "A building has 96 floors and each floor has 1 apartments. Total number of apartments in the building is", "output": 96.0}, {"input": "On a bus, there were 13 passengers initially and 18 more got on at the next stop. The total number of passengers was", "output": 31.0}, {"input": "Max had 63.79 dollars, but after buying a toy for 47.21 dollars, he has", "output": 16.58}, {"input": "Henry had 16 pieces of candy. He ate 7 pieces, so he was left with", "output": 9.0}, {"input": "A baker baked 115 cookies. After selling 26 cookies, he was left with", "output": 89.0}, {"input": "Initially, there were 104 pieces of candy. After sharing 32 with her friends, Sally has", "output": 72.0}, {"input": "In a video game, each enemy defeated gives you 39.56 points. If a level has 40.96 enemies total and you destroy all of them, the points you earn are", "output": 1620.3776}, {"input": "A farmer collected 216 eggs and packed them into 12 cartons. Each carton holds", "output": 18.0}, {"input": "The school had enrolled 526 students, but 102 transferred out. The number of students now is", "output": 424.0}, {"input": "A printer prints 16 pages per minute. After 12 minutes, the total pages printed are", "output": 192.0}, {"input": "In a library, there were 66 books on the first shelf and 44 books on the second shelf. Altogether, the shelves held", "output": 110.0}, {"input": "A baker made 281 cookies. After 23 were spoiled, the number left was", "output": 258.0}, {"input": "The teacher distributed 80 cookies among 4 students. Each student received", "output": 20.0}, {"input": "Liam had 50 pieces of gum. After sharing 18 pieces with his friend, he had", "output": 32.0}, {"input": "Tom had 14 trading cards and his brother gave him 36. Now he has", "output": 50.0}, {"input": "Sally picked 16 flowers and Molly picked 1. Together they picked", "output": 17.0}, {"input": "A farm produces 67.65 gallons of milk each day. Each gallon is sold for 4.70 dollars. Total daily income is", "output": 317.95500000000004}, {"input": "A blog gets 206 views per article. If 10 articles are published, the total views are", "output": 2060.0}, {"input": "A craftsman makes 6 ornaments each week. Each is sold for 120 dollars. Weekly income from sales is", "output": 720.0}, {"input": "Henry had 22 pieces of candy. He ate 7 pieces, so he was left with", "output": 15.0}, {"input": "A farmer collected 148 eggs today. After selling 15 at the market, he had", "output": 133.0}, {"input": "A farmer harvested 12 apples from one tree and 19 from another. Total apples harvested were", "output": 31.0}, {"input": "An orchard harvested 232 apples. These were divided among 29 baskets. Each basket got", "output": 8.0}, {"input": "After making 445 paper cranes, Lisa gave away 100. She has left", "output": 345.0}, {"input": "A farm produces 67.57 gallons of milk each day. Each gallon is sold for 3.68 dollars. Total daily income is", "output": 248.65759999999997}, {"input": "In the classroom, there were 17 red chairs and 17 blue chairs. The total number of chairs was", "output": 34.0}, {"input": "A chef baked 363 cookies and distributed them equally among 11 children. Each child got", "output": 33.0}, {"input": "Initially, there were 126 pieces of candy. After sharing 42 with her friends, Sally has", "output": 84.0}, {"input": "Each box contains 18 apples, and there are 24 boxes. The total number of apples is", "output": 432.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 15 pieces of candy while her sister had 16. Together, they had", "output": 31.0}, {"input": "A hiker had 13 energy bars. After eating 2 during the trek, he had", "output": 11.0}, {"input": "A printer prints 10.39 pages per minute. Over 34.14 minutes, it prints", "output": 354.7146}, {"input": "A hiker had 12 energy bars. After eating 4 during the trek, he had", "output": 8.0}, {"input": "In a marathon, 216 runners finished in less than four hours and 241 in more than four hours. The total number of runners was", "output": 457.0}, {"input": "Initially, there were 130 pieces of candy. After sharing 42 with her friends, Sally has", "output": 88.0}, {"input": "A warehouse stored 1018 boxes. After relocating 339 boxes, the remaining boxes are", "output": 679.0}, {"input": "A baker made 271 cookies. After 31 were spoiled, the number left was", "output": 240.0}, {"input": "A park had 237 trees. After 62 were cut down for safety reasons, the remaining number of trees was", "output": 175.0}, {"input": "A baker baked 75 cookies. After selling 35 cookies, he was left with", "output": 40.0}, {"input": "A chef baked 189 cookies and distributed them equally among 7 children. Each child got", "output": 27.0}, {"input": "In the school library, there are 65 books in the fiction section and 51 books in the non-fiction section. Total books in both sections are", "output": 116.0}, {"input": "A teacher has 25 students in each class and teaches 8 classes. She teaches", "output": 200.0}, {"input": "A movie theater has 25 rows of seats and each row has 25 seats. The total number of seats is", "output": 625.0}, {"input": "In the zoo, there were 2 lions and 7 tigers. The total number of these big cats is", "output": 9.0}, {"input": "At the start of the day, a parking lot had 120 cars. By evening, 25 cars had left. The number of cars remaining was", "output": 95.0}, {"input": "A park had 285 trees. After 41 were cut down for safety reasons, the remaining number of trees was", "output": 244.0}, {"input": "In the garden, there were 21 red flowers and 61 yellow flowers. The total number of flowers is", "output": 82.0}, {"input": "During the game, the team scored 2 goals in the first half and 10 goals in the second half, making a total of", "output": 12.0}, {"input": "A farm produces 91.31 gallons of milk each day. Each gallon is sold for 1.81 dollars. Total daily income is", "output": 165.27110000000002}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 24 pieces of candy while her sister had 6. Together, they had", "output": 30.0}, {"input": "A marathon runner completed 91.67 miles and took 5.40 breaks. He ran an average of", "output": 16.975925925925925}, {"input": "A baker baked 68 cookies. After selling 26 cookies, he was left with", "output": 42.0}, {"input": "The library had 117 books in stock. After lending out 36 books, they had", "output": 81.0}, {"input": "A bookshelf held 184 books. After donating 52 to a library, it held", "output": 132.0}, {"input": "A movie theater has 29 rows of seats and each row has 22 seats. The total number of seats is", "output": 638.0}, {"input": "A chef baked 469 cookies and distributed them equally among 7 children. Each child got", "output": 67.0}, {"input": "A bakery makes 9 cakes each day. Each cake sells for 17 dollars. Daily revenue is", "output": 153.0}, {"input": "A blog gets 109 views per article. If 5 articles are published, the total views are", "output": 545.0}, {"input": "Each pack of stickers contains 33 stickers, and Sarah bought 7 packs. She has", "output": 231.0}, {"input": "In the zoo, there were 7 lions and 7 tigers. The total number of these big cats is", "output": 14.0}, {"input": "The museum had 507 visitors on Saturday. By closing, 110 had left, leaving", "output": 397.0}, {"input": "An office started the day with 614 sheets of paper. After using 160 for printing, remaining sheets are", "output": 454.0}, {"input": "A baker made 261 cookies. After 48 were spoiled, the number left was", "output": 213.0}, {"input": "Tom had 45 trading cards and his brother gave him 43. Now he has", "output": 88.0}, {"input": "In the zoo, there were 8 lions and 9 tigers. The total number of these big cats is", "output": 17.0}, {"input": "A student reads 24.54 pages per hour. After studying for 1.48 hours, the total pages read are", "output": 36.319199999999995}, {"input": "The teacher distributed 56 cookies among 4 students. Each student received", "output": 14.0}, {"input": "A craftsman makes 13 ornaments each week. Each is sold for 59 dollars. Weekly income from sales is", "output": 767.0}, {"input": "After finding 43 loose coins in the sofa and 19 coins in his backpack, Tim counted", "output": 62.0}, {"input": "In the garden, there were 59 red flowers and 60 yellow flowers. The total number of flowers is", "output": 119.0}, {"input": "A total of 88 chocolates were divided equally among 8 children. Each child received", "output": 11.0}, {"input": "In a factory, 25 workers each assemble 7 parts per day. Total parts assembled are", "output": 175.0}, {"input": "A company sells 207.78 units of product per month. If it operates for 2.42 months, the total units sold are", "output": 502.82759999999996}, {"input": "A bakery makes 9 cakes each day. Each cake sells for 14 dollars. Daily revenue is", "output": 126.0}, {"input": "In a library, there were 63 books on the first shelf and 29 books on the second shelf. Altogether, the shelves held", "output": 92.0}, {"input": "Liam had 41 pieces of gum. After sharing 5 pieces with his friend, he had", "output": 36.0}, {"input": "Liam had 31 pieces of gum. After sharing 6 pieces with his friend, he had", "output": 25.0}, {"input": "A movie theater has 13 rows of seats and each row has 21 seats. The total number of seats is", "output": 273.0}, {"input": "A gym has 60 members. Each member pays a monthly fee of 30 dollars. Total monthly income is", "output": 1800.0}, {"input": "A student had 92 pages left to read in a book. After reading 14 pages, the remaining pages are", "output": 78.0}, {"input": "Wendy uploaded 27 pictures to Facebook. She dsitributes the pictures  uniformly into 9 different albums. Then, in each album there were", "output": 3.0}, {"input": "A baker baked 103 cookies. After selling 35 cookies, he was left with", "output": 68.0}, {"input": "After finding 19 loose coins in the sofa and 38 coins in his backpack, Tim counted", "output": 57.0}, {"input": "During a fundraiser, Alex raised 336 dollars and Jamie raised 65. Together, they raised", "output": 401.0}, {"input": "A car has 6 wheels, and there are 3 cars in the showroom. The total number of wheels is", "output": 18.0}, {"input": "Henry had 20 pieces of candy. He ate 4 pieces, so he was left with", "output": 16.0}, {"input": "An office started the day with 936 sheets of paper. After using 289 for printing, remaining sheets are", "output": 647.0}, {"input": "A student reads 20.49 pages per hour. After studying for 2.00 hours, the total pages read are", "output": 40.98}, {"input": "An author writes 7.46 pages per session. After 5.05 sessions, the total pages written are", "output": 37.673}, {"input": "A farmer collected 121 eggs today. After selling 15 at the market, he had", "output": 106.0}, {"input": "A blog gets 111 views per article. If 13 articles are published, the total views are", "output": 1443.0}, {"input": "A farmer harvested 44 apples from one tree and 26 from another. Total apples harvested were", "output": 70.0}, {"input": "A tank had 182.20 liters of water. After watering the garden with 50.46 liters, the amount remaining is", "output": 131.73999999999998}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 23 pieces of candy while her sister had 19. Together, they had", "output": 42.0}, {"input": "Max had 102.92 dollars, but after buying a toy for 33.13 dollars, he has", "output": 69.78999999999999}, {"input": "At the start of the day, a parking lot had 97 cars. By evening, 24 cars had left. The number of cars remaining was", "output": 73.0}, {"input": "During the game, the team scored 2 goals in the first half and 3 goals in the second half, making a total of", "output": 5.0}, {"input": "In the garden, there were 29 red flowers and 45 yellow flowers. The total number of flowers is", "output": 74.0}, {"input": "A car has 6 wheels, and there are 15 cars in the showroom. The total number of wheels is", "output": 90.0}, {"input": "A company sells 234.16 units of product per month. If it operates for 3.04 months, the total units sold are", "output": 711.8464}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 18 pieces of candy while her sister had 21. Together, they had", "output": 39.0}, {"input": "At the concert, 252 tickets were sold online and 446 tickets were sold at the door. The total tickets sold were", "output": 698.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 19 pieces of candy while her sister had 5. Together, they had", "output": 24.0}, {"input": "A baker baked 141 cookies. After selling 23 cookies, he was left with", "output": 118.0}, {"input": "A gym has 99 members. Each member pays a monthly fee of 53 dollars. Total monthly income is", "output": 5247.0}, {"input": "The museum had 476 visitors on Saturday. By closing, 90 had left, leaving", "output": 386.0}, {"input": "A building has 16 floors and each floor has 10 apartments. Total number of apartments in the building is", "output": 160.0}, {"input": "A marathon runner completed 191.03 miles and took 6.71 breaks. He ran an average of", "output": 28.469448584202684}, {"input": "A movie theater has 21 rows of seats and each row has 29 seats. The total number of seats is", "output": 609.0}, {"input": "During a fundraiser, Alex raised 455 dollars and Jamie raised 121. Together, they raised", "output": 576.0}, {"input": "A building has 34 floors and each floor has 7 apartments. Total number of apartments in the building is", "output": 238.0}, {"input": "A park had 217 trees. After 79 were cut down for safety reasons, the remaining number of trees was", "output": 138.0}, {"input": "The museum had 966 visitors on Saturday. By closing, 167 had left, leaving", "output": 799.0}, {"input": "The school had enrolled 918 students, but 129 transferred out. The number of students now is", "output": 789.0}, {"input": "On a bus, there were 21 passengers initially and 20 more got on at the next stop. The total number of passengers was", "output": 41.0}, {"input": "In a store, there were 119 candies. After 24 were eaten during a party, there were", "output": 95.0}, {"input": "A marathon runner completed 108.28 miles and took 4.54 breaks. He ran an average of", "output": 23.85022026431718}, {"input": "Sally picked 20 flowers and Molly picked 3. Together they picked", "output": 23.0}, {"input": "In the classroom, there were 12 red chairs and 3 blue chairs. The total number of chairs was", "output": 15.0}, {"input": "Max had 127.36 dollars, but after buying a toy for 25.92 dollars, he has", "output": 101.44}, {"input": "Each pack of stickers contains 14 stickers, and Sarah bought 8 packs. She has", "output": 112.0}, {"input": "In the classroom, there were 3 red chairs and 4 blue chairs. The total number of chairs was", "output": 7.0}, {"input": "The teacher distributed 21 cookies among 3 students. Each student received", "output": 7.0}, {"input": "In the zoo, there were 9 lions and 7 tigers. The total number of these big cats is", "output": 16.0}, {"input": "On a bus, there were 23 passengers initially and 11 more got on at the next stop. The total number of passengers was", "output": 34.0}, {"input": "In a marathon, 433 runners finished in less than four hours and 187 in more than four hours. The total number of runners was", "output": 620.0}, {"input": "Max had 55.22 dollars, but after buying a toy for 49.57 dollars, he has", "output": 5.649999999999999}, {"input": "Tom had 16 trading cards and his brother gave him 29. Now he has", "output": 45.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 27 pieces of candy while her sister had 23. Together, they had", "output": 50.0}, {"input": "A building has 19 floors and each floor has 6 apartments. Total number of apartments in the building is", "output": 114.0}, {"input": "Initially, there were 140 pieces of candy. After sharing 34 with her friends, Sally has", "output": 106.0}, {"input": "A printer prints 10 pages per minute. After 10 minutes, the total pages printed are", "output": 100.0}, {"input": "A farmer harvested 365 bushels of corn and sold 80 bushels. He had left", "output": 285.0}, {"input": "Liam had 48 pieces of gum. After sharing 9 pieces with his friend, he had", "output": 39.0}, {"input": "A bookshelf held 173 books. After donating 96 to a library, it held", "output": 77.0}, {"input": "A movie theater had 262 seats filled. After 55 people left, the number of occupied seats was", "output": 207.0}, {"input": "A restaurant serves 41.79 meals per hour. During an 6.93-hour shift, the total meals served are", "output": 289.6047}, {"input": "A tank had 139.37 liters of water. After watering the garden with 36.80 liters, the amount remaining is", "output": 102.57000000000001}, {"input": "In a store, there were 118 candies. After 19 were eaten during a party, there were", "output": 99.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 30 pieces of candy while her sister had 11. Together, they had", "output": 41.0}, {"input": "At the start of the day, a parking lot had 140 cars. By evening, 29 cars had left. The number of cars remaining was", "output": 111.0}, {"input": "Each student gets 8 pencils, and there are 21 students. They distributed", "output": 168.0}, {"input": "A park had 280 trees. After 92 were cut down for safety reasons, the remaining number of trees was", "output": 188.0}, {"input": "Max had 127.28 dollars, but after buying a toy for 13.68 dollars, he has", "output": 113.6}, {"input": "Initially, there were 102 pieces of candy. After sharing 27 with her friends, Sally has", "output": 75.0}, {"input": "A movie theater has 24 rows of seats and each row has 17 seats. The total number of seats is", "output": 408.0}, {"input": "A total of 50 chocolates were divided equally among 5 children. Each child received", "output": 10.0}, {"input": "In the school library, there are 55 books in the fiction section and 63 books in the non-fiction section. Total books in both sections are", "output": 118.0}, {"input": "A company sells 382.52 units of product per month. If it operates for 6.36 months, the total units sold are", "output": 2432.8272}, {"input": "In the classroom, there were 23 red chairs and 11 blue chairs. The total number of chairs was", "output": 34.0}, {"input": "A baker made 280 cookies. After 80 were spoiled, the number left was", "output": 200.0}, {"input": "165 candies were shared equally among 5 friends. Each friend got", "output": 33.0}, {"input": "Wendy uploaded 20 pictures to Facebook. She dsitributes the pictures  uniformly into 5 different albums. Then, in each album there were", "output": 4.0}, {"input": "A farmer harvested 17 apples from one tree and 14 from another. Total apples harvested were", "output": 31.0}, {"input": "Henry had 26 pieces of candy. He ate 2 pieces, so he was left with", "output": 24.0}, {"input": "143 candies were shared equally among 11 friends. Each friend got", "output": 13.0}, {"input": "Tom had 20 trading cards and his brother gave him 43. Now he has", "output": 63.0}, {"input": "An author writes 12.65 pages per session. After 4.30 sessions, the total pages written are", "output": 54.394999999999996}, {"input": "The school had enrolled 455 students, but 90 transferred out. The number of students now is", "output": 365.0}, {"input": "Each box contains 28 apples, and there are 7 boxes. The total number of apples is", "output": 196.0}, {"input": "During a fundraiser, Alex raised 462 dollars and Jamie raised 141. Together, they raised", "output": 603.0}, {"input": "Henry had 30 pieces of candy. He ate 8 pieces, so he was left with", "output": 22.0}, {"input": "A student reads 23.42 pages per hour. After studying for 1.66 hours, the total pages read are", "output": 38.8772}, {"input": "In a marathon, 443 runners finished in less than four hours and 366 in more than four hours. The total number of runners was", "output": 809.0}, {"input": "A teacher has 17 students in each class and teaches 9 classes. She teaches", "output": 153.0}, {"input": "A blog gets 195 views per article. If 5 articles are published, the total views are", "output": 975.0}, {"input": "Faye had 26 coloring books. If she gives away 15 of them, she is left with", "output": 11.0}, {"input": "In a store, there were 99 candies. After 28 were eaten during a party, there were", "output": 71.0}, {"input": "A library had 265 books. After losing 35 books due to damage, the remaining books are", "output": 230.0}, {"input": "A library had 229 books. After losing 46 books due to damage, the remaining books are", "output": 183.0}, {"input": "In a library, there were 66 books on the first shelf and 42 books on the second shelf. Altogether, the shelves held", "output": 108.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 7 pieces of candy while her sister had 30. Together, they had", "output": 37.0}, {"input": "After finding 20 loose coins in the sofa and 46 coins in his backpack, Tim counted", "output": 66.0}, {"input": "Henry had 14 pieces of candy. He ate 1 pieces, so he was left with", "output": 13.0}, {"input": "A classroom had 46 pencils. After giving 10 to students, left were", "output": 36.0}, {"input": "A marathon runner completed 48.08 miles and took 6.13 breaks. He ran an average of", "output": 7.843393148450245}, {"input": "318 pages of a report were divided among 3 teams. Each team got", "output": 106.0}, {"input": "An office started the day with 596 sheets of paper. After using 197 for printing, remaining sheets are", "output": 399.0}, {"input": "At the concert, 301 tickets were sold online and 284 tickets were sold at the door. The total tickets sold were", "output": 585.0}, {"input": "A classroom had 60 pencils. After giving 10 to students, left were", "output": 50.0}, {"input": "At the concert, 101 tickets were sold online and 448 tickets were sold at the door. The total tickets sold were", "output": 549.0}, {"input": "During a fundraiser, Alex raised 430 dollars and Jamie raised 253. Together, they raised", "output": 683.0}, {"input": "In a store, there were 86 candies. After 11 were eaten during a party, there were", "output": 75.0}, {"input": "At the start of the day, a parking lot had 88 cars. By evening, 35 cars had left. The number of cars remaining was", "output": 53.0}, {"input": "A baker made 281 cookies. After 12 were spoiled, the number left was", "output": 269.0}, {"input": "A building has 28 floors and each floor has 2 apartments. Total number of apartments in the building is", "output": 56.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 22 pieces of candy while her sister had 4. Together, they had", "output": 26.0}, {"input": "A warehouse stored 1350 boxes. After relocating 600 boxes, the remaining boxes are", "output": 750.0}, {"input": "96 candies were shared equally among 16 friends. Each friend got", "output": 6.0}, {"input": "A farmer harvested 17 apples from one tree and 14 from another. Total apples harvested were", "output": 31.0}, {"input": "Sally picked 5 flowers and Molly picked 2. Together they picked", "output": 7.0}, {"input": "A classroom had 50 pencils. After giving 9 to students, left were", "output": 41.0}, {"input": "An author writes 12.52 pages per session. After 9.86 sessions, the total pages written are", "output": 123.4472}, {"input": "After making 341 paper cranes, Lisa gave away 81. She has left", "output": 260.0}, {"input": "A classroom had 38 chairs. After removing 17 broken chairs, the remaining chairs are", "output": 21.0}, {"input": "Faye had 34 coloring books. If she gives away 2 of them, she is left with", "output": 32.0}, {"input": "A farm produces 90.19 gallons of milk each day. Each gallon is sold for 4.50 dollars. Total daily income is", "output": 405.855}, {"input": "Sally picked 15 flowers and Molly picked 5. Together they picked", "output": 20.0}, {"input": "A tank had 133.78 liters of water. After watering the garden with 89.44 liters, the amount remaining is", "output": 44.34}, {"input": "A marathon runner completed 141.96 miles and took 5.32 breaks. He ran an average of", "output": 26.68421052631579}, {"input": "A warehouse stored 1370 boxes. After relocating 222 boxes, the remaining boxes are", "output": 1148.0}, {"input": "On a bus, there were 14 passengers initially and 8 more got on at the next stop. The total number of passengers was", "output": 22.0}, {"input": "Each box contains 25 apples, and there are 27 boxes. The total number of apples is", "output": 675.0}, {"input": "A student had 76 pages left to read in a book. After reading 19 pages, the remaining pages are", "output": 57.0}, {"input": "In the zoo, there were 7 lions and 8 tigers. The total number of these big cats is", "output": 15.0}, {"input": "A hiker distributed 66 trail mix packets among 6 friends. Each friend got", "output": 11.0}, {"input": "A park had 283 trees. After 59 were cut down for safety reasons, the remaining number of trees was", "output": 224.0}, {"input": "A bookshelf held 177 books. After donating 77 to a library, it held", "output": 100.0}, {"input": "A student reads 19.42 pages per hour. After studying for 1.85 hours, the total pages read are", "output": 35.92700000000001}, {"input": "A farm produces 61.82 gallons of milk each day. Each gallon is sold for 3.61 dollars. Total daily income is", "output": 223.1702}, {"input": "A gym has 72 members. Each member pays a monthly fee of 31 dollars. Total monthly income is", "output": 2232.0}, {"input": "A gym has 73 members. Each member pays a monthly fee of 64 dollars. Total monthly income is", "output": 4672.0}, {"input": "On a bus, there were 26 passengers initially and 14 more got on at the next stop. The total number of passengers was", "output": 40.0}, {"input": "A classroom had 32 chairs. After removing 7 broken chairs, the remaining chairs are", "output": 25.0}, {"input": "A tree bore 51 apples in summer and 104 in autumn. In total, it bore", "output": 155.0}, {"input": "In the garden, there were 27 red flowers and 93 yellow flowers. The total number of flowers is", "output": 120.0}, {"input": "A park had 241 trees. After 96 were cut down for safety reasons, the remaining number of trees was", "output": 145.0}, {"input": "A blog gets 219 views per article. If 11 articles are published, the total views are", "output": 2409.0}, {"input": "Each student gets 7 pencils, and there are 25 students. They distributed", "output": 175.0}, {"input": "A blog gets 292 views per article. If 16 articles are published, the total views are", "output": 4672.0}, {"input": "Each pack of stickers contains 10 stickers, and Sarah bought 8 packs. She has", "output": 80.0}, {"input": "Each student gets 8 pencils, and there are 50 students. They distributed", "output": 400.0}, {"input": "The museum had 810 visitors on Saturday. By closing, 93 had left, leaving", "output": 717.0}, {"input": "Sally picked 5 flowers and Molly picked 5. Together they picked", "output": 10.0}, {"input": "Each box contains 12 apples, and there are 25 boxes. The total number of apples is", "output": 300.0}, {"input": "A farmer harvested 438 bushels of corn and sold 77 bushels. He had left", "output": 361.0}, {"input": "A cyclist rides 13.03 miles per hour, and he cycled for 4.06 hours. He rode", "output": 52.901799999999994}, {"input": "A building has 83 floors and each floor has 7 apartments. Total number of apartments in the building is", "output": 581.0}, {"input": "During the game, the team scored 9 goals in the first half and 8 goals in the second half, making a total of", "output": 17.0}, {"input": "A baker baked 105 cookies. After selling 29 cookies, he was left with", "output": 76.0}, {"input": "Wendy uploaded 25 pictures to Facebook. She dsitributes the pictures  uniformly into 5 different albums. Then, in each album there were", "output": 5.0}, {"input": "A hiker had 19 energy bars. After eating 4 during the trek, he had", "output": 15.0}, {"input": "At the concert, 159 tickets were sold online and 355 tickets were sold at the door. The total tickets sold were", "output": 514.0}, {"input": "A classroom had 57 pencils. After giving 15 to students, left were", "output": 42.0}, {"input": "The school had enrolled 499 students, but 86 transferred out. The number of students now is", "output": 413.0}, {"input": "A printer prints 6.32 pages per minute. Over 40.03 minutes, it prints", "output": 252.98960000000002}, {"input": "A total of 55 chocolates were divided equally among 5 children. Each child received", "output": 11.0}, {"input": "A printer prints 4.72 pages per minute. Over 12.15 minutes, it prints", "output": 57.348}, {"input": "Liam had 45 pieces of gum. After sharing 18 pieces with his friend, he had", "output": 27.0}, {"input": "The library had 105 books in stock. After lending out 25 books, they had", "output": 80.0}, {"input": "In a factory, 28 workers each assemble 8 parts per day. Total parts assembled are", "output": 224.0}, {"input": "In the classroom, there were 13 red chairs and 23 blue chairs. The total number of chairs was", "output": 36.0}, {"input": "After finding 40 loose coins in the sofa and 6 coins in his backpack, Tim counted", "output": 46.0}, {"input": "A hiker had 15 energy bars. After eating 4 during the trek, he had", "output": 11.0}, {"input": "A gym has 75 members. Each member pays a monthly fee of 36 dollars. Total monthly income is", "output": 2700.0}, {"input": "Each pack of stickers contains 36 stickers, and Sarah bought 5 packs. She has", "output": 180.0}, {"input": "Each guest at the party gets 2 slices of cake, and there are 16 guests. In total, slices of cake are", "output": 32.0}, {"input": "In the classroom, there were 10 red chairs and 21 blue chairs. The total number of chairs was", "output": 31.0}, {"input": "Initially, there were 105 pieces of candy. After sharing 14 with her friends, Sally has", "output": 91.0}, {"input": "A hiker had 12 energy bars. After eating 1 during the trek, he had", "output": 11.0}, {"input": "Tom had 17 trading cards and his brother gave him 42. Now he has", "output": 59.0}, {"input": "Initially, there were 78 pieces of candy. After sharing 21 with her friends, Sally has", "output": 57.0}, {"input": "Initially, there were 61 pieces of candy. After sharing 40 with her friends, Sally has", "output": 21.0}, {"input": "A farm produces 57.12 gallons of milk each day. Each gallon is sold for 4.18 dollars. Total daily income is", "output": 238.7616}, {"input": "A movie theater had 249 seats filled. After 75 people left, the number of occupied seats was", "output": 174.0}, {"input": "In the school library, there are 90 books in the fiction section and 41 books in the non-fiction section. Total books in both sections are", "output": 131.0}, {"input": "A hiker distributed 80 trail mix packets among 2 friends. Each friend got", "output": 40.0}, {"input": "A building has 73 floors and each floor has 2 apartments. Total number of apartments in the building is", "output": 146.0}, {"input": "A gym has 68 members. Each member pays a monthly fee of 54 dollars. Total monthly income is", "output": 3672.0}, {"input": "Sally picked 9 flowers and Molly picked 6. Together they picked", "output": 15.0}, {"input": "Each box contains 44 apples, and there are 8 boxes. The total number of apples is", "output": 352.0}, {"input": "In a store, there were 81 candies. After 32 were eaten during a party, there were", "output": 49.0}, {"input": "A farm produces 69.82 gallons of milk each day. Each gallon is sold for 3.55 dollars. Total daily income is", "output": 247.86099999999996}, {"input": "During the game, the team scored 8 goals in the first half and 5 goals in the second half, making a total of", "output": 13.0}, {"input": "Henry had 16 pieces of candy. He ate 6 pieces, so he was left with", "output": 10.0}, {"input": "In a library, there were 49 books on the first shelf and 36 books on the second shelf. Altogether, the shelves held", "output": 85.0}, {"input": "Each student gets 5 pencils, and there are 35 students. They distributed", "output": 175.0}, {"input": "The library had 121 books in stock. After lending out 39 books, they had", "output": 82.0}, {"input": "A bookshelf held 242 books. After donating 79 to a library, it held", "output": 163.0}, {"input": "A cyclist rides 12.65 miles per hour, and he cycled for 9.89 hours. He rode", "output": 125.1085}, {"input": "Sally picked 16 flowers and Molly picked 8. Together they picked", "output": 24.0}, {"input": "A printer prints 17 pages per minute. After 2 minutes, the total pages printed are", "output": 34.0}, {"input": "After finding 37 loose coins in the sofa and 36 coins in his backpack, Tim counted", "output": 73.0}, {"input": "At the concert, 455 tickets were sold online and 491 tickets were sold at the door. The total tickets sold were", "output": 946.0}, {"input": "In the garden, there were 60 red flowers and 52 yellow flowers. The total number of flowers is", "output": 112.0}, {"input": "The museum had 671 visitors on Saturday. By closing, 61 had left, leaving", "output": 610.0}, {"input": "An office started the day with 727 sheets of paper. After using 174 for printing, remaining sheets are", "output": 553.0}, {"input": "A baker made 211 cookies. After 16 were spoiled, the number left was", "output": 195.0}, {"input": "An office started the day with 1000 sheets of paper. After using 230 for printing, remaining sheets are", "output": 770.0}, {"input": "A warehouse stored 1021 boxes. After relocating 315 boxes, the remaining boxes are", "output": 706.0}, {"input": "A tree bore 124 apples in summer and 141 in autumn. In total, it bore", "output": 265.0}, {"input": "A tree bore 70 apples in summer and 88 in autumn. In total, it bore", "output": 158.0}, {"input": "A bookshelf held 201 books. After donating 77 to a library, it held", "output": 124.0}, {"input": "In the school library, there are 89 books in the fiction section and 65 books in the non-fiction section. Total books in both sections are", "output": 154.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 13 pieces of candy while her sister had 23. Together, they had", "output": 36.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 5 pieces of candy while her sister had 15. Together, they had", "output": 20.0}, {"input": "A restaurant serves 44.30 meals per hour. During an 4.60-hour shift, the total meals served are", "output": 203.77999999999997}, {"input": "A baker baked 60 cookies. After selling 40 cookies, he was left with", "output": 20.0}, {"input": "On a bus, there were 26 passengers initially and 8 more got on at the next stop. The total number of passengers was", "output": 34.0}, {"input": "Sally picked 12 flowers and Molly picked 10. Together they picked", "output": 22.0}, {"input": "The school had enrolled 802 students, but 91 transferred out. The number of students now is", "output": 711.0}, {"input": "Max had 73.25 dollars, but after buying a toy for 32.25 dollars, he has", "output": 41.0}, {"input": "After making 215 paper cranes, Lisa gave away 120. She has left", "output": 95.0}, {"input": "In a marathon, 500 runners finished in less than four hours and 382 in more than four hours. The total number of runners was", "output": 882.0}, {"input": "Wendy uploaded 30 pictures to Facebook. She dsitributes the pictures  uniformly into 3 different albums. Then, in each album there were", "output": 10.0}, {"input": "A movie theater has 15 rows of seats and each row has 29 seats. The total number of seats is", "output": 435.0}, {"input": "A movie theater has 28 rows of seats and each row has 12 seats. The total number of seats is", "output": 336.0}, {"input": "A car has 4 wheels, and there are 9 cars in the showroom. The total number of wheels is", "output": 36.0}, {"input": "Sally picked 9 flowers and Molly picked 6. Together they picked", "output": 15.0}, {"input": "In a library, there were 53 books on the first shelf and 34 books on the second shelf. Altogether, the shelves held", "output": 87.0}, {"input": "A farmer harvested 343 bushels of corn and sold 76 bushels. He had left", "output": 267.0}, {"input": "In a store, there were 109 candies. After 31 were eaten during a party, there were", "output": 78.0}, {"input": "The library had 161 books in stock. After lending out 27 books, they had", "output": 134.0}, {"input": "On a bus, there were 16 passengers initially and 15 more got on at the next stop. The total number of passengers was", "output": 31.0}, {"input": "A bakery makes 17 cakes each day. Each cake sells for 26 dollars. Daily revenue is", "output": 442.0}, {"input": "In the garden, there were 25 red flowers and 89 yellow flowers. The total number of flowers is", "output": 114.0}, {"input": "A tank had 168.49 liters of water. After watering the garden with 20.10 liters, the amount remaining is", "output": 148.39000000000001}, {"input": "A tank had 100.31 liters of water. After watering the garden with 36.41 liters, the amount remaining is", "output": 63.900000000000006}, {"input": "In a library, there were 60 books on the first shelf and 25 books on the second shelf. Altogether, the shelves held", "output": 85.0}, {"input": "The museum had 907 visitors on Saturday. By closing, 121 had left, leaving", "output": 786.0}, {"input": "On a bus, there were 11 passengers initially and 6 more got on at the next stop. The total number of passengers was", "output": 17.0}, {"input": "A printer prints 12.16 pages per minute. Over 58.18 minutes, it prints", "output": 707.4688}, {"input": "A student had 84 pages left to read in a book. After reading 19 pages, the remaining pages are", "output": 65.0}, {"input": "On a bus, there were 30 passengers initially and 10 more got on at the next stop. The total number of passengers was", "output": 40.0}, {"input": "A classroom had 42 chairs. After removing 14 broken chairs, the remaining chairs are", "output": 28.0}, {"input": "On a bus, there were 27 passengers initially and 20 more got on at the next stop. The total number of passengers was", "output": 47.0}, {"input": "During the game, the team scored 10 goals in the first half and 8 goals in the second half, making a total of", "output": 18.0}, {"input": "In a factory, 43 workers each assemble 4 parts per day. Total parts assembled are", "output": 172.0}, {"input": "A craftsman makes 7 ornaments each week. Each is sold for 148 dollars. Weekly income from sales is", "output": 1036.0}, {"input": "Henry had 16 pieces of candy. He ate 8 pieces, so he was left with", "output": 8.0}, {"input": "A baker baked 112 cookies. After selling 37 cookies, he was left with", "output": 75.0}, {"input": "On a bus, there were 17 passengers initially and 17 more got on at the next stop. The total number of passengers was", "output": 34.0}, {"input": "In the classroom, there were 12 red chairs and 9 blue chairs. The total number of chairs was", "output": 21.0}, {"input": "After making 488 paper cranes, Lisa gave away 120. She has left", "output": 368.0}, {"input": "A park had 205 trees. After 93 were cut down for safety reasons, the remaining number of trees was", "output": 112.0}, {"input": "During a fundraiser, Alex raised 341 dollars and Jamie raised 290. Together, they raised", "output": 631.0}, {"input": "A farmer harvested 29 apples from one tree and 5 from another. Total apples harvested were", "output": 34.0}, {"input": "In a store, there were 83 candies. After 22 were eaten during a party, there were", "output": 61.0}, {"input": "On a bus, there were 14 passengers initially and 11 more got on at the next stop. The total number of passengers was", "output": 25.0}, {"input": "A farm produces 95.60 gallons of milk each day. Each gallon is sold for 4.86 dollars. Total daily income is", "output": 464.616}, {"input": "In a store, there were 86 candies. After 38 were eaten during a party, there were", "output": 48.0}, {"input": "In a marathon, 262 runners finished in less than four hours and 188 in more than four hours. The total number of runners was", "output": 450.0}, {"input": "Each box contains 18 apples, and there are 13 boxes. The total number of apples is", "output": 234.0}, {"input": "A library had 236 books. After losing 14 books due to damage, the remaining books are", "output": 222.0}, {"input": "A blog gets 165 views per article. If 10 articles are published, the total views are", "output": 1650.0}, {"input": "A farmer collected 137 eggs today. After selling 13 at the market, he had", "output": 124.0}, {"input": "The library had 183 books in stock. After lending out 33 books, they had", "output": 150.0}, {"input": "A tank had 135.15 liters of water. After watering the garden with 53.33 liters, the amount remaining is", "output": 81.82000000000001}, {"input": "Tom had 38 trading cards and his brother gave him 48. Now he has", "output": 86.0}, {"input": "Wendy uploaded 16 pictures to Facebook. She dsitributes the pictures  uniformly into 4 different albums. Then, in each album there were", "output": 4.0}, {"input": "At the concert, 329 tickets were sold online and 387 tickets were sold at the door. The total tickets sold were", "output": 716.0}, {"input": "A baker baked 136 cookies. After selling 38 cookies, he was left with", "output": 98.0}, {"input": "A classroom had 51 pencils. After giving 6 to students, left were", "output": 45.0}, {"input": "A tree bore 56 apples in summer and 183 in autumn. In total, it bore", "output": 239.0}, {"input": "A baker made 298 cookies. After 30 were spoiled, the number left was", "output": 268.0}, {"input": "A student reads 38.64 pages per hour. After studying for 2.53 hours, the total pages read are", "output": 97.75919999999999}, {"input": "A farmer harvested 252 bushels of corn and sold 85 bushels. He had left", "output": 167.0}, {"input": "A craftsman makes 13 ornaments each week. Each is sold for 127 dollars. Weekly income from sales is", "output": 1651.0}, {"input": "A gardener planted 105 flowers and organized them into 7 rows. Each row had", "output": 15.0}, {"input": "In a marathon, 235 runners finished in less than four hours and 304 in more than four hours. The total number of runners was", "output": 539.0}, {"input": "In the zoo, there were 10 lions and 5 tigers. The total number of these big cats is", "output": 15.0}, {"input": "In a store, there were 83 candies. After 18 were eaten during a party, there were", "output": 65.0}, {"input": "A classroom had 43 pencils. After giving 28 to students, left were", "output": 15.0}, {"input": "A teacher has 27 students in each class and teaches 8 classes. She teaches", "output": 216.0}, {"input": "A teacher has 24 students in each class and teaches 4 classes. She teaches", "output": 96.0}, {"input": "In a video game, each enemy defeated gives you 73.59 points. If a level has 73.46 enemies total and you destroy all of them, the points you earn are", "output": 5405.9214}, {"input": "Henry had 22 pieces of candy. He ate 1 pieces, so he was left with", "output": 21.0}, {"input": "The school had enrolled 872 students, but 66 transferred out. The number of students now is", "output": 806.0}, {"input": "A gym has 98 members. Each member pays a monthly fee of 44 dollars. Total monthly income is", "output": 4312.0}, {"input": "In a marathon, 356 runners finished in less than four hours and 172 in more than four hours. The total number of runners was", "output": 528.0}, {"input": "A craftsman makes 10 ornaments each week. Each is sold for 124 dollars. Weekly income from sales is", "output": 1240.0}, {"input": "A park had 219 trees. After 69 were cut down for safety reasons, the remaining number of trees was", "output": 150.0}, {"input": "A tree bore 122 apples in summer and 97 in autumn. In total, it bore", "output": 219.0}, {"input": "The museum had 935 visitors on Saturday. By closing, 69 had left, leaving", "output": 866.0}, {"input": "The museum had 914 visitors on Saturday. By closing, 136 had left, leaving", "output": 778.0}, {"input": "Each student gets 3 pencils, and there are 23 students. They distributed", "output": 69.0}, {"input": "A marathon runner completed 73.75 miles and took 1.02 breaks. He ran an average of", "output": 72.30392156862744}, {"input": "In a library, there were 56 books on the first shelf and 26 books on the second shelf. Altogether, the shelves held", "output": 82.0}, {"input": "A movie theater has 18 rows of seats and each row has 15 seats. The total number of seats is", "output": 270.0}, {"input": "A farm produces 90.84 gallons of milk each day. Each gallon is sold for 1.10 dollars. Total daily income is", "output": 99.924}, {"input": "A student had 69 pages left to read in a book. After reading 26 pages, the remaining pages are", "output": 43.0}, {"input": "A classroom had 57 pencils. After giving 9 to students, left were", "output": 48.0}, {"input": "A gym has 57 members. Each member pays a monthly fee of 34 dollars. Total monthly income is", "output": 1938.0}, {"input": "A printer prints 19.03 pages per minute. Over 34.52 minutes, it prints", "output": 656.9156000000002}, {"input": "During the game, the team scored 4 goals in the first half and 6 goals in the second half, making a total of", "output": 10.0}, {"input": "A baker made 227 cookies. After 11 were spoiled, the number left was", "output": 216.0}, {"input": "A baker made 207 cookies. After 18 were spoiled, the number left was", "output": 189.0}, {"input": "The school had enrolled 497 students, but 96 transferred out. The number of students now is", "output": 401.0}, {"input": "A blog gets 200 views per article. If 10 articles are published, the total views are", "output": 2000.0}, {"input": "Liam had 36 pieces of gum. After sharing 18 pieces with his friend, he had", "output": 18.0}, {"input": "A tree bore 184 apples in summer and 57 in autumn. In total, it bore", "output": 241.0}, {"input": "A warehouse stored 1234 boxes. After relocating 575 boxes, the remaining boxes are", "output": 659.0}, {"input": "A building has 48 floors and each floor has 9 apartments. Total number of apartments in the building is", "output": 432.0}, {"input": "A farm produces 61.11 gallons of milk each day. Each gallon is sold for 1.38 dollars. Total daily income is", "output": 84.33179999999999}, {"input": "A company sells 481.70 units of product per month. If it operates for 7.08 months, the total units sold are", "output": 3410.436}, {"input": "Each box contains 28 apples, and there are 6 boxes. The total number of apples is", "output": 168.0}, {"input": "In the classroom, there were 21 red chairs and 12 blue chairs. The total number of chairs was", "output": 33.0}, {"input": "After finding 20 loose coins in the sofa and 33 coins in his backpack, Tim counted", "output": 53.0}, {"input": "A student had 63 pages left to read in a book. After reading 30 pages, the remaining pages are", "output": 33.0}, {"input": "A marathon runner completed 38.56 miles and took 1.43 breaks. He ran an average of", "output": 26.965034965034967}, {"input": "A tree bore 124 apples in summer and 112 in autumn. In total, it bore", "output": 236.0}, {"input": "A warehouse stored 1301 boxes. After relocating 277 boxes, the remaining boxes are", "output": 1024.0}, {"input": "A student had 118 pages left to read in a book. After reading 20 pages, the remaining pages are", "output": 98.0}, {"input": "A farmer harvested 21 apples from one tree and 18 from another. Total apples harvested were", "output": 39.0}, {"input": "A baker made 265 cookies. After 53 were spoiled, the number left was", "output": 212.0}, {"input": "An office started the day with 839 sheets of paper. After using 277 for printing, remaining sheets are", "output": 562.0}, {"input": "A baker baked 134 cookies. After selling 35 cookies, he was left with", "output": 99.0}, {"input": "A baker baked 115 cookies. After selling 20 cookies, he was left with", "output": 95.0}, {"input": "A craftsman makes 10 ornaments each week. Each is sold for 55 dollars. Weekly income from sales is", "output": 550.0}, {"input": "Each pack of stickers contains 36 stickers, and Sarah bought 3 packs. She has", "output": 108.0}, {"input": "On a bus, there were 20 passengers initially and 8 more got on at the next stop. The total number of passengers was", "output": 28.0}, {"input": "A teacher has 19 students in each class and teaches 2 classes. She teaches", "output": 38.0}, {"input": "At the start of the day, a parking lot had 96 cars. By evening, 26 cars had left. The number of cars remaining was", "output": 70.0}, {"input": "Liam had 35 pieces of gum. After sharing 7 pieces with his friend, he had", "output": 28.0}, {"input": "A library had 275 books. After losing 39 books due to damage, the remaining books are", "output": 236.0}, {"input": "In the garden, there were 66 red flowers and 66 yellow flowers. The total number of flowers is", "output": 132.0}, {"input": "In a factory, 42 workers each assemble 2 parts per day. Total parts assembled are", "output": 84.0}, {"input": "A cyclist rides 42.05 miles per hour, and he cycled for 8.07 hours. He rode", "output": 339.3435}, {"input": "A farmer harvested 40 apples from one tree and 21 from another. Total apples harvested were", "output": 61.0}, {"input": "During the game, the team scored 4 goals in the first half and 6 goals in the second half, making a total of", "output": 10.0}, {"input": "A gym has 52 members. Each member pays a monthly fee of 45 dollars. Total monthly income is", "output": 2340.0}, {"input": "A blog gets 106 views per article. If 7 articles are published, the total views are", "output": 742.0}, {"input": "A baker baked 104 cookies. After selling 33 cookies, he was left with", "output": 71.0}, {"input": "A cyclist rides 36.85 miles per hour, and he cycled for 6.82 hours. He rode", "output": 251.317}, {"input": "Each student gets 5 pencils, and there are 42 students. They distributed", "output": 210.0}, {"input": "In the classroom, there were 19 red chairs and 6 blue chairs. The total number of chairs was", "output": 25.0}, {"input": "A bookshelf held 196 books. After donating 74 to a library, it held", "output": 122.0}, {"input": "A farmer harvested 442 bushels of corn and sold 62 bushels. He had left", "output": 380.0}, {"input": "Henry had 17 pieces of candy. He ate 4 pieces, so he was left with", "output": 13.0}, {"input": "A tree bore 121 apples in summer and 174 in autumn. In total, it bore", "output": 295.0}, {"input": "A restaurant serves 66.09 meals per hour. During an 1.40-hour shift, the total meals served are", "output": 92.526}, {"input": "A baker made 225 cookies. After 38 were spoiled, the number left was", "output": 187.0}, {"input": "The museum had 756 visitors on Saturday. By closing, 148 had left, leaving", "output": 608.0}, {"input": "In a video game, each enemy defeated gives you 36.66 points. If a level has 24.49 enemies total and you destroy all of them, the points you earn are", "output": 897.8033999999999}, {"input": "Tom had 21 trading cards and his brother gave him 33. Now he has", "output": 54.0}, {"input": "A farm produces 71.66 gallons of milk each day. Each gallon is sold for 4.96 dollars. Total daily income is", "output": 355.43359999999996}, {"input": "A tank had 169.93 liters of water. After watering the garden with 31.86 liters, the amount remaining is", "output": 138.07}, {"input": "At the start of the day, a parking lot had 193 cars. By evening, 17 cars had left. The number of cars remaining was", "output": 176.0}, {"input": "Sally picked 12 flowers and Molly picked 6. Together they picked", "output": 18.0}, {"input": "In a marathon, 395 runners finished in less than four hours and 331 in more than four hours. The total number of runners was", "output": 726.0}, {"input": "Each pack of stickers contains 42 stickers, and Sarah bought 3 packs. She has", "output": 126.0}, {"input": "A farm produces 58.64 gallons of milk each day. Each gallon is sold for 4.57 dollars. Total daily income is", "output": 267.9848}, {"input": "In a store, there were 90 candies. After 38 were eaten during a party, there were", "output": 52.0}, {"input": "In a marathon, 479 runners finished in less than four hours and 206 in more than four hours. The total number of runners was", "output": 685.0}, {"input": "A teacher has 14 students in each class and teaches 10 classes. She teaches", "output": 140.0}, {"input": "In the garden, there were 65 red flowers and 26 yellow flowers. The total number of flowers is", "output": 91.0}, {"input": "The museum had 523 visitors on Saturday. By closing, 133 had left, leaving", "output": 390.0}, {"input": "A building has 78 floors and each floor has 2 apartments. Total number of apartments in the building is", "output": 156.0}, {"input": "On a bus, there were 20 passengers initially and 18 more got on at the next stop. The total number of passengers was", "output": 38.0}, {"input": "On a bus, there were 28 passengers initially and 15 more got on at the next stop. The total number of passengers was", "output": 43.0}, {"input": "A classroom had 38 chairs. After removing 17 broken chairs, the remaining chairs are", "output": 21.0}, {"input": "Max had 106.21 dollars, but after buying a toy for 17.74 dollars, he has", "output": 88.47}, {"input": "Initially, there were 61 pieces of candy. After sharing 47 with her friends, Sally has", "output": 14.0}, {"input": "In the zoo, there were 10 lions and 4 tigers. The total number of these big cats is", "output": 14.0}, {"input": "A teacher has 22 students in each class and teaches 1 classes. She teaches", "output": 22.0}, {"input": "The teacher distributed 65 cookies among 5 students. Each student received", "output": 13.0}, {"input": "Each box contains 29 apples, and there are 15 boxes. The total number of apples is", "output": 435.0}, {"input": "Henry had 10 pieces of candy. He ate 5 pieces, so he was left with", "output": 5.0}, {"input": "A library had 211 books. After losing 26 books due to damage, the remaining books are", "output": 185.0}, {"input": "In a library, there were 67 books on the first shelf and 36 books on the second shelf. Altogether, the shelves held", "output": 103.0}, {"input": "A car has 4 wheels, and there are 8 cars in the showroom. The total number of wheels is", "output": 32.0}, {"input": "Faye had 32 coloring books. If she gives away 10 of them, she is left with", "output": 22.0}, {"input": "Sally picked 20 flowers and Molly picked 5. Together they picked", "output": 25.0}, {"input": "A marathon runner completed 60.90 miles and took 8.48 breaks. He ran an average of", "output": 7.181603773584905}, {"input": "A classroom had 50 pencils. After giving 21 to students, left were", "output": 29.0}, {"input": "A blog gets 204 views per article. If 4 articles are published, the total views are", "output": 816.0}, {"input": "A bakery makes 16 cakes each day. Each cake sells for 16 dollars. Daily revenue is", "output": 256.0}, {"input": "A park had 239 trees. After 72 were cut down for safety reasons, the remaining number of trees was", "output": 167.0}, {"input": "An office started the day with 796 sheets of paper. After using 224 for printing, remaining sheets are", "output": 572.0}, {"input": "Each guest at the party gets 3 slices of cake, and there are 24 guests. In total, slices of cake are", "output": 72.0}, {"input": "On a bus, there were 26 passengers initially and 11 more got on at the next stop. The total number of passengers was", "output": 37.0}, {"input": "A hiker had 16 energy bars. After eating 2 during the trek, he had", "output": 14.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 16 pieces of candy while her sister had 5. Together, they had", "output": 21.0}, {"input": "An office started the day with 817 sheets of paper. After using 248 for printing, remaining sheets are", "output": 569.0}, {"input": "An office started the day with 659 sheets of paper. After using 148 for printing, remaining sheets are", "output": 511.0}, {"input": "In a factory, 10 workers each assemble 10 parts per day. Total parts assembled are", "output": 100.0}, {"input": "During a fundraiser, Alex raised 324 dollars and Jamie raised 195. Together, they raised", "output": 519.0}, {"input": "Each box contains 11 apples, and there are 20 boxes. The total number of apples is", "output": 220.0}, {"input": "A craftsman makes 13 ornaments each week. Each is sold for 72 dollars. Weekly income from sales is", "output": 936.0}, {"input": "A farmer harvested 317 bushels of corn and sold 52 bushels. He had left", "output": 265.0}, {"input": "A marathon runner completed 45.72 miles and took 8.11 breaks. He ran an average of", "output": 5.637484586929717}, {"input": "Each box contains 36 apples, and there are 8 boxes. The total number of apples is", "output": 288.0}, {"input": "A blog gets 274 views per article. If 19 articles are published, the total views are", "output": 5206.0}, {"input": "A classroom had 34 chairs. After removing 15 broken chairs, the remaining chairs are", "output": 19.0}, {"input": "Each box contains 27 apples, and there are 9 boxes. The total number of apples is", "output": 243.0}, {"input": "In a library, there were 60 books on the first shelf and 32 books on the second shelf. Altogether, the shelves held", "output": 92.0}, {"input": "A craftsman makes 10 ornaments each week. Each is sold for 58 dollars. Weekly income from sales is", "output": 580.0}, {"input": "A car has 4 wheels, and there are 2 cars in the showroom. The total number of wheels is", "output": 8.0}, {"input": "In the classroom, there were 25 red chairs and 21 blue chairs. The total number of chairs was", "output": 46.0}, {"input": "Each box contains 33 apples, and there are 10 boxes. The total number of apples is", "output": 330.0}, {"input": "A printer prints 2.27 pages per minute. Over 49.71 minutes, it prints", "output": 112.8417}, {"input": "A tank had 145.02 liters of water. After watering the garden with 80.96 liters, the amount remaining is", "output": 64.06000000000002}, {"input": "A tank had 195.84 liters of water. After watering the garden with 30.60 liters, the amount remaining is", "output": 165.24}, {"input": "An orchard harvested 242 apples. These were divided among 11 baskets. Each basket got", "output": 22.0}, {"input": "A park had 233 trees. After 33 were cut down for safety reasons, the remaining number of trees was", "output": 200.0}, {"input": "Each box contains 16 apples, and there are 23 boxes. The total number of apples is", "output": 368.0}, {"input": "In the garden, there were 49 red flowers and 70 yellow flowers. The total number of flowers is", "output": 119.0}, {"input": "A baker made 219 cookies. After 18 were spoiled, the number left was", "output": 201.0}, {"input": "During a fundraiser, Alex raised 392 dollars and Jamie raised 195. Together, they raised", "output": 587.0}, {"input": "A teacher has 27 students in each class and teaches 8 classes. She teaches", "output": 216.0}, {"input": "A movie theater has 12 rows of seats and each row has 20 seats. The total number of seats is", "output": 240.0}, {"input": "A student reads 29.59 pages per hour. After studying for 2.80 hours, the total pages read are", "output": 82.85199999999999}, {"input": "In the garden, there were 95 red flowers and 28 yellow flowers. The total number of flowers is", "output": 123.0}, {"input": "The school had enrolled 317 students, but 99 transferred out. The number of students now is", "output": 218.0}, {"input": "A farmer harvested 437 bushels of corn and sold 73 bushels. He had left", "output": 364.0}, {"input": "In a store, there were 114 candies. After 40 were eaten during a party, there were", "output": 74.0}, {"input": "In a video game, each enemy defeated gives you 27.67 points. If a level has 78.94 enemies total and you destroy all of them, the points you earn are", "output": 2184.2698}, {"input": "A park had 255 trees. After 33 were cut down for safety reasons, the remaining number of trees was", "output": 222.0}, {"input": "Wendy uploaded 10 pictures to Facebook. She dsitributes the pictures  uniformly into 10 different albums. Then, in each album there were", "output": 1.0}, {"input": "Henry had 29 pieces of candy. He ate 5 pieces, so he was left with", "output": 24.0}, {"input": "A bookshelf held 247 books. After donating 77 to a library, it held", "output": 170.0}, {"input": "During the game, the team scored 8 goals in the first half and 3 goals in the second half, making a total of", "output": 11.0}, {"input": "The school had enrolled 760 students, but 58 transferred out. The number of students now is", "output": 702.0}, {"input": "A printer prints 4.29 pages per minute. Over 45.34 minutes, it prints", "output": 194.50860000000003}, {"input": "A craftsman makes 13 ornaments each week. Each is sold for 71 dollars. Weekly income from sales is", "output": 923.0}, {"input": "A classroom had 46 chairs. After removing 15 broken chairs, the remaining chairs are", "output": 31.0}, {"input": "In a factory, 30 workers each assemble 5 parts per day. Total parts assembled are", "output": 150.0}, {"input": "A company has 80 employees and they are organized into 4 teams. Each team has", "output": 20.0}, {"input": "A farmer collected 188 eggs today. After selling 16 at the market, he had", "output": 172.0}, {"input": "Max had 93.52 dollars, but after buying a toy for 29.30 dollars, he has", "output": 64.22}, {"input": "A bakery makes 5 cakes each day. Each cake sells for 22 dollars. Daily revenue is", "output": 110.0}, {"input": "A tank had 138.94 liters of water. After watering the garden with 31.15 liters, the amount remaining is", "output": 107.78999999999999}, {"input": "A farmer harvested 17 apples from one tree and 9 from another. Total apples harvested were", "output": 26.0}, {"input": "After making 491 paper cranes, Lisa gave away 104. She has left", "output": 387.0}, {"input": "A farmer collected 135 eggs today. After selling 37 at the market, he had", "output": 98.0}, {"input": "Initially, there were 97 pieces of candy. After sharing 24 with her friends, Sally has", "output": 73.0}, {"input": "During the game, the team scored 1 goals in the first half and 6 goals in the second half, making a total of", "output": 7.0}, {"input": "A baker made 212 cookies. After 41 were spoiled, the number left was", "output": 171.0}, {"input": "A movie theater had 248 seats filled. After 74 people left, the number of occupied seats was", "output": 174.0}, {"input": "A building has 74 floors and each floor has 1 apartments. Total number of apartments in the building is", "output": 74.0}, {"input": "After making 350 paper cranes, Lisa gave away 159. She has left", "output": 191.0}, {"input": "Initially, there were 133 pieces of candy. After sharing 15 with her friends, Sally has", "output": 118.0}, {"input": "A baker made 201 cookies. After 70 were spoiled, the number left was", "output": 131.0}, {"input": "An author writes 11.40 pages per session. After 6.90 sessions, the total pages written are", "output": 78.66000000000001}, {"input": "A craftsman makes 15 ornaments each week. Each is sold for 106 dollars. Weekly income from sales is", "output": 1590.0}, {"input": "A warehouse stored 1300 boxes. After relocating 600 boxes, the remaining boxes are", "output": 700.0}, {"input": "A teacher has 18 students in each class and teaches 5 classes. She teaches", "output": 90.0}, {"input": "A student reads 16.65 pages per hour. After studying for 4.35 hours, the total pages read are", "output": 72.4275}, {"input": "A farmer harvested 20 apples from one tree and 7 from another. Total apples harvested were", "output": 27.0}, {"input": "At the start of the day, a parking lot had 149 cars. By evening, 27 cars had left. The number of cars remaining was", "output": 122.0}, {"input": "A printer prints 14 pages per minute. After 6 minutes, the total pages printed are", "output": 84.0}, {"input": "During the game, the team scored 2 goals in the first half and 2 goals in the second half, making a total of", "output": 4.0}, {"input": "A printer prints 29 pages per minute. After 12 minutes, the total pages printed are", "output": 348.0}, {"input": "A teacher has 19 students in each class and teaches 2 classes. She teaches", "output": 38.0}, {"input": "A tank had 150.00 liters of water. After watering the garden with 32.08 liters, the amount remaining is", "output": 117.92}, {"input": "A farmer collected 109 eggs today. After selling 29 at the market, he had", "output": 80.0}, {"input": "A baker made 212 cookies. After 74 were spoiled, the number left was", "output": 138.0}, {"input": "A baker made 259 cookies. After 35 were spoiled, the number left was", "output": 224.0}, {"input": "An office started the day with 562 sheets of paper. After using 207 for printing, remaining sheets are", "output": 355.0}, {"input": "A restaurant serves 33.89 meals per hour. During an 4.36-hour shift, the total meals served are", "output": 147.7604}, {"input": "A tank had 150.39 liters of water. After watering the garden with 69.54 liters, the amount remaining is", "output": 80.84999999999998}, {"input": "A cyclist rides 34.75 miles per hour, and he cycled for 6.78 hours. He rode", "output": 235.60500000000002}, {"input": "After making 281 paper cranes, Lisa gave away 125. She has left", "output": 156.0}, {"input": "A bakery makes 7 cakes each day. Each cake sells for 15 dollars. Daily revenue is", "output": 105.0}, {"input": "The school had enrolled 875 students, but 133 transferred out. The number of students now is", "output": 742.0}, {"input": "A student reads 10.52 pages per hour. After studying for 3.40 hours, the total pages read are", "output": 35.768}, {"input": "During the game, the team scored 7 goals in the first half and 2 goals in the second half, making a total of", "output": 9.0}, {"input": "A movie theater has 16 rows of seats and each row has 17 seats. The total number of seats is", "output": 272.0}, {"input": "A baker baked 115 cookies. After selling 22 cookies, he was left with", "output": 93.0}, {"input": "In a video game, each enemy defeated gives you 66.60 points. If a level has 57.81 enemies total and you destroy all of them, the points you earn are", "output": 3850.1459999999997}, {"input": "A teacher has 23 students in each class and teaches 2 classes. She teaches", "output": 46.0}, {"input": "A classroom had 42 chairs. After removing 19 broken chairs, the remaining chairs are", "output": 23.0}, {"input": "In the garden, there were 33 red flowers and 100 yellow flowers. The total number of flowers is", "output": 133.0}, {"input": "A library had 246 books. After losing 50 books due to damage, the remaining books are", "output": 196.0}, {"input": "A bakery makes 12 cakes each day. Each cake sells for 29 dollars. Daily revenue is", "output": 348.0}, {"input": "A student reads 39.82 pages per hour. After studying for 4.93 hours, the total pages read are", "output": 196.3126}, {"input": "A blog gets 293 views per article. If 5 articles are published, the total views are", "output": 1465.0}, {"input": "A car has 6 wheels, and there are 8 cars in the showroom. The total number of wheels is", "output": 48.0}, {"input": "A park had 296 trees. After 49 were cut down for safety reasons, the remaining number of trees was", "output": 247.0}, {"input": "A movie theater has 14 rows of seats and each row has 23 seats. The total number of seats is", "output": 322.0}, {"input": "A hiker had 19 energy bars. After eating 4 during the trek, he had", "output": 15.0}, {"input": "On a bus, there were 19 passengers initially and 14 more got on at the next stop. The total number of passengers was", "output": 33.0}, {"input": "After finding 29 loose coins in the sofa and 35 coins in his backpack, Tim counted", "output": 64.0}, {"input": "A car has 6 wheels, and there are 4 cars in the showroom. The total number of wheels is", "output": 24.0}, {"input": "Liam had 39 pieces of gum. After sharing 9 pieces with his friend, he had", "output": 30.0}, {"input": "In the garden, there were 90 red flowers and 31 yellow flowers. The total number of flowers is", "output": 121.0}, {"input": "A marathon runner completed 160.41 miles and took 7.37 breaks. He ran an average of", "output": 21.765264586160107}, {"input": "Each box contains 23 apples, and there are 26 boxes. The total number of apples is", "output": 598.0}, {"input": "Each box contains 44 apples, and there are 7 boxes. The total number of apples is", "output": 308.0}, {"input": "During the game, the team scored 7 goals in the first half and 2 goals in the second half, making a total of", "output": 9.0}, {"input": "After finding 16 loose coins in the sofa and 44 coins in his backpack, Tim counted", "output": 60.0}, {"input": "In a library, there were 43 books on the first shelf and 44 books on the second shelf. Altogether, the shelves held", "output": 87.0}, {"input": "A bakery makes 20 cakes each day. Each cake sells for 18 dollars. Daily revenue is", "output": 360.0}, {"input": "Max had 84.67 dollars, but after buying a toy for 37.16 dollars, he has", "output": 47.510000000000005}, {"input": "A baker baked 128 cookies. After selling 27 cookies, he was left with", "output": 101.0}, {"input": "A movie theater had 239 seats filled. After 59 people left, the number of occupied seats was", "output": 180.0}, {"input": "A park had 222 trees. After 78 were cut down for safety reasons, the remaining number of trees was", "output": 144.0}, {"input": "A library had 286 books. After losing 45 books due to damage, the remaining books are", "output": 241.0}, {"input": "In the garden, there were 78 red flowers and 58 yellow flowers. The total number of flowers is", "output": 136.0}, {"input": "After making 297 paper cranes, Lisa gave away 69. She has left", "output": 228.0}, {"input": "The museum had 991 visitors on Saturday. By closing, 117 had left, leaving", "output": 874.0}, {"input": "Each box contains 29 apples, and there are 5 boxes. The total number of apples is", "output": 145.0}, {"input": "During the game, the team scored 9 goals in the first half and 8 goals in the second half, making a total of", "output": 17.0}, {"input": "A park had 252 trees. After 34 were cut down for safety reasons, the remaining number of trees was", "output": 218.0}, {"input": "In a library, there were 41 books on the first shelf and 26 books on the second shelf. Altogether, the shelves held", "output": 67.0}, {"input": "Each guest at the party gets 1 slices of cake, and there are 32 guests. In total, slices of cake are", "output": 32.0}, {"input": "A library had 219 books. After losing 19 books due to damage, the remaining books are", "output": 200.0}, {"input": "A farmer harvested 49 apples from one tree and 25 from another. Total apples harvested were", "output": 74.0}, {"input": "The school had enrolled 716 students, but 111 transferred out. The number of students now is", "output": 605.0}, {"input": "A hiker had 16 energy bars. After eating 1 during the trek, he had", "output": 15.0}, {"input": "An office started the day with 688 sheets of paper. After using 202 for printing, remaining sheets are", "output": 486.0}, {"input": "Sally picked 13 flowers and Molly picked 1. Together they picked", "output": 14.0}, {"input": "A student had 119 pages left to read in a book. After reading 14 pages, the remaining pages are", "output": 105.0}, {"input": "In the garden, there were 61 red flowers and 26 yellow flowers. The total number of flowers is", "output": 87.0}, {"input": "Liam had 49 pieces of gum. After sharing 14 pieces with his friend, he had", "output": 35.0}, {"input": "During a fundraiser, Alex raised 334 dollars and Jamie raised 112. Together, they raised", "output": 446.0}, {"input": "A gym has 51 members. Each member pays a monthly fee of 62 dollars. Total monthly income is", "output": 3162.0}, {"input": "A classroom had 54 pencils. After giving 12 to students, left were", "output": 42.0}, {"input": "At the concert, 296 tickets were sold online and 164 tickets were sold at the door. The total tickets sold were", "output": 460.0}, {"input": "A cyclist rides 41.12 miles per hour, and he cycled for 11.40 hours. He rode", "output": 468.768}, {"input": "A blog gets 197 views per article. If 10 articles are published, the total views are", "output": 1970.0}, {"input": "Each student gets 5 pencils, and there are 43 students. They distributed", "output": 215.0}, {"input": "Sally picked 11 flowers and Molly picked 8. Together they picked", "output": 19.0}, {"input": "A student reads 28.88 pages per hour. After studying for 3.20 hours, the total pages read are", "output": 92.416}, {"input": "A movie theater has 25 rows of seats and each row has 18 seats. The total number of seats is", "output": 450.0}, {"input": "After finding 42 loose coins in the sofa and 11 coins in his backpack, Tim counted", "output": 53.0}, {"input": "During a fundraiser, Alex raised 195 dollars and Jamie raised 263. Together, they raised", "output": 458.0}, {"input": "An office started the day with 851 sheets of paper. After using 128 for printing, remaining sheets are", "output": 723.0}, {"input": "In a library, there were 69 books on the first shelf and 38 books on the second shelf. Altogether, the shelves held", "output": 107.0}, {"input": "A tank had 193.23 liters of water. After watering the garden with 81.56 liters, the amount remaining is", "output": 111.66999999999999}, {"input": "A printer prints 3.91 pages per minute. Over 54.29 minutes, it prints", "output": 212.2739}, {"input": "A warehouse stored 1275 boxes. After relocating 326 boxes, the remaining boxes are", "output": 949.0}, {"input": "A blog gets 182 views per article. If 14 articles are published, the total views are", "output": 2548.0}, {"input": "A warehouse stored 1229 boxes. After relocating 522 boxes, the remaining boxes are", "output": 707.0}, {"input": "Faye had 29 coloring books. If she gives away 14 of them, she is left with", "output": 15.0}, {"input": "After making 362 paper cranes, Lisa gave away 84. She has left", "output": 278.0}, {"input": "A warehouse stored 1119 boxes. After relocating 358 boxes, the remaining boxes are", "output": 761.0}, {"input": "An office started the day with 659 sheets of paper. After using 131 for printing, remaining sheets are", "output": 528.0}, {"input": "Sally picked 12 flowers and Molly picked 8. Together they picked", "output": 20.0}, {"input": "During a fundraiser, Alex raised 497 dollars and Jamie raised 285. Together, they raised", "output": 782.0}, {"input": "Max had 139.61 dollars, but after buying a toy for 11.69 dollars, he has", "output": 127.92000000000002}, {"input": "After finding 5 loose coins in the sofa and 27 coins in his backpack, Tim counted", "output": 32.0}, {"input": "A movie theater has 23 rows of seats and each row has 29 seats. The total number of seats is", "output": 667.0}, {"input": "A student had 120 pages left to read in a book. After reading 31 pages, the remaining pages are", "output": 89.0}, {"input": "A classroom had 31 chairs. After removing 14 broken chairs, the remaining chairs are", "output": 17.0}, {"input": "At the concert, 174 tickets were sold online and 391 tickets were sold at the door. The total tickets sold were", "output": 565.0}, {"input": "Each box contains 25 apples, and there are 13 boxes. The total number of apples is", "output": 325.0}, {"input": "In a library, there were 50 books on the first shelf and 44 books on the second shelf. Altogether, the shelves held", "output": 94.0}, {"input": "A movie theater has 17 rows of seats and each row has 29 seats. The total number of seats is", "output": 493.0}, {"input": "A classroom had 35 chairs. After removing 13 broken chairs, the remaining chairs are", "output": 22.0}, {"input": "A park had 252 trees. After 82 were cut down for safety reasons, the remaining number of trees was", "output": 170.0}, {"input": "In the zoo, there were 8 lions and 4 tigers. The total number of these big cats is", "output": 12.0}, {"input": "A classroom had 40 chairs. After removing 15 broken chairs, the remaining chairs are", "output": 25.0}, {"input": "An office started the day with 749 sheets of paper. After using 130 for printing, remaining sheets are", "output": 619.0}, {"input": "In a video game, each enemy defeated gives you 15.53 points. If a level has 53.73 enemies total and you destroy all of them, the points you earn are", "output": 834.4268999999999}, {"input": "The school had enrolled 501 students, but 72 transferred out. The number of students now is", "output": 429.0}, {"input": "Liam had 34 pieces of gum. After sharing 7 pieces with his friend, he had", "output": 27.0}, {"input": "A blog gets 167 views per article. If 13 articles are published, the total views are", "output": 2171.0}, {"input": "A printer prints 17 pages per minute. After 12 minutes, the total pages printed are", "output": 204.0}, {"input": "A park had 259 trees. After 86 were cut down for safety reasons, the remaining number of trees was", "output": 173.0}, {"input": "A hiker had 19 energy bars. After eating 2 during the trek, he had", "output": 17.0}, {"input": "A student reads 28.34 pages per hour. After studying for 3.05 hours, the total pages read are", "output": 86.437}, {"input": "At the concert, 435 tickets were sold online and 271 tickets were sold at the door. The total tickets sold were", "output": 706.0}, {"input": "A farmer harvested 33 apples from one tree and 8 from another. Total apples harvested were", "output": 41.0}, {"input": "A hiker had 16 energy bars. After eating 4 during the trek, he had", "output": 12.0}, {"input": "After finding 33 loose coins in the sofa and 29 coins in his backpack, Tim counted", "output": 62.0}, {"input": "Faye had 44 coloring books. If she gives away 4 of them, she is left with", "output": 40.0}, {"input": "Max had 124.67 dollars, but after buying a toy for 25.14 dollars, he has", "output": 99.53}, {"input": "In a video game, each enemy defeated gives you 65.91 points. If a level has 66.55 enemies total and you destroy all of them, the points you earn are", "output": 4386.3105}, {"input": "A cyclist rides 28.62 miles per hour, and he cycled for 3.90 hours. He rode", "output": 111.618}, {"input": "In the garden, there were 55 red flowers and 87 yellow flowers. The total number of flowers is", "output": 142.0}, {"input": "A company has 184 employees and they are organized into 8 teams. Each team has", "output": 23.0}, {"input": "After finding 5 loose coins in the sofa and 39 coins in his backpack, Tim counted", "output": 44.0}, {"input": "A building has 77 floors and each floor has 4 apartments. Total number of apartments in the building is", "output": 308.0}, {"input": "In the garden, there were 77 red flowers and 81 yellow flowers. The total number of flowers is", "output": 158.0}, {"input": "Tom had 38 trading cards and his brother gave him 40. Now he has", "output": 78.0}, {"input": "A movie theater has 22 rows of seats and each row has 18 seats. The total number of seats is", "output": 396.0}, {"input": "A baker made 280 cookies. After 36 were spoiled, the number left was", "output": 244.0}, {"input": "A student had 101 pages left to read in a book. After reading 42 pages, the remaining pages are", "output": 59.0}, {"input": "A printer prints 8.95 pages per minute. Over 50.36 minutes, it prints", "output": 450.722}, {"input": "Tom had 32 trading cards and his brother gave him 28. Now he has", "output": 60.0}, {"input": "At the concert, 381 tickets were sold online and 231 tickets were sold at the door. The total tickets sold were", "output": 612.0}, {"input": "In a video game, each enemy defeated gives you 62.82 points. If a level has 36.32 enemies total and you destroy all of them, the points you earn are", "output": 2281.6224}, {"input": "A farmer collected 675 eggs and packed them into 9 cartons. Each carton holds", "output": 75.0}, {"input": "Liam had 31 pieces of gum. After sharing 20 pieces with his friend, he had", "output": 11.0}, {"input": "A farmer collected 102 eggs today. After selling 24 at the market, he had", "output": 78.0}, {"input": "In a library, there were 49 books on the first shelf and 29 books on the second shelf. Altogether, the shelves held", "output": 78.0}, {"input": "A farmer harvested 356 bushels of corn and sold 50 bushels. He had left", "output": 306.0}, {"input": "Each student gets 8 pencils, and there are 12 students. They distributed", "output": 96.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 18 pieces of candy while her sister had 15. Together, they had", "output": 33.0}, {"input": "Henry had 23 pieces of candy. He ate 8 pieces, so he was left with", "output": 15.0}, {"input": "A blog gets 212 views per article. If 2 articles are published, the total views are", "output": 424.0}, {"input": "Max had 70.48 dollars, but after buying a toy for 44.38 dollars, he has", "output": 26.1}, {"input": "In the garden, there were 42 red flowers and 31 yellow flowers. The total number of flowers is", "output": 73.0}, {"input": "Each box contains 24 apples, and there are 8 boxes. The total number of apples is", "output": 192.0}, {"input": "A marathon runner completed 50.62 miles and took 2.39 breaks. He ran an average of", "output": 21.17991631799163}, {"input": "A teacher has 14 students in each class and teaches 5 classes. She teaches", "output": 70.0}, {"input": "Sally picked 18 flowers and Molly picked 4. Together they picked", "output": 22.0}, {"input": "In the classroom, there were 20 red chairs and 17 blue chairs. The total number of chairs was", "output": 37.0}, {"input": "A tank had 190.10 liters of water. After watering the garden with 47.26 liters, the amount remaining is", "output": 142.84}, {"input": "A tree bore 114 apples in summer and 88 in autumn. In total, it bore", "output": 202.0}, {"input": "A library had 222 books. After losing 15 books due to damage, the remaining books are", "output": 207.0}, {"input": "A craftsman makes 11 ornaments each week. Each is sold for 114 dollars. Weekly income from sales is", "output": 1254.0}, {"input": "In the classroom, there were 24 red chairs and 24 blue chairs. The total number of chairs was", "output": 48.0}, {"input": "After making 359 paper cranes, Lisa gave away 50. She has left", "output": 309.0}, {"input": "A student had 75 pages left to read in a book. After reading 10 pages, the remaining pages are", "output": 65.0}, {"input": "Each student gets 8 pencils, and there are 12 students. They distributed", "output": 96.0}, {"input": "At the start of the day, a parking lot had 180 cars. By evening, 34 cars had left. The number of cars remaining was", "output": 146.0}, {"input": "In the school library, there are 61 books in the fiction section and 49 books in the non-fiction section. Total books in both sections are", "output": 110.0}, {"input": "In a factory, 34 workers each assemble 9 parts per day. Total parts assembled are", "output": 306.0}, {"input": "A craftsman makes 9 ornaments each week. Each is sold for 147 dollars. Weekly income from sales is", "output": 1323.0}, {"input": "Each student gets 4 pencils, and there are 45 students. They distributed", "output": 180.0}, {"input": "A blog gets 263 views per article. If 7 articles are published, the total views are", "output": 1841.0}, {"input": "Each pack of stickers contains 13 stickers, and Sarah bought 2 packs. She has", "output": 26.0}, {"input": "A building has 13 floors and each floor has 1 apartments. Total number of apartments in the building is", "output": 13.0}, {"input": "A car has 5 wheels, and there are 6 cars in the showroom. The total number of wheels is", "output": 30.0}, {"input": "A baker baked 85 cookies. After selling 34 cookies, he was left with", "output": 51.0}, {"input": "The school had enrolled 491 students, but 55 transferred out. The number of students now is", "output": 436.0}, {"input": "A building has 61 floors and each floor has 2 apartments. Total number of apartments in the building is", "output": 122.0}, {"input": "A craftsman makes 12 ornaments each week. Each is sold for 142 dollars. Weekly income from sales is", "output": 1704.0}, {"input": "During the game, the team scored 6 goals in the first half and 4 goals in the second half, making a total of", "output": 10.0}, {"input": "A baker baked 112 cookies. After selling 37 cookies, he was left with", "output": 75.0}, {"input": "Tom had 24 trading cards and his brother gave him 24. Now he has", "output": 48.0}, {"input": "A farmer collected 540 eggs and packed them into 15 cartons. Each carton holds", "output": 36.0}, {"input": "A baker baked 97 cookies. After selling 35 cookies, he was left with", "output": 62.0}, {"input": "A hiker had 15 energy bars. After eating 3 during the trek, he had", "output": 12.0}, {"input": "After making 461 paper cranes, Lisa gave away 79. She has left", "output": 382.0}, {"input": "A tree bore 136 apples in summer and 158 in autumn. In total, it bore", "output": 294.0}, {"input": "After finding 28 loose coins in the sofa and 7 coins in his backpack, Tim counted", "output": 35.0}, {"input": "A classroom had 31 chairs. After removing 9 broken chairs, the remaining chairs are", "output": 22.0}, {"input": "In a marathon, 322 runners finished in less than four hours and 269 in more than four hours. The total number of runners was", "output": 591.0}, {"input": "A movie theater had 210 seats filled. After 67 people left, the number of occupied seats was", "output": 143.0}, {"input": "A movie theater has 30 rows of seats and each row has 15 seats. The total number of seats is", "output": 450.0}, {"input": "In the garden, there were 20 red flowers and 48 yellow flowers. The total number of flowers is", "output": 68.0}, {"input": "Initially, there were 111 pieces of candy. After sharing 11 with her friends, Sally has", "output": 100.0}, {"input": "Max had 135.58 dollars, but after buying a toy for 20.33 dollars, he has", "output": 115.25000000000001}, {"input": "A farmer harvested 41 apples from one tree and 20 from another. Total apples harvested were", "output": 61.0}, {"input": "After finding 23 loose coins in the sofa and 18 coins in his backpack, Tim counted", "output": 41.0}, {"input": "A craftsman makes 12 ornaments each week. Each is sold for 124 dollars. Weekly income from sales is", "output": 1488.0}, {"input": "Wendy uploaded 20 pictures to Facebook. She dsitributes the pictures  uniformly into 2 different albums. Then, in each album there were", "output": 10.0}, {"input": "A restaurant serves 65.57 meals per hour. During an 3.71-hour shift, the total meals served are", "output": 243.26469999999998}, {"input": "A car has 6 wheels, and there are 4 cars in the showroom. The total number of wheels is", "output": 24.0}, {"input": "A tank had 152.42 liters of water. After watering the garden with 64.58 liters, the amount remaining is", "output": 87.83999999999999}, {"input": "The museum had 698 visitors on Saturday. By closing, 101 had left, leaving", "output": 597.0}, {"input": "Faye had 31 coloring books. If she gives away 3 of them, she is left with", "output": 28.0}, {"input": "A farmer collected 139 eggs today. After selling 17 at the market, he had", "output": 122.0}, {"input": "An office started the day with 782 sheets of paper. After using 115 for printing, remaining sheets are", "output": 667.0}, {"input": "Faye had 32 coloring books. If she gives away 7 of them, she is left with", "output": 25.0}, {"input": "An author writes 13.41 pages per session. After 7.57 sessions, the total pages written are", "output": 101.5137}, {"input": "A farm produces 86.11 gallons of milk each day. Each gallon is sold for 3.13 dollars. Total daily income is", "output": 269.5243}, {"input": "A gym has 74 members. Each member pays a monthly fee of 50 dollars. Total monthly income is", "output": 3700.0}, {"input": "A movie theater has 21 rows of seats and each row has 29 seats. The total number of seats is", "output": 609.0}, {"input": "After finding 6 loose coins in the sofa and 36 coins in his backpack, Tim counted", "output": 42.0}, {"input": "In a marathon, 488 runners finished in less than four hours and 188 in more than four hours. The total number of runners was", "output": 676.0}, {"input": "In a store, there were 88 candies. After 34 were eaten during a party, there were", "output": 54.0}, {"input": "A tank had 102.63 liters of water. After watering the garden with 64.62 liters, the amount remaining is", "output": 38.00999999999999}, {"input": "A cyclist rides 38.26 miles per hour, and he cycled for 9.50 hours. He rode", "output": 363.46999999999997}, {"input": "Each student gets 9 pencils, and there are 35 students. They distributed", "output": 315.0}, {"input": "Tom had 29 trading cards and his brother gave him 38. Now he has", "output": 67.0}, {"input": "A library had 283 books. After losing 21 books due to damage, the remaining books are", "output": 262.0}, {"input": "A student reads 26.10 pages per hour. After studying for 2.36 hours, the total pages read are", "output": 61.596000000000004}, {"input": "In the garden, there were 77 red flowers and 42 yellow flowers. The total number of flowers is", "output": 119.0}, {"input": "Max had 145.28 dollars, but after buying a toy for 15.31 dollars, he has", "output": 129.97}, {"input": "In the classroom, there were 13 red chairs and 6 blue chairs. The total number of chairs was", "output": 19.0}, {"input": "A marathon runner completed 169.46 miles and took 5.31 breaks. He ran an average of", "output": 31.913370998116765}, {"input": "A classroom had 48 chairs. After removing 10 broken chairs, the remaining chairs are", "output": 38.0}, {"input": "A restaurant serves 50.18 meals per hour. During an 9.09-hour shift, the total meals served are", "output": 456.1362}, {"input": "On a bus, there were 11 passengers initially and 19 more got on at the next stop. The total number of passengers was", "output": 30.0}, {"input": "A hiker had 12 energy bars. After eating 3 during the trek, he had", "output": 9.0}, {"input": "In a video game, each enemy defeated gives you 45.72 points. If a level has 36.86 enemies total and you destroy all of them, the points you earn are", "output": 1685.2392}, {"input": "A classroom had 40 pencils. After giving 18 to students, left were", "output": 22.0}, {"input": "The library had 162 books in stock. After lending out 32 books, they had", "output": 130.0}, {"input": "Each box contains 31 apples, and there are 3 boxes. The total number of apples is", "output": 93.0}, {"input": "A bookshelf held 205 books. After donating 56 to a library, it held", "output": 149.0}, {"input": "A cyclist rides 16.62 miles per hour, and he cycled for 10.47 hours. He rode", "output": 174.0114}, {"input": "Initially, there were 127 pieces of candy. After sharing 49 with her friends, Sally has", "output": 78.0}, {"input": "A farmer collected 104 eggs today. After selling 27 at the market, he had", "output": 77.0}, {"input": "A cyclist rides 44.37 miles per hour, and he cycled for 6.90 hours. He rode", "output": 306.153}, {"input": "A classroom had 46 pencils. After giving 19 to students, left were", "output": 27.0}, {"input": "A car has 4 wheels, and there are 2 cars in the showroom. The total number of wheels is", "output": 8.0}, {"input": "Liam had 35 pieces of gum. After sharing 20 pieces with his friend, he had", "output": 15.0}, {"input": "A movie theater has 16 rows of seats and each row has 16 seats. The total number of seats is", "output": 256.0}, {"input": "Each pack of stickers contains 34 stickers, and Sarah bought 3 packs. She has", "output": 102.0}, {"input": "During the game, the team scored 6 goals in the first half and 10 goals in the second half, making a total of", "output": 16.0}, {"input": "A tree bore 149 apples in summer and 132 in autumn. In total, it bore", "output": 281.0}, {"input": "Each box contains 20 apples, and there are 26 boxes. The total number of apples is", "output": 520.0}, {"input": "A bakery makes 10 cakes each day. Each cake sells for 24 dollars. Daily revenue is", "output": 240.0}, {"input": "The library had 167 books in stock. After lending out 30 books, they had", "output": 137.0}, {"input": "A bookshelf held 239 books. After donating 75 to a library, it held", "output": 164.0}, {"input": "A teacher has 21 students in each class and teaches 1 classes. She teaches", "output": 21.0}, {"input": "Liam had 38 pieces of gum. After sharing 11 pieces with his friend, he had", "output": 27.0}, {"input": "A farmer harvested 404 bushels of corn and sold 75 bushels. He had left", "output": 329.0}, {"input": "Liam had 46 pieces of gum. After sharing 16 pieces with his friend, he had", "output": 30.0}, {"input": "Wendy uploaded 39 pictures to Facebook. She dsitributes the pictures  uniformly into 3 different albums. Then, in each album there were", "output": 13.0}, {"input": "A classroom had 50 pencils. After giving 7 to students, left were", "output": 43.0}, {"input": "A tank had 167.81 liters of water. After watering the garden with 51.78 liters, the amount remaining is", "output": 116.03}, {"input": "In the school library, there are 50 books in the fiction section and 62 books in the non-fiction section. Total books in both sections are", "output": 112.0}, {"input": "A marathon runner completed 65.25 miles and took 9.85 breaks. He ran an average of", "output": 6.624365482233503}, {"input": "A movie theater has 19 rows of seats and each row has 17 seats. The total number of seats is", "output": 323.0}, {"input": "Each box contains 10 apples, and there are 14 boxes. The total number of apples is", "output": 140.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 12 pieces of candy while her sister had 21. Together, they had", "output": 33.0}, {"input": "A classroom had 46 pencils. After giving 5 to students, left were", "output": 41.0}, {"input": "A farm produces 98.65 gallons of milk each day. Each gallon is sold for 3.90 dollars. Total daily income is", "output": 384.735}, {"input": "A tree bore 98 apples in summer and 180 in autumn. In total, it bore", "output": 278.0}, {"input": "A bakery makes 14 cakes each day. Each cake sells for 23 dollars. Daily revenue is", "output": 322.0}, {"input": "A classroom had 56 pencils. After giving 21 to students, left were", "output": 35.0}, {"input": "A farmer collected 118 eggs today. After selling 47 at the market, he had", "output": 71.0}, {"input": "A warehouse stored 1052 boxes. After relocating 303 boxes, the remaining boxes are", "output": 749.0}, {"input": "An office started the day with 908 sheets of paper. After using 129 for printing, remaining sheets are", "output": 779.0}, {"input": "In a store, there were 118 candies. After 22 were eaten during a party, there were", "output": 96.0}, {"input": "Henry had 16 pieces of candy. He ate 4 pieces, so he was left with", "output": 12.0}, {"input": "In the zoo, there were 2 lions and 6 tigers. The total number of these big cats is", "output": 8.0}, {"input": "A hiker had 15 energy bars. After eating 6 during the trek, he had", "output": 9.0}, {"input": "The museum had 340 visitors on Saturday. By closing, 83 had left, leaving", "output": 257.0}, {"input": "Tom had 38 trading cards and his brother gave him 32. Now he has", "output": 70.0}, {"input": "In a marathon, 222 runners finished in less than four hours and 310 in more than four hours. The total number of runners was", "output": 532.0}, {"input": "An author writes 13.78 pages per session. After 2.63 sessions, the total pages written are", "output": 36.2414}, {"input": "A blog gets 204 views per article. If 3 articles are published, the total views are", "output": 612.0}, {"input": "Each pack of stickers contains 50 stickers, and Sarah bought 2 packs. She has", "output": 100.0}, {"input": "A library had 271 books. After losing 12 books due to damage, the remaining books are", "output": 259.0}, {"input": "At the start of the day, a parking lot had 84 cars. By evening, 21 cars had left. The number of cars remaining was", "output": 63.0}, {"input": "A tank had 158.68 liters of water. After watering the garden with 57.84 liters, the amount remaining is", "output": 100.84}, {"input": "In the classroom, there were 5 red chairs and 15 blue chairs. The total number of chairs was", "output": 20.0}, {"input": "Sally picked 17 flowers and Molly picked 4. Together they picked", "output": 21.0}, {"input": "Each box contains 28 apples, and there are 10 boxes. The total number of apples is", "output": 280.0}, {"input": "Each pack of stickers contains 30 stickers, and Sarah bought 6 packs. She has", "output": 180.0}, {"input": "Each guest at the party gets 4 slices of cake, and there are 48 guests. In total, slices of cake are", "output": 192.0}, {"input": "A student reads 26.26 pages per hour. After studying for 3.49 hours, the total pages read are", "output": 91.6474}, {"input": "A farmer collected 161 eggs today. After selling 43 at the market, he had", "output": 118.0}, {"input": "A marathon runner completed 49.85 miles and took 2.11 breaks. He ran an average of", "output": 23.625592417061615}, {"input": "After finding 30 loose coins in the sofa and 11 coins in his backpack, Tim counted", "output": 41.0}, {"input": "A library had 293 books. After losing 32 books due to damage, the remaining books are", "output": 261.0}, {"input": "At the concert, 113 tickets were sold online and 406 tickets were sold at the door. The total tickets sold were", "output": 519.0}, {"input": "After finding 18 loose coins in the sofa and 27 coins in his backpack, Tim counted", "output": 45.0}, {"input": "In a library, there were 67 books on the first shelf and 37 books on the second shelf. Altogether, the shelves held", "output": 104.0}, {"input": "A classroom had 47 pencils. After giving 17 to students, left were", "output": 30.0}, {"input": "A farmer collected 188 eggs today. After selling 30 at the market, he had", "output": 158.0}, {"input": "A bakery makes 17 cakes each day. Each cake sells for 11 dollars. Daily revenue is", "output": 187.0}, {"input": "Each pack of stickers contains 38 stickers, and Sarah bought 2 packs. She has", "output": 76.0}, {"input": "A farmer harvested 32 apples from one tree and 27 from another. Total apples harvested were", "output": 59.0}, {"input": "A printer prints 21 pages per minute. After 7 minutes, the total pages printed are", "output": 147.0}, {"input": "A craftsman makes 5 ornaments each week. Each is sold for 94 dollars. Weekly income from sales is", "output": 470.0}, {"input": "A farmer harvested 42 apples from one tree and 8 from another. Total apples harvested were", "output": 50.0}, {"input": "The library had 200 books in stock. After lending out 14 books, they had", "output": 186.0}, {"input": "A printer prints 13.41 pages per minute. Over 55.04 minutes, it prints", "output": 738.0864}, {"input": "A tank had 105.62 liters of water. After watering the garden with 74.50 liters, the amount remaining is", "output": 31.120000000000005}, {"input": "A farmer harvested 269 bushels of corn and sold 59 bushels. He had left", "output": 210.0}, {"input": "Each guest at the party gets 3 slices of cake, and there are 43 guests. In total, slices of cake are", "output": 129.0}, {"input": "In a factory, 19 workers each assemble 2 parts per day. Total parts assembled are", "output": 38.0}, {"input": "At the start of the day, a parking lot had 86 cars. By evening, 20 cars had left. The number of cars remaining was", "output": 66.0}, {"input": "A restaurant serves 60.68 meals per hour. During an 4.96-hour shift, the total meals served are", "output": 300.9728}, {"input": "An office started the day with 544 sheets of paper. After using 222 for printing, remaining sheets are", "output": 322.0}, {"input": "In the classroom, there were 22 red chairs and 18 blue chairs. The total number of chairs was", "output": 40.0}, {"input": "A bookshelf held 252 books. After donating 79 to a library, it held", "output": 173.0}, {"input": "A classroom had 39 chairs. After removing 11 broken chairs, the remaining chairs are", "output": 28.0}, {"input": "In the zoo, there were 6 lions and 9 tigers. The total number of these big cats is", "output": 15.0}, {"input": "In the school library, there are 59 books in the fiction section and 52 books in the non-fiction section. Total books in both sections are", "output": 111.0}, {"input": "A bookshelf held 232 books. After donating 69 to a library, it held", "output": 163.0}, {"input": "A cyclist rides 30.38 miles per hour, and he cycled for 3.23 hours. He rode", "output": 98.1274}, {"input": "In a library, there were 52 books on the first shelf and 45 books on the second shelf. Altogether, the shelves held", "output": 97.0}, {"input": "The museum had 995 visitors on Saturday. By closing, 91 had left, leaving", "output": 904.0}, {"input": "A baker made 219 cookies. After 75 were spoiled, the number left was", "output": 144.0}, {"input": "A park had 253 trees. After 95 were cut down for safety reasons, the remaining number of trees was", "output": 158.0}, {"input": "In a store, there were 92 candies. After 21 were eaten during a party, there were", "output": 71.0}, {"input": "A blog gets 254 views per article. If 15 articles are published, the total views are", "output": 3810.0}, {"input": "A building has 87 floors and each floor has 8 apartments. Total number of apartments in the building is", "output": 696.0}, {"input": "A park had 272 trees. After 87 were cut down for safety reasons, the remaining number of trees was", "output": 185.0}, {"input": "An author writes 5.83 pages per session. After 6.37 sessions, the total pages written are", "output": 37.137100000000004}, {"input": "After finding 33 loose coins in the sofa and 42 coins in his backpack, Tim counted", "output": 75.0}, {"input": "A company has 135 employees and they are organized into 9 teams. Each team has", "output": 15.0}, {"input": "In a marathon, 216 runners finished in less than four hours and 181 in more than four hours. The total number of runners was", "output": 397.0}, {"input": "A cyclist rides 49.14 miles per hour, and he cycled for 4.21 hours. He rode", "output": 206.8794}, {"input": "A blog gets 252 views per article. If 19 articles are published, the total views are", "output": 4788.0}, {"input": "Faye had 22 coloring books. If she gives away 10 of them, she is left with", "output": 12.0}, {"input": "Each box contains 15 apples, and there are 14 boxes. The total number of apples is", "output": 210.0}, {"input": "In a factory, 44 workers each assemble 3 parts per day. Total parts assembled are", "output": 132.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 14 pieces of candy while her sister had 29. Together, they had", "output": 43.0}, {"input": "A blog gets 276 views per article. If 11 articles are published, the total views are", "output": 3036.0}, {"input": "During the game, the team scored 9 goals in the first half and 10 goals in the second half, making a total of", "output": 19.0}, {"input": "A student reads 26.03 pages per hour. After studying for 4.75 hours, the total pages read are", "output": 123.64250000000001}, {"input": "An author writes 13.12 pages per session. After 8.86 sessions, the total pages written are", "output": 116.24319999999999}, {"input": "In the classroom, there were 3 red chairs and 23 blue chairs. The total number of chairs was", "output": 26.0}, {"input": "The museum had 484 visitors on Saturday. By closing, 104 had left, leaving", "output": 380.0}, {"input": "A warehouse stored 1440 boxes. After relocating 282 boxes, the remaining boxes are", "output": 1158.0}, {"input": "After making 269 paper cranes, Lisa gave away 82. She has left", "output": 187.0}, {"input": "Each box contains 17 apples, and there are 29 boxes. The total number of apples is", "output": 493.0}, {"input": "On a bus, there were 22 passengers initially and 17 more got on at the next stop. The total number of passengers was", "output": 39.0}, {"input": "For Halloween Debby and her sister combined the candy they received. Debby had 29 pieces of candy while her sister had 6. Together, they had", "output": 35.0}, {"input": "An author writes 12.21 pages per session. After 9.30 sessions, the total pages written are", "output": 113.55300000000001}, {"input": "A marathon runner completed 142.60 miles and took 8.09 breaks. He ran an average of", "output": 17.626699629171817}, {"input": "At the concert, 217 tickets were sold online and 237 tickets were sold at the door. The total tickets sold were", "output": 454.0}, {"input": "During a fundraiser, Alex raised 121 dollars and Jamie raised 102. Together, they raised", "output": 223.0}, {"input": "A marathon runner completed 42.05 miles and took 3.58 breaks. He ran an average of", "output": 11.74581005586592}, {"input": "A printer prints 13 pages per minute. After 15 minutes, the total pages printed are", "output": 195.0}, {"input": "A bookshelf held 202 books. After donating 89 to a library, it held", "output": 113.0}, {"input": "A farmer harvested 213 bushels of corn and sold 88 bushels. He had left", "output": 125.0}, {"input": "A tree bore 147 apples in summer and 163 in autumn. In total, it bore", "output": 310.0}, {"input": "An orchard harvested 170 apples. These were divided among 17 baskets. Each basket got", "output": 10.0}, {"input": "A baker made 229 cookies. After 24 were spoiled, the number left was", "output": 205.0}, {"input": "A warehouse stored 1173 boxes. After relocating 379 boxes, the remaining boxes are", "output": 794.0}, {"input": "In the zoo, there were 5 lions and 4 tigers. The total number of these big cats is", "output": 9.0}, {"input": "On a bus, there were 18 passengers initially and 19 more got on at the next stop. The total number of passengers was", "output": 37.0}, {"input": "In a library, there were 37 books on the first shelf and 29 books on the second shelf. Altogether, the shelves held", "output": 66.0}, {"input": "Initially, there were 57 pieces of candy. After sharing 22 with her friends, Sally has", "output": 35.0}, {"input": "Faye had 33 coloring books. If she gives away 9 of them, she is left with", "output": 24.0}, {"input": "In a factory, 11 workers each assemble 7 parts per day. Total parts assembled are", "output": 77.0}, {"input": "In a video game, each enemy defeated gives you 31.16 points. If a level has 85.64 enemies total and you destroy all of them, the points you earn are", "output": 2668.5424}, {"input": "Each student gets 3 pencils, and there are 34 students. They distributed", "output": 102.0}, {"input": "The museum had 376 visitors on Saturday. By closing, 66 had left, leaving", "output": 310.0}, {"input": "Henry had 12 pieces of candy. He ate 4 pieces, so he was left with", "output": 8.0}, {"input": "In a marathon, 404 runners finished in less than four hours and 245 in more than four hours. The total number of runners was", "output": 649.0}, {"input": "A bookshelf held 180 books. After donating 64 to a library, it held", "output": 116.0}, {"input": "Each box contains 19 apples, and there are 18 boxes. The total number of apples is", "output": 342.0}, {"input": "Each guest at the party gets 1 slices of cake, and there are 36 guests. In total, slices of cake are", "output": 36.0}, {"input": "In a video game, each enemy defeated gives you 2.35 points. If a level has 60.14 enemies total and you destroy all of them, the points you earn are", "output": 141.329}, {"input": "Each student gets 8 pencils, and there are 19 students. They distributed", "output": 152.0}, {"input": "An office started the day with 737 sheets of paper. After using 254 for printing, remaining sheets are", "output": 483.0}, {"input": "After making 474 paper cranes, Lisa gave away 143. She has left", "output": 331.0}, {"input": "A library had 241 books. After losing 10 books due to damage, the remaining books are", "output": 231.0}, {"input": "A student had 117 pages left to read in a book. After reading 21 pages, the remaining pages are", "output": 96.0}, {"input": "A student reads 36.14 pages per hour. After studying for 2.70 hours, the total pages read are", "output": 97.578}, {"input": "During the game, the team scored 3 goals in the first half and 8 goals in the second half, making a total of", "output": 11.0}, {"input": "A marathon runner completed 135.58 miles and took 1.08 breaks. He ran an average of", "output": 125.53703703703704}, {"input": "On a bus, there were 12 passengers initially and 14 more got on at the next stop. The total number of passengers was", "output": 26.0}, {"input": "Each box contains 21 apples, and there are 2 boxes. The total number of apples is", "output": 42.0}, {"input": "A baker made 279 cookies. After 36 were spoiled, the number left was", "output": 243.0}, {"input": "A marathon runner completed 160.01 miles and took 8.27 breaks. He ran an average of", "output": 19.348246674727932}, {"input": "In a video game, each enemy defeated gives you 58.35 points. If a level has 91.94 enemies total and you destroy all of them, the points you earn are", "output": 5364.699}, {"input": "A gym has 52 members. Each member pays a monthly fee of 63 dollars. Total monthly income is", "output": 3276.0}, {"input": "In a video game, each enemy defeated gives you 52.38 points. If a level has 9.78 enemies total and you destroy all of them, the points you earn are", "output": 512.2764}]