[{"input": "Mike had 36 video games but 8 of them weren't working. If he wanted to sell the working games for 30.10 each, how much money could he earn?", "output": 842.8000000000001}, {"input": "Oliver had 39.52 dollars. For his birthday he got 90 more dollars but spent 10.73 on a new game. How much money does he have now?", "output": 118.79}, {"input": "Haley and her friends were recycling paper for their class. For every 3.66 pounds they recycled they earned one point. If Haley recycled 18.85 pounds and her friends recycled 15.10 pounds, how many points did they earn?", "output": 9.275956284153006}, {"input": "Oliver had 96.50 dollars. For his birthday he got 50 more dollars but spent 29.65 on a new game. How much money does he have now?", "output": 116.85}, {"input": "Tiffany was playing a video game where she scores 9.09 points for each treasure she finds. If she found 4 treasures on the first level and 4 on the second, what would her score be?", "output": 72.72}, {"input": "Edward was working as a sacker at a grocery store where he made 9.92 dollars an hour. On Monday he worked 3.31 hours and on Tuesday he worked 6 hours. How much money did Edward make in those two days?", "output": 92.35520000000001}, {"input": "Tom and his friend were buying trick decks from the magic shop for 13.06 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 5 decks?", "output": 117.54}, {"input": "John made 7.93 dollars mowing lawns and 16.27 dollars weed eating. If he only spent 1.74 dollar a week, how long would the money last him?", "output": 13.908045977011493}, {"input": "Edward was working as a sacker at a grocery store where he made 9.77 dollars an hour. On Monday he worked 4.20 hours and on Tuesday he worked 5 hours. How much money did Edward make in those two days?", "output": 89.88399999999999}, {"input": "Rachel bought 16 new chairs and 3 new tables for her house. If she spent 37.19 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 706.6099999999999}, {"input": "Each chocolate bar in a box cost $2.76. If a box had 15 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 35.879999999999995}, {"input": "A painter needed to paint 14 rooms in a building. Each room takes 8.17 hours to paint. If he already painted 3 rooms, how much longer will he take to paint the rest?", "output": 89.87}, {"input": "Rachel bought 13 new chairs and 4 new tables for her house. If she spent 25.77 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 438.09}, {"input": "A new building needed 61 windows. The builder had already installed 23 of them. If it takes 8.39 hours to install each window, how long will it take him to install the rest?", "output": 318.82000000000005}, {"input": "Katie was selling her necklaces at a garage sale. She sold 4 bead necklaces and 38 gem stone necklaces. If each necklace cost 4.64 dollars, how much money did she earn?", "output": 194.88}, {"input": "Paul had saved up 37.88 dollars. If he received another 23 dollars for his allowance, how many 24.86 dollar toys could he buy?", "output": 2.448913917940467}, {"input": "Mike had 31 video games but 13 of them weren't working. If he wanted to sell the working games for 71.51 each, how much money could he earn?", "output": 1287.18}, {"input": "Edward made 511.05 dollars mowing lawns over the summer. If he spent 33.59 dollars buying new mower blades, how many 34 dollar games could he buy with the money he had left?", "output": 14.04294117647059}, {"input": "Tom and his friend were buying trick decks from the magic shop for 5.68 dollars each. How much did they spend if Tom bought 5 decks and his friend bought 7 decks?", "output": 68.16}, {"input": "Edward earned 81.25 dollars for each lawn he mowed. If he had 11 lawns to mow, but forgot to mow 4 of them, how much money did he actually earn?", "output": 568.75}, {"input": "At a restaurant each adult meal costs 14.34 and kids eat free. If a group of 6 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 57.36}, {"input": "A trivia team had 21 members total, but during a game 4 members didn't show up. If each member that did show up scored 68.85 points, how many points were scored total?", "output": 1170.4499999999998}, {"input": "Edward was working as a sacker at a grocery store where he made 8.16 dollars an hour. On Monday he worked 3.05 hours and on Tuesday he worked 6 hours. How much money did Edward make in those two days?", "output": 73.84800000000001}, {"input": "Tiffany was playing a video game where she scores 4.90 points for each treasure she finds. If she found 2 treasures on the first level and 2 on the second, what would her score be?", "output": 19.6}, {"input": "A magician was selling magic card decks for 12.99 dollars each. If he started with 16 decks and by the end of the day he had 7 left, how much money did he earn?", "output": 116.91}, {"input": "Edward made 4040.81 dollars mowing lawns over the summer. If he spent 90.45 dollars buying new mower blades, how many 82 dollar games could he buy with the money he had left?", "output": 48.175121951219516}, {"input": "Bianca earned 68.58 points for each bag of cans she recycled. If she had 50 bags, but didn't recycle 9 of them, how many points would she have earned?", "output": 2811.7799999999997}, {"input": "A chef needs to cook 85 potatoes. He has already cooked 25 If each potato takes 15.45 minutes to cook, how long will it take him to cook the rest?", "output": 927.0}, {"input": "Tom and his friend were buying trick decks from the magic shop for 10.97 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 4 decks?", "output": 87.76}, {"input": "At lunch a waiter had 78 customers and 19 of them didn't leave a tip. If he got 18.62 each from the ones who did tip, how much money did he earn?", "output": 1098.5800000000002}, {"input": "At lunch a waiter had 67 customers and 37 of them didn't leave a tip. If he got 13.37 each from the ones who did tip, how much money did he earn?", "output": 401.09999999999997}, {"input": "Mike had 26 video games but 12 of them weren't working. If he wanted to sell the working games for 70.48 each, how much money could he earn?", "output": 986.72}, {"input": "Haley and her friends were recycling paper for their class. For every 3.51 pounds they recycled they earned one point. If Haley recycled 15.27 pounds and her friends recycled 11.51 pounds, how many points did they earn?", "output": 7.629629629629631}, {"input": "John made 5.35 dollars mowing lawns and 12.33 dollars weed eating. If he only spent 2.91 dollar a week, how long would the money last him?", "output": 6.0756013745704465}, {"input": "Bianca earned 24.57 points for each bag of cans she recycled. If she had 78 bags, but didn't recycle 7 of them, how many points would she have earned?", "output": 1744.47}, {"input": "Katie was selling her necklaces at a garage sale. She sold 5 bead necklaces and 34 gem stone necklaces. If each necklace cost 11.84 dollars, how much money did she earn?", "output": 461.76}, {"input": "Edward made 3261.59 dollars mowing lawns over the summer. If he spent 37.09 dollars buying new mower blades, how many 32 dollar games could he buy with the money he had left?", "output": 100.765625}, {"input": "In a video game, each enemy defeated gives you 151.09 points. If a level has 69 enemies total and you destroy all but 5 of them, how many points would you earn?", "output": 9669.76}, {"input": "Edward made 3469.25 dollars mowing lawns over the summer. If he spent 41.10 dollars buying new mower blades, how many 66 dollar games could he buy with the money he had left?", "output": 51.94166666666667}, {"input": "Luke had 26.86 dollars in January. By March he had spent 5.58 dollars. If he got another 80 dollars from his mom, how much money would he have?", "output": 101.28}, {"input": "John had 91.24 dollars. At the store he spent 1.47 on a new game. If he got another 80 dollars for his allowance, how much money does he have now?", "output": 169.76999999999998}, {"input": "A chef needs to cook 56 potatoes. He has already cooked 4 If each potato takes 1.23 minutes to cook, how long will it take him to cook the rest?", "output": 63.96}, {"input": "Jerry had 2 action figures, but needed 12 total for a complete collection. If each one costs 28.69 how much money would he need to finish his collection?", "output": 286.90000000000003}, {"input": "At a restaurant each adult meal costs 10.44 and kids eat free. If a group of 9 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 73.08}, {"input": "Edward earned 98.61 dollars for each lawn he mowed. If he had 9 lawns to mow, but forgot to mow 3 of them, how much money did he actually earn?", "output": 591.66}, {"input": "A new building needed 68 windows. The builder had already installed 45 of them. If it takes 5.60 hours to install each window, how long will it take him to install the rest?", "output": 128.79999999999998}, {"input": "Rachel bought 12 new chairs and 3 new tables for her house. If she spent 105.17 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 1577.55}, {"input": "Mike had 24 video games but 13 of them weren't working. If he wanted to sell the working games for 83.10 each, how much money could he earn?", "output": 914.0999999999999}, {"input": "Bianca earned 73.02 points for each bag of cans she recycled. If she had 63 bags, but didn't recycle 13 of them, how many points would she have earned?", "output": 3651.0}, {"input": "Lana's favorite band was holding a concert where tickets were 234.35 dollars each. Lana bought 2 tickets for herself and her friends and 2 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 937.4}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 72.47 dollars mowing lawns and in the summer he made 246.41 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 308.88}, {"input": "Each chocolate bar in a box cost $6.70. If a box had 9 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 46.9}, {"input": "Oliver had 23.98 dollars. For his birthday he got 35 more dollars but spent 7.78 on a new game. How much money does he have now?", "output": 51.2}, {"input": "Edward earned 95.56 dollars for each lawn he mowed. If he had 15 lawns to mow, but forgot to mow 5 of them, how much money did he actually earn?", "output": 955.6}, {"input": "Lana's favorite band was holding a concert where tickets were 110.22 dollars each. Lana bought 6 tickets for herself and her friends and 3 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 991.98}, {"input": "A chef needs to cook 93 potatoes. He has already cooked 35 If each potato takes 1.93 minutes to cook, how long will it take him to cook the rest?", "output": 111.94}, {"input": "Each chocolate bar in a box cost $5.23. If a box had 11 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": 41.84}, {"input": "At lunch a waiter had 52 customers and 3 of them didn't leave a tip. If he got 6.35 each from the ones who did tip, how much money did he earn?", "output": 311.15}, {"input": "John had 75.36 dollars. At the store he spent 21.18 on a new game. If he got another 42 dollars for his allowance, how much money does he have now?", "output": 96.18}, {"input": "At lunch a waiter had 99 customers and 30 of them didn't leave a tip. If he got 4.31 each from the ones who did tip, how much money did he earn?", "output": 297.39}, {"input": "John made 4.31 dollars mowing lawns and 26.74 dollars weed eating. If he only spent 4.01 dollar a week, how long would the money last him?", "output": 7.743142144638404}, {"input": "At lunch a waiter had 82 customers and 40 of them didn't leave a tip. If he got 2.92 each from the ones who did tip, how much money did he earn?", "output": 122.64}, {"input": "Lana's favorite band was holding a concert where tickets were 120.51 dollars each. Lana bought 5 tickets for herself and her friends and 3 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 964.08}, {"input": "Oliver had 84.37 dollars. For his birthday he got 10 more dollars but spent 2.93 on a new game. How much money does he have now?", "output": 91.44}, {"input": "Oliver had 98.53 dollars. For his birthday he got 78 more dollars but spent 21.38 on a new game. How much money does he have now?", "output": 155.15}, {"input": "Will had 96.66 dollars. If he spent 65.42 bucks on a new game, how many 4 dollar toys could he buy with the money he had left?", "output": 7.809999999999999}, {"input": "Edward was working as a sacker at a grocery store where he made 5.53 dollars an hour. On Monday he worked 1.74 hours and on Tuesday he worked 4 hours. How much money did Edward make in those two days?", "output": 31.742200000000004}, {"input": "Luke had 49.07 dollars in January. By March he had spent 3.05 dollars. If he got another 74 dollars from his mom, how much money would he have?", "output": 120.02000000000001}, {"input": "Rachel bought 7 new chairs and 3 new tables for her house. If she spent 8.54 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 85.39999999999999}, {"input": "Rachel bought 15 new chairs and 4 new tables for her house. If she spent 8.13 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 154.47000000000003}, {"input": "Tiffany was playing a video game where she scores 6.42 points for each treasure she finds. If she found 1 treasures on the first level and 5 on the second, what would her score be?", "output": 38.519999999999996}, {"input": "Will had 67.10 dollars. If he spent 54.91 bucks on a new game, how many 3 dollar toys could he buy with the money he had left?", "output": 4.063333333333333}, {"input": "Tom and his friend were buying trick decks from the magic shop for 9.00 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 4 decks?", "output": 72.0}, {"input": "Oliver had 73.69 dollars. For his birthday he got 61 more dollars but spent 4.47 on a new game. How much money does he have now?", "output": 130.22}, {"input": "Will had 67.97 dollars. If he spent 49.71 bucks on a new game, how many 9 dollar toys could he buy with the money he had left?", "output": 2.0288888888888885}, {"input": "John had 95.41 dollars. At the store he spent 7.83 on a new game. If he got another 72 dollars for his allowance, how much money does he have now?", "output": 159.57999999999998}, {"input": "Oliver had 75.64 dollars. For his birthday he got 38 more dollars but spent 29.68 on a new game. How much money does he have now?", "output": 83.96000000000001}, {"input": "A trivia team had 27 members total, but during a game 4 members didn't show up. If each member that did show up scored 88.62 points, how many points were scored total?", "output": 2038.2600000000002}, {"input": "Tom and his friend were buying trick decks from the magic shop for 12.41 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 3 decks?", "output": 86.87}, {"input": "John made 5.37 dollars mowing lawns and 23.07 dollars weed eating. If he only spent 2.42 dollar a week, how long would the money last him?", "output": 11.75206611570248}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 198.60 dollars mowing lawns and in the summer he made 295.71 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 484.30999999999995}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 32.25 dollars mowing lawns and in the summer he made 123.76 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 146.01}, {"input": "At Tom's Restaurant a group with 8 adults and 2 children came in to eat. If each meal cost 24.71 dollars, how much was the bill?", "output": 247.10000000000002}, {"input": "John had 54.10 dollars. At the store he spent 17.84 on a new game. If he got another 21 dollars for his allowance, how much money does he have now?", "output": 57.260000000000005}, {"input": "John had 94.26 dollars. At the store he spent 1.99 on a new game. If he got another 24 dollars for his allowance, how much money does he have now?", "output": 116.27000000000001}, {"input": "At lunch a waiter had 87 customers and 39 of them didn't leave a tip. If he got 19.74 each from the ones who did tip, how much money did he earn?", "output": 947.52}, {"input": "A new building needed 150 windows. The builder had already installed 50 of them. If it takes 7.63 hours to install each window, how long will it take him to install the rest?", "output": 763.0}, {"input": "Luke had 35.86 dollars in January. By March he had spent 5.64 dollars. If he got another 79 dollars from his mom, how much money would he have?", "output": 109.22}, {"input": "At a restaurant each adult meal costs 10.25 and kids eat free. If a group of 5 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 30.75}, {"input": "A magician was selling magic card decks for 13.03 dollars each. If he started with 14 decks and by the end of the day he had 7 left, how much money did he earn?", "output": 91.21}, {"input": "Jerry had 3 action figures, but needed 13 total for a complete collection. If each one costs 23.86 how much money would he need to finish his collection?", "output": 238.6}, {"input": "Lana's favorite band was holding a concert where tickets were 181.92 dollars each. Lana bought 5 tickets for herself and her friends and 4 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1637.28}, {"input": "April's discount flowers was having a sale where each rose was $16.14. If April started with 14 roses and had 6 roses left, how much money did she earn?", "output": 129.12}, {"input": "Tiffany was playing a video game where she scores 7.48 points for each treasure she finds. If she found 5 treasures on the first level and 4 on the second, what would her score be?", "output": 67.32000000000001}, {"input": "A new building needed 72 windows. The builder had already installed 41 of them. If it takes 6.43 hours to install each window, how long will it take him to install the rest?", "output": 199.32999999999998}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 149.85 dollars mowing lawns and in the summer he made 322.80 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 462.65}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 172.11 dollars mowing lawns and in the summer he made 346.64 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 508.75}, {"input": "A new building needed 51 windows. The builder had already installed 15 of them. If it takes 2.28 hours to install each window, how long will it take him to install the rest?", "output": 82.08}, {"input": "Lana's favorite band was holding a concert where tickets were 156.15 dollars each. Lana bought 5 tickets for herself and her friends and 2 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1093.05}, {"input": "Lana's favorite band was holding a concert where tickets were 265.94 dollars each. Lana bought 6 tickets for herself and her friends and 1 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1861.58}, {"input": "April's discount flowers was having a sale where each rose was $7.19. If April started with 18 roses and had 5 roses left, how much money did she earn?", "output": 93.47}, {"input": "Each chocolate bar in a box cost $5.32. If a box had 11 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": 42.56}, {"input": "A trivia team had 24 members total, but during a game 6 members didn't show up. If each member that did show up scored 44.70 points, how many points were scored total?", "output": 804.6}, {"input": "Will had 85.80 dollars. If he spent 64.09 bucks on a new game, how many 10 dollar toys could he buy with the money he had left?", "output": 2.1709999999999994}, {"input": "Each chocolate bar in a box cost $3.97. If a box had 15 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 51.61}, {"input": "Edward made 2240.55 dollars mowing lawns over the summer. If he spent 19.18 dollars buying new mower blades, how many 71 dollar games could he buy with the money he had left?", "output": 31.28690140845071}, {"input": "Luke had 36.27 dollars in January. By March he had spent 4.93 dollars. If he got another 65 dollars from his mom, how much money would he have?", "output": 96.34}, {"input": "A new building needed 102 windows. The builder had already installed 24 of them. If it takes 1.12 hours to install each window, how long will it take him to install the rest?", "output": 87.36000000000001}, {"input": "A magician was selling magic card decks for 10.43 dollars each. If he started with 20 decks and by the end of the day he had 5 left, how much money did he earn?", "output": 156.45}, {"input": "A chef needs to cook 81 potatoes. He has already cooked 26 If each potato takes 12.51 minutes to cook, how long will it take him to cook the rest?", "output": 688.05}, {"input": "Katie was selling her necklaces at a garage sale. She sold 12 bead necklaces and 16 gem stone necklaces. If each necklace cost 9.01 dollars, how much money did she earn?", "output": 252.28}, {"input": "A magician was selling magic card decks for 10.45 dollars each. If he started with 12 decks and by the end of the day he had 10 left, how much money did he earn?", "output": 20.9}, {"input": "Katie was selling her necklaces at a garage sale. She sold 10 bead necklaces and 31 gem stone necklaces. If each necklace cost 14.25 dollars, how much money did she earn?", "output": 584.25}, {"input": "Each chocolate bar in a box cost $2.18. If a box had 13 bars total and Emily sold all but 1 bars, how much money would she have made?", "output": 26.160000000000004}, {"input": "A new building needed 99 windows. The builder had already installed 2 of them. If it takes 3.29 hours to install each window, how long will it take him to install the rest?", "output": 319.13}, {"input": "At lunch a waiter had 76 customers and 42 of them didn't leave a tip. If he got 18.42 each from the ones who did tip, how much money did he earn?", "output": 626.2800000000001}, {"input": "Bianca earned 8.72 points for each bag of cans she recycled. If she had 50 bags, but didn't recycle 11 of them, how many points would she have earned?", "output": 340.08000000000004}, {"input": "Lana's favorite band was holding a concert where tickets were 150.85 dollars each. Lana bought 5 tickets for herself and her friends and 5 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1508.5}, {"input": "April's discount flowers was having a sale where each rose was $10.98. If April started with 17 roses and had 8 roses left, how much money did she earn?", "output": 98.82000000000001}, {"input": "Edward was working as a sacker at a grocery store where he made 5.28 dollars an hour. On Monday he worked 3.62 hours and on Tuesday he worked 3 hours. How much money did Edward make in those two days?", "output": 34.9536}, {"input": "At Tom's Restaurant a group with 17 adults and 3 children came in to eat. If each meal cost 25.10 dollars, how much was the bill?", "output": 502.0}, {"input": "Mike had 37 video games but 13 of them weren't working. If he wanted to sell the working games for 69.25 each, how much money could he earn?", "output": 1662.0}, {"input": "John made 9.26 dollars mowing lawns and 22.59 dollars weed eating. If he only spent 2.74 dollar a week, how long would the money last him?", "output": 11.624087591240876}, {"input": "Rachel bought 15 new chairs and 4 new tables for her house. If she spent 53.19 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 1010.6099999999999}, {"input": "Rachel bought 9 new chairs and 3 new tables for her house. If she spent 70.77 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 849.24}, {"input": "A painter needed to paint 16 rooms in a building. Each room takes 5.99 hours to paint. If he already painted 7 rooms, how much longer will he take to paint the rest?", "output": 53.910000000000004}, {"input": "A painter needed to paint 14 rooms in a building. Each room takes 8.11 hours to paint. If he already painted 5 rooms, how much longer will he take to paint the rest?", "output": 72.99}, {"input": "Will had 90.24 dollars. If he spent 49.02 bucks on a new game, how many 4 dollar toys could he buy with the money he had left?", "output": 10.304999999999998}, {"input": "Tom and his friend were buying trick decks from the magic shop for 5.86 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 5 decks?", "output": 52.74}, {"input": "A new building needed 138 windows. The builder had already installed 25 of them. If it takes 6.95 hours to install each window, how long will it take him to install the rest?", "output": 785.35}, {"input": "John made 4.49 dollars mowing lawns and 21.09 dollars weed eating. If he only spent 4.71 dollar a week, how long would the money last him?", "output": 5.430997876857749}, {"input": "A trivia team had 22 members total, but during a game 6 members didn't show up. If each member that did show up scored 51.79 points, how many points were scored total?", "output": 828.64}, {"input": "Edward made 4651.37 dollars mowing lawns over the summer. If he spent 50.57 dollars buying new mower blades, how many 42 dollar games could he buy with the money he had left?", "output": 109.54285714285714}, {"input": "John had 69.05 dollars. At the store he spent 42.94 on a new game. If he got another 17 dollars for his allowance, how much money does he have now?", "output": 43.11}, {"input": "John made 7.91 dollars mowing lawns and 25.61 dollars weed eating. If he only spent 4.14 dollar a week, how long would the money last him?", "output": 8.096618357487923}, {"input": "Luke had 32.49 dollars in January. By March he had spent 8.10 dollars. If he got another 69 dollars from his mom, how much money would he have?", "output": 93.39}, {"input": "Bianca earned 88.67 points for each bag of cans she recycled. If she had 59 bags, but didn't recycle 19 of them, how many points would she have earned?", "output": 3546.8}, {"input": "Will had 89.47 dollars. If he spent 48.11 bucks on a new game, how many 4 dollar toys could he buy with the money he had left?", "output": 10.34}, {"input": "Paul had saved up 81.28 dollars. If he received another 25 dollars for his allowance, how many 11.78 dollar toys could he buy?", "output": 9.02207130730051}, {"input": "Paul had saved up 75.63 dollars. If he received another 50 dollars for his allowance, how many 29.47 dollar toys could he buy?", "output": 4.2629793009840515}, {"input": "A magician was selling magic card decks for 14.04 dollars each. If he started with 19 decks and by the end of the day he had 7 left, how much money did he earn?", "output": 168.48}, {"input": "A painter needed to paint 18 rooms in a building. Each room takes 9.09 hours to paint. If he already painted 4 rooms, how much longer will he take to paint the rest?", "output": 127.25999999999999}, {"input": "John had 73.04 dollars. At the store he spent 11.23 on a new game. If he got another 16 dollars for his allowance, how much money does he have now?", "output": 77.81}, {"input": "Edward made 4787.67 dollars mowing lawns over the summer. If he spent 72.63 dollars buying new mower blades, how many 63 dollar games could he buy with the money he had left?", "output": 74.84190476190476}, {"input": "Edward made 3372.96 dollars mowing lawns over the summer. If he spent 35.14 dollars buying new mower blades, how many 88 dollar games could he buy with the money he had left?", "output": 37.92977272727273}, {"input": "At a restaurant each adult meal costs 24.25 and kids eat free. If a group of 4 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 72.75}, {"input": "Each chocolate bar in a box cost $2.01. If a box had 9 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": 12.059999999999999}, {"input": "At Tom's Restaurant a group with 2 adults and 10 children came in to eat. If each meal cost 23.87 dollars, how much was the bill?", "output": 286.44}, {"input": "Katie was selling her necklaces at a garage sale. She sold 7 bead necklaces and 16 gem stone necklaces. If each necklace cost 18.17 dollars, how much money did she earn?", "output": 417.91}, {"input": "A painter needed to paint 16 rooms in a building. Each room takes 7.64 hours to paint. If he already painted 3 rooms, how much longer will he take to paint the rest?", "output": 99.32}, {"input": "April's discount flowers was having a sale where each rose was $14.36. If April started with 20 roses and had 3 roses left, how much money did she earn?", "output": 244.12}, {"input": "Edward was working as a sacker at a grocery store where he made 6.31 dollars an hour. On Monday he worked 4.29 hours and on Tuesday he worked 6 hours. How much money did Edward make in those two days?", "output": 64.92989999999999}, {"input": "Tom and his friend were buying trick decks from the magic shop for 7.35 dollars each. How much did they spend if Tom bought 2 decks and his friend bought 6 decks?", "output": 58.8}, {"input": "At Tom's Restaurant a group with 1 adults and 1 children came in to eat. If each meal cost 16.77 dollars, how much was the bill?", "output": 33.54}, {"input": "April's discount flowers was having a sale where each rose was $12.80. If April started with 19 roses and had 3 roses left, how much money did she earn?", "output": 204.8}, {"input": "Lana's favorite band was holding a concert where tickets were 138.76 dollars each. Lana bought 2 tickets for herself and her friends and 2 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 555.04}, {"input": "Rachel bought 18 new chairs and 5 new tables for her house. If she spent 99.15 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 2280.4500000000003}, {"input": "Haley and her friends were recycling paper for their class. For every 2.07 pounds they recycled they earned one point. If Haley recycled 16.94 pounds and her friends recycled 24.67 pounds, how many points did they earn?", "output": 20.10144927536232}, {"input": "In a video game, each enemy defeated gives you 25.44 points. If a level has 32 enemies total and you destroy all but 1 of them, how many points would you earn?", "output": 788.64}, {"input": "Mike had 22 video games but 1 of them weren't working. If he wanted to sell the working games for 59.42 each, how much money could he earn?", "output": 1247.82}, {"input": "Each chocolate bar in a box cost $4.89. If a box had 11 bars total and Emily sold all but 4 bars, how much money would she have made?", "output": 34.23}, {"input": "Each chocolate bar in a box cost $3.17. If a box had 13 bars total and Emily sold all but 5 bars, how much money would she have made?", "output": 25.36}, {"input": "Lana's favorite band was holding a concert where tickets were 187.12 dollars each. Lana bought 3 tickets for herself and her friends and 1 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 748.48}, {"input": "In a video game, each enemy defeated gives you 159.55 points. If a level has 49 enemies total and you destroy all but 9 of them, how many points would you earn?", "output": 6382.0}, {"input": "John made 4.28 dollars mowing lawns and 14.50 dollars weed eating. If he only spent 1.97 dollar a week, how long would the money last him?", "output": 9.532994923857869}, {"input": "At Tom's Restaurant a group with 13 adults and 2 children came in to eat. If each meal cost 18.93 dollars, how much was the bill?", "output": 283.95}, {"input": "Bianca earned 14.29 points for each bag of cans she recycled. If she had 41 bags, but didn't recycle 15 of them, how many points would she have earned?", "output": 371.53999999999996}, {"input": "Bianca earned 88.76 points for each bag of cans she recycled. If she had 68 bags, but didn't recycle 7 of them, how many points would she have earned?", "output": 5414.360000000001}, {"input": "John made 9.05 dollars mowing lawns and 17.19 dollars weed eating. If he only spent 3.29 dollar a week, how long would the money last him?", "output": 7.975683890577508}, {"input": "Haley and her friends were recycling paper for their class. For every 4.13 pounds they recycled they earned one point. If Haley recycled 19.37 pounds and her friends recycled 13.18 pounds, how many points did they earn?", "output": 7.881355932203389}, {"input": "While playing a trivia game, Adam answered 13 questions correct in the first half and 16 questions correct in the second half. If each question was worth 132.82 points, what was his final score?", "output": 3851.7799999999997}, {"input": "At a restaurant each adult meal costs 16.83 and kids eat free. If a group of 9 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 134.64}, {"input": "In a video game, each enemy defeated gives you 104.70 points. If a level has 20 enemies total and you destroy all but 10 of them, how many points would you earn?", "output": 1047.0}, {"input": "Edward was working as a sacker at a grocery store where he made 6.08 dollars an hour. On Monday he worked 1.48 hours and on Tuesday he worked 3 hours. How much money did Edward make in those two days?", "output": 27.238400000000002}, {"input": "In a video game, each enemy defeated gives you 194.91 points. If a level has 26 enemies total and you destroy all but 1 of them, how many points would you earn?", "output": 4872.75}, {"input": "Bianca earned 5.61 points for each bag of cans she recycled. If she had 60 bags, but didn't recycle 7 of them, how many points would she have earned?", "output": 297.33000000000004}, {"input": "John made 6.97 dollars mowing lawns and 13.66 dollars weed eating. If he only spent 4.74 dollar a week, how long would the money last him?", "output": 4.352320675105485}, {"input": "Edward was working as a sacker at a grocery store where he made 7.61 dollars an hour. On Monday he worked 3.07 hours and on Tuesday he worked 3 hours. How much money did Edward make in those two days?", "output": 46.1927}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 170.56 dollars mowing lawns and in the summer he made 344.85 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 505.4100000000001}, {"input": "Rachel bought 7 new chairs and 3 new tables for her house. If she spent 75.94 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 759.4}, {"input": "Tiffany was playing a video game where she scores 6.41 points for each treasure she finds. If she found 4 treasures on the first level and 6 on the second, what would her score be?", "output": 64.1}, {"input": "Oliver had 58.51 dollars. For his birthday he got 46 more dollars but spent 29.63 on a new game. How much money does he have now?", "output": 74.88}, {"input": "Mike had 26 video games but 8 of them weren't working. If he wanted to sell the working games for 13.95 each, how much money could he earn?", "output": 251.1}, {"input": "A trivia team had 22 members total, but during a game 5 members didn't show up. If each member that did show up scored 68.82 points, how many points were scored total?", "output": 1169.9399999999998}, {"input": "Mike had 33 video games but 5 of them weren't working. If he wanted to sell the working games for 56.85 each, how much money could he earn?", "output": 1591.8}, {"input": "Edward made 979.59 dollars mowing lawns over the summer. If he spent 65.48 dollars buying new mower blades, how many 73 dollar games could he buy with the money he had left?", "output": 12.522054794520548}, {"input": "A magician was selling magic card decks for 5.84 dollars each. If he started with 18 decks and by the end of the day he had 5 left, how much money did he earn?", "output": 75.92}, {"input": "Edward was working as a sacker at a grocery store where he made 8.81 dollars an hour. On Monday he worked 3.81 hours and on Tuesday he worked 6 hours. How much money did Edward make in those two days?", "output": 86.4261}, {"input": "At lunch a waiter had 85 customers and 31 of them didn't leave a tip. If he got 2.01 each from the ones who did tip, how much money did he earn?", "output": 108.53999999999999}, {"input": "Oliver had 47.64 dollars. For his birthday he got 25 more dollars but spent 12.20 on a new game. How much money does he have now?", "output": 60.44}, {"input": "Luke had 48.10 dollars in January. By March he had spent 2.14 dollars. If he got another 33 dollars from his mom, how much money would he have?", "output": 78.96000000000001}, {"input": "Bianca earned 49.99 points for each bag of cans she recycled. If she had 32 bags, but didn't recycle 1 of them, how many points would she have earned?", "output": 1549.69}, {"input": "Tiffany was playing a video game where she scores 5.41 points for each treasure she finds. If she found 3 treasures on the first level and 1 on the second, what would her score be?", "output": 21.64}, {"input": "A painter needed to paint 10 rooms in a building. Each room takes 8.18 hours to paint. If he already painted 8 rooms, how much longer will he take to paint the rest?", "output": 16.36}, {"input": "Edward made 4361.52 dollars mowing lawns over the summer. If he spent 67.29 dollars buying new mower blades, how many 44 dollar games could he buy with the money he had left?", "output": 97.59613636363638}, {"input": "Paul had saved up 25.99 dollars. If he received another 67 dollars for his allowance, how many 1.05 dollar toys could he buy?", "output": 88.56190476190476}, {"input": "Rachel bought 19 new chairs and 3 new tables for her house. If she spent 117.74 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 2590.2799999999997}, {"input": "Edward made 3740.67 dollars mowing lawns over the summer. If he spent 72.50 dollars buying new mower blades, how many 52 dollar games could he buy with the money he had left?", "output": 70.54173076923077}, {"input": "Rachel bought 9 new chairs and 2 new tables for her house. If she spent 116.38 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 1280.1799999999998}, {"input": "Tom and his friend were buying trick decks from the magic shop for 6.82 dollars each. How much did they spend if Tom bought 1 decks and his friend bought 4 decks?", "output": 34.1}, {"input": "Luke had 47.20 dollars in January. By March he had spent 5.65 dollars. If he got another 13 dollars from his mom, how much money would he have?", "output": 54.550000000000004}, {"input": "In a video game, each enemy defeated gives you 116.20 points. If a level has 34 enemies total and you destroy all but 5 of them, how many points would you earn?", "output": 3369.8}, {"input": "Luke had 22.10 dollars in January. By March he had spent 7.25 dollars. If he got another 65 dollars from his mom, how much money would he have?", "output": 79.85}, {"input": "Edward was working as a sacker at a grocery store where he made 5.87 dollars an hour. On Monday he worked 1.44 hours and on Tuesday he worked 6 hours. How much money did Edward make in those two days?", "output": 43.672799999999995}, {"input": "Rachel bought 15 new chairs and 5 new tables for her house. If she spent 77.02 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 1540.3999999999999}, {"input": "Luke had 34.42 dollars in January. By March he had spent 7.25 dollars. If he got another 20 dollars from his mom, how much money would he have?", "output": 47.17}, {"input": "A painter needed to paint 17 rooms in a building. Each room takes 8.14 hours to paint. If he already painted 3 rooms, how much longer will he take to paint the rest?", "output": 113.96000000000001}, {"input": "Each chocolate bar in a box cost $4.88. If a box had 11 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": 39.04}, {"input": "Oliver had 31.47 dollars. For his birthday he got 18 more dollars but spent 8.12 on a new game. How much money does he have now?", "output": 41.35}, {"input": "At a restaurant each adult meal costs 29.17 and kids eat free. If a group of 3 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 29.17}, {"input": "Mike had 32 video games but 11 of them weren't working. If he wanted to sell the working games for 18.80 each, how much money could he earn?", "output": 394.8}, {"input": "Edward earned 28.97 dollars for each lawn he mowed. If he had 19 lawns to mow, but forgot to mow 3 of them, how much money did he actually earn?", "output": 463.52}, {"input": "Mike had 31 video games but 2 of them weren't working. If he wanted to sell the working games for 18.74 each, how much money could he earn?", "output": 543.4599999999999}, {"input": "Edward made 562.56 dollars mowing lawns over the summer. If he spent 26.43 dollars buying new mower blades, how many 71 dollar games could he buy with the money he had left?", "output": 7.55112676056338}, {"input": "John had 53.71 dollars. At the store he spent 13.29 on a new game. If he got another 72 dollars for his allowance, how much money does he have now?", "output": 112.42}, {"input": "While playing a trivia game, Adam answered 3 questions correct in the first half and 3 questions correct in the second half. If each question was worth 254.05 points, what was his final score?", "output": 1524.3000000000002}, {"input": "Edward earned 83.70 dollars for each lawn he mowed. If he had 11 lawns to mow, but forgot to mow 3 of them, how much money did he actually earn?", "output": 669.6}, {"input": "Tom and his friend were buying trick decks from the magic shop for 10.18 dollars each. How much did they spend if Tom bought 5 decks and his friend bought 6 decks?", "output": 111.97999999999999}, {"input": "A trivia team had 16 members total, but during a game 7 members didn't show up. If each member that did show up scored 72.80 points, how many points were scored total?", "output": 655.1999999999999}, {"input": "Edward made 3590.62 dollars mowing lawns over the summer. If he spent 82.48 dollars buying new mower blades, how many 86 dollar games could he buy with the money he had left?", "output": 40.792325581395346}, {"input": "Lana's favorite band was holding a concert where tickets were 207.40 dollars each. Lana bought 2 tickets for herself and her friends and 5 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1451.8}, {"input": "Katie was selling her necklaces at a garage sale. She sold 11 bead necklaces and 7 gem stone necklaces. If each necklace cost 6.13 dollars, how much money did she earn?", "output": 110.34}, {"input": "Edward earned 51.76 dollars for each lawn he mowed. If he had 11 lawns to mow, but forgot to mow 2 of them, how much money did he actually earn?", "output": 465.84}, {"input": "Paul had saved up 29.79 dollars. If he received another 98 dollars for his allowance, how many 19.95 dollar toys could he buy?", "output": 6.405513784461153}, {"input": "A new building needed 163 windows. The builder had already installed 32 of them. If it takes 1.93 hours to install each window, how long will it take him to install the rest?", "output": 252.82999999999998}, {"input": "A chef needs to cook 76 potatoes. He has already cooked 9 If each potato takes 1.14 minutes to cook, how long will it take him to cook the rest?", "output": 76.38}, {"input": "Each chocolate bar in a box cost $3.23. If a box had 9 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 22.61}, {"input": "Tom and his friend were buying trick decks from the magic shop for 11.81 dollars each. How much did they spend if Tom bought 2 decks and his friend bought 4 decks?", "output": 70.86}, {"input": "At lunch a waiter had 82 customers and 24 of them didn't leave a tip. If he got 5.42 each from the ones who did tip, how much money did he earn?", "output": 314.36}, {"input": "Rachel bought 3 new chairs and 3 new tables for her house. If she spent 80.69 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 484.14}, {"input": "Haley and her friends were recycling paper for their class. For every 3.74 pounds they recycled they earned one point. If Haley recycled 18.17 pounds and her friends recycled 14.71 pounds, how many points did they earn?", "output": 8.79144385026738}, {"input": "Edward made 2664.24 dollars mowing lawns over the summer. If he spent 81.43 dollars buying new mower blades, how many 73 dollar games could he buy with the money he had left?", "output": 35.38095890410959}, {"input": "Each chocolate bar in a box cost $4.68. If a box had 10 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 37.44}, {"input": "In a video game, each enemy defeated gives you 96.61 points. If a level has 26 enemies total and you destroy all but 8 of them, how many points would you earn?", "output": 1738.98}, {"input": "Tom and his friend were buying trick decks from the magic shop for 6.41 dollars each. How much did they spend if Tom bought 3 decks and his friend bought 3 decks?", "output": 38.46}, {"input": "Edward earned 71.00 dollars for each lawn he mowed. If he had 18 lawns to mow, but forgot to mow 5 of them, how much money did he actually earn?", "output": 923.0}, {"input": "Edward earned 20.55 dollars for each lawn he mowed. If he had 15 lawns to mow, but forgot to mow 2 of them, how much money did he actually earn?", "output": 267.15000000000003}, {"input": "Edward was working as a sacker at a grocery store where he made 9.99 dollars an hour. On Monday he worked 1.57 hours and on Tuesday he worked 6 hours. How much money did Edward make in those two days?", "output": 75.6243}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 58.48 dollars mowing lawns and in the summer he made 105.74 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 154.22}, {"input": "At lunch a waiter had 84 customers and 21 of them didn't leave a tip. If he got 13.87 each from the ones who did tip, how much money did he earn?", "output": 873.81}, {"input": "Bianca earned 19.91 points for each bag of cans she recycled. If she had 31 bags, but didn't recycle 17 of them, how many points would she have earned?", "output": 278.74}, {"input": "Edward made 3214.69 dollars mowing lawns over the summer. If he spent 83.75 dollars buying new mower blades, how many 67 dollar games could he buy with the money he had left?", "output": 46.73044776119403}, {"input": "Rachel bought 13 new chairs and 4 new tables for her house. If she spent 45.56 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 774.52}, {"input": "A new building needed 137 windows. The builder had already installed 6 of them. If it takes 2.72 hours to install each window, how long will it take him to install the rest?", "output": 356.32000000000005}, {"input": "A new building needed 109 windows. The builder had already installed 7 of them. If it takes 5.82 hours to install each window, how long will it take him to install the rest?", "output": 593.64}, {"input": "A chef needs to cook 60 potatoes. He has already cooked 2 If each potato takes 2.67 minutes to cook, how long will it take him to cook the rest?", "output": 154.85999999999999}, {"input": "In a video game, each enemy defeated gives you 45.84 points. If a level has 42 enemies total and you destroy all but 9 of them, how many points would you earn?", "output": 1512.72}, {"input": "In a video game, each enemy defeated gives you 101.03 points. If a level has 66 enemies total and you destroy all but 3 of them, how many points would you earn?", "output": 6364.89}, {"input": "Lana's favorite band was holding a concert where tickets were 102.49 dollars each. Lana bought 3 tickets for herself and her friends and 1 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 409.96}, {"input": "Edward made 2784.07 dollars mowing lawns over the summer. If he spent 72.73 dollars buying new mower blades, how many 40 dollar games could he buy with the money he had left?", "output": 67.7835}, {"input": "John made 7.18 dollars mowing lawns and 16.30 dollars weed eating. If he only spent 1.91 dollar a week, how long would the money last him?", "output": 12.293193717277488}, {"input": "Jerry had 5 action figures, but needed 12 total for a complete collection. If each one costs 57.60 how much money would he need to finish his collection?", "output": 403.2}, {"input": "John had 53.47 dollars. At the store he spent 11.56 on a new game. If he got another 85 dollars for his allowance, how much money does he have now?", "output": 126.91}, {"input": "Tiffany was playing a video game where she scores 5.93 points for each treasure she finds. If she found 4 treasures on the first level and 5 on the second, what would her score be?", "output": 53.37}, {"input": "John made 5.77 dollars mowing lawns and 22.45 dollars weed eating. If he only spent 1.19 dollar a week, how long would the money last him?", "output": 23.714285714285715}, {"input": "A painter needed to paint 17 rooms in a building. Each room takes 6.22 hours to paint. If he already painted 3 rooms, how much longer will he take to paint the rest?", "output": 87.08}, {"input": "Katie was selling her necklaces at a garage sale. She sold 17 bead necklaces and 23 gem stone necklaces. If each necklace cost 7.36 dollars, how much money did she earn?", "output": 294.40000000000003}, {"input": "John had 86.54 dollars. At the store he spent 40.42 on a new game. If he got another 43 dollars for his allowance, how much money does he have now?", "output": 89.12}, {"input": "At a restaurant each adult meal costs 28.49 and kids eat free. If a group of 5 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 85.47}, {"input": "Bianca earned 54.29 points for each bag of cans she recycled. If she had 62 bags, but didn't recycle 3 of them, how many points would she have earned?", "output": 3203.11}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 187.87 dollars mowing lawns and in the summer he made 321.45 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 499.32}, {"input": "Bianca earned 36.82 points for each bag of cans she recycled. If she had 64 bags, but didn't recycle 11 of them, how many points would she have earned?", "output": 1951.46}, {"input": "A trivia team had 20 members total, but during a game 5 members didn't show up. If each member that did show up scored 64.44 points, how many points were scored total?", "output": 966.5999999999999}, {"input": "April's discount flowers was having a sale where each rose was $12.55. If April started with 14 roses and had 3 roses left, how much money did she earn?", "output": 138.05}, {"input": "Paul had saved up 76.10 dollars. If he received another 72 dollars for his allowance, how many 25.79 dollar toys could he buy?", "output": 5.742535866614967}, {"input": "Oliver had 62.58 dollars. For his birthday he got 95 more dollars but spent 24.36 on a new game. How much money does he have now?", "output": 133.21999999999997}, {"input": "Edward made 1682.19 dollars mowing lawns over the summer. If he spent 40.60 dollars buying new mower blades, how many 42 dollar games could he buy with the money he had left?", "output": 39.08547619047619}, {"input": "Edward earned 51.02 dollars for each lawn he mowed. If he had 15 lawns to mow, but forgot to mow 1 of them, how much money did he actually earn?", "output": 714.2800000000001}, {"input": "April's discount flowers was having a sale where each rose was $19.77. If April started with 12 roses and had 9 roses left, how much money did she earn?", "output": 59.31}, {"input": "While playing a trivia game, Adam answered 6 questions correct in the first half and 3 questions correct in the second half. If each question was worth 59.08 points, what was his final score?", "output": 531.72}, {"input": "While playing a trivia game, Adam answered 2 questions correct in the first half and 5 questions correct in the second half. If each question was worth 70.80 points, what was his final score?", "output": 495.59999999999997}, {"input": "Bianca earned 15.75 points for each bag of cans she recycled. If she had 74 bags, but didn't recycle 1 of them, how many points would she have earned?", "output": 1149.75}, {"input": "Tiffany was playing a video game where she scores 8.95 points for each treasure she finds. If she found 6 treasures on the first level and 5 on the second, what would her score be?", "output": 98.44999999999999}, {"input": "Mike had 31 video games but 13 of them weren't working. If he wanted to sell the working games for 87.85 each, how much money could he earn?", "output": 1581.3}, {"input": "Tiffany was playing a video game where she scores 8.32 points for each treasure she finds. If she found 3 treasures on the first level and 6 on the second, what would her score be?", "output": 74.88}, {"input": "A chef needs to cook 65 potatoes. He has already cooked 15 If each potato takes 1.58 minutes to cook, how long will it take him to cook the rest?", "output": 79.0}, {"input": "A painter needed to paint 11 rooms in a building. Each room takes 7.44 hours to paint. If he already painted 3 rooms, how much longer will he take to paint the rest?", "output": 59.52}, {"input": "Edward was working as a sacker at a grocery store where he made 8.47 dollars an hour. On Monday he worked 2.92 hours and on Tuesday he worked 7 hours. How much money did Edward make in those two days?", "output": 84.0224}, {"input": "A new building needed 117 windows. The builder had already installed 34 of them. If it takes 3.96 hours to install each window, how long will it take him to install the rest?", "output": 328.68}, {"input": "At lunch a waiter had 87 customers and 36 of them didn't leave a tip. If he got 12.50 each from the ones who did tip, how much money did he earn?", "output": 637.5}, {"input": "Lana's favorite band was holding a concert where tickets were 135.85 dollars each. Lana bought 3 tickets for herself and her friends and 5 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1086.8}, {"input": "Mike had 25 video games but 6 of them weren't working. If he wanted to sell the working games for 14.01 each, how much money could he earn?", "output": 266.19}, {"input": "A trivia team had 29 members total, but during a game 8 members didn't show up. If each member that did show up scored 59.09 points, how many points were scored total?", "output": 1240.89}, {"input": "A painter needed to paint 15 rooms in a building. Each room takes 5.30 hours to paint. If he already painted 3 rooms, how much longer will he take to paint the rest?", "output": 63.599999999999994}, {"input": "Luke had 41.29 dollars in January. By March he had spent 9.38 dollars. If he got another 52 dollars from his mom, how much money would he have?", "output": 83.91}, {"input": "A painter needed to paint 13 rooms in a building. Each room takes 5.99 hours to paint. If he already painted 8 rooms, how much longer will he take to paint the rest?", "output": 29.950000000000003}, {"input": "At a restaurant each adult meal costs 12.84 and kids eat free. If a group of 6 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 64.2}, {"input": "Each chocolate bar in a box cost $4.22. If a box had 10 bars total and Emily sold all but 4 bars, how much money would she have made?", "output": 25.32}, {"input": "A trivia team had 27 members total, but during a game 2 members didn't show up. If each member that did show up scored 24.87 points, how many points were scored total?", "output": 621.75}, {"input": "Jerry had 1 action figures, but needed 14 total for a complete collection. If each one costs 54.15 how much money would he need to finish his collection?", "output": 703.9499999999999}, {"input": "Lana's favorite band was holding a concert where tickets were 280.32 dollars each. Lana bought 3 tickets for herself and her friends and 5 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 2242.56}, {"input": "Tiffany was playing a video game where she scores 8.97 points for each treasure she finds. If she found 3 treasures on the first level and 1 on the second, what would her score be?", "output": 35.88}, {"input": "At a restaurant each adult meal costs 16.08 and kids eat free. If a group of 5 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 48.239999999999995}, {"input": "Bianca earned 7.12 points for each bag of cans she recycled. If she had 69 bags, but didn't recycle 5 of them, how many points would she have earned?", "output": 455.68}, {"input": "John made 9.22 dollars mowing lawns and 14.10 dollars weed eating. If he only spent 1.82 dollar a week, how long would the money last him?", "output": 12.813186813186812}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 111.51 dollars mowing lawns and in the summer he made 114.30 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 215.81}, {"input": "A chef needs to cook 68 potatoes. He has already cooked 2 If each potato takes 19.93 minutes to cook, how long will it take him to cook the rest?", "output": 1315.3799999999999}, {"input": "Tom and his friend were buying trick decks from the magic shop for 8.38 dollars each. How much did they spend if Tom bought 2 decks and his friend bought 6 decks?", "output": 67.04}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 25.37 dollars mowing lawns and in the summer he made 175.52 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 190.89000000000001}, {"input": "Lana's favorite band was holding a concert where tickets were 235.95 dollars each. Lana bought 5 tickets for herself and her friends and 1 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1415.6999999999998}, {"input": "April's discount flowers was having a sale where each rose was $10.70. If April started with 13 roses and had 9 roses left, how much money did she earn?", "output": 42.8}, {"input": "In a video game, each enemy defeated gives you 61.45 points. If a level has 59 enemies total and you destroy all but 5 of them, how many points would you earn?", "output": 3318.3}, {"input": "While playing a trivia game, Adam answered 9 questions correct in the first half and 4 questions correct in the second half. If each question was worth 10.72 points, what was his final score?", "output": 139.36}, {"input": "While playing a trivia game, Adam answered 17 questions correct in the first half and 1 questions correct in the second half. If each question was worth 193.75 points, what was his final score?", "output": 3487.5}, {"input": "At lunch a waiter had 97 customers and 7 of them didn't leave a tip. If he got 13.90 each from the ones who did tip, how much money did he earn?", "output": 1251.0}, {"input": "Edward was working as a sacker at a grocery store where he made 5.20 dollars an hour. On Monday he worked 1.39 hours and on Tuesday he worked 5 hours. How much money did Edward make in those two days?", "output": 33.228}, {"input": "Edward was working as a sacker at a grocery store where he made 9.36 dollars an hour. On Monday he worked 2.13 hours and on Tuesday he worked 4 hours. How much money did Edward make in those two days?", "output": 57.376799999999996}, {"input": "Rachel bought 18 new chairs and 5 new tables for her house. If she spent 49.63 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 1141.49}, {"input": "A chef needs to cook 68 potatoes. He has already cooked 22 If each potato takes 2.52 minutes to cook, how long will it take him to cook the rest?", "output": 115.92}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 41.39 dollars mowing lawns and in the summer he made 145.90 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 177.29000000000002}, {"input": "Lana's favorite band was holding a concert where tickets were 150.69 dollars each. Lana bought 5 tickets for herself and her friends and 4 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1356.21}, {"input": "Edward earned 62.32 dollars for each lawn he mowed. If he had 11 lawns to mow, but forgot to mow 5 of them, how much money did he actually earn?", "output": 373.92}, {"input": "While playing a trivia game, Adam answered 20 questions correct in the first half and 19 questions correct in the second half. If each question was worth 170.71 points, what was his final score?", "output": 6657.6900000000005}, {"input": "At a restaurant each adult meal costs 17.34 and kids eat free. If a group of 3 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 17.34}, {"input": "A chef needs to cook 50 potatoes. He has already cooked 23 If each potato takes 15.84 minutes to cook, how long will it take him to cook the rest?", "output": 427.68}, {"input": "Lana's favorite band was holding a concert where tickets were 203.35 dollars each. Lana bought 3 tickets for herself and her friends and 3 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1220.1}, {"input": "Katie was selling her necklaces at a garage sale. She sold 12 bead necklaces and 20 gem stone necklaces. If each necklace cost 19.29 dollars, how much money did she earn?", "output": 617.28}, {"input": "Edward made 4075.10 dollars mowing lawns over the summer. If he spent 25.24 dollars buying new mower blades, how many 89 dollar games could he buy with the money he had left?", "output": 45.504044943820226}, {"input": "A trivia team had 22 members total, but during a game 7 members didn't show up. If each member that did show up scored 62.24 points, how many points were scored total?", "output": 933.6}, {"input": "John made 6.47 dollars mowing lawns and 26.00 dollars weed eating. If he only spent 2.85 dollar a week, how long would the money last him?", "output": 11.39298245614035}, {"input": "Jerry had 3 action figures, but needed 20 total for a complete collection. If each one costs 70.89 how much money would he need to finish his collection?", "output": 1205.13}, {"input": "Tiffany was playing a video game where she scores 4.57 points for each treasure she finds. If she found 2 treasures on the first level and 1 on the second, what would her score be?", "output": 13.71}, {"input": "A painter needed to paint 18 rooms in a building. Each room takes 7.41 hours to paint. If he already painted 9 rooms, how much longer will he take to paint the rest?", "output": 66.69}, {"input": "Mike had 26 video games but 15 of them weren't working. If he wanted to sell the working games for 15.96 each, how much money could he earn?", "output": 175.56}, {"input": "Jerry had 5 action figures, but needed 16 total for a complete collection. If each one costs 70.02 how much money would he need to finish his collection?", "output": 770.2199999999999}, {"input": "Mike had 30 video games but 6 of them weren't working. If he wanted to sell the working games for 85.53 each, how much money could he earn?", "output": 2052.7200000000003}, {"input": "At a restaurant each adult meal costs 17.25 and kids eat free. If a group of 7 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 103.5}, {"input": "While playing a trivia game, Adam answered 14 questions correct in the first half and 16 questions correct in the second half. If each question was worth 155.42 points, what was his final score?", "output": 4662.599999999999}, {"input": "Luke had 45.69 dollars in January. By March he had spent 9.34 dollars. If he got another 49 dollars from his mom, how much money would he have?", "output": 85.35}, {"input": "Tiffany was playing a video game where she scores 8.68 points for each treasure she finds. If she found 4 treasures on the first level and 3 on the second, what would her score be?", "output": 60.76}, {"input": "Edward was working as a sacker at a grocery store where he made 8.80 dollars an hour. On Monday he worked 3.82 hours and on Tuesday he worked 5 hours. How much money did Edward make in those two days?", "output": 77.61600000000001}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 135.40 dollars mowing lawns and in the summer he made 144.77 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 270.17}, {"input": "Rachel bought 15 new chairs and 2 new tables for her house. If she spent 55.65 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 946.05}, {"input": "Tiffany was playing a video game where she scores 7.92 points for each treasure she finds. If she found 5 treasures on the first level and 3 on the second, what would her score be?", "output": 63.36}, {"input": "John made 9.09 dollars mowing lawns and 20.06 dollars weed eating. If he only spent 4.96 dollar a week, how long would the money last him?", "output": 5.877016129032258}, {"input": "A trivia team had 15 members total, but during a game 6 members didn't show up. If each member that did show up scored 48.97 points, how many points were scored total?", "output": 440.73}, {"input": "Edward made 1780.90 dollars mowing lawns over the summer. If he spent 13.79 dollars buying new mower blades, how many 65 dollar games could he buy with the money he had left?", "output": 27.186307692307693}, {"input": "Edward earned 45.40 dollars for each lawn he mowed. If he had 17 lawns to mow, but forgot to mow 1 of them, how much money did he actually earn?", "output": 726.4}, {"input": "Oliver had 63.15 dollars. For his birthday he got 46 more dollars but spent 2.52 on a new game. How much money does he have now?", "output": 106.63000000000001}, {"input": "Haley and her friends were recycling paper for their class. For every 4.07 pounds they recycled they earned one point. If Haley recycled 17.66 pounds and her friends recycled 13.79 pounds, how many points did they earn?", "output": 7.727272727272727}, {"input": "A chef needs to cook 58 potatoes. He has already cooked 20 If each potato takes 19.24 minutes to cook, how long will it take him to cook the rest?", "output": 731.1199999999999}, {"input": "Tiffany was playing a video game where she scores 6.70 points for each treasure she finds. If she found 1 treasures on the first level and 2 on the second, what would her score be?", "output": 20.1}, {"input": "John had 77.92 dollars. At the store he spent 30.66 on a new game. If he got another 14 dollars for his allowance, how much money does he have now?", "output": 61.260000000000005}, {"input": "Tiffany was playing a video game where she scores 9.90 points for each treasure she finds. If she found 6 treasures on the first level and 5 on the second, what would her score be?", "output": 108.9}, {"input": "Edward was working as a sacker at a grocery store where he made 7.90 dollars an hour. On Monday he worked 2.69 hours and on Tuesday he worked 4 hours. How much money did Edward make in those two days?", "output": 52.851}, {"input": "Tiffany was playing a video game where she scores 5.41 points for each treasure she finds. If she found 1 treasures on the first level and 1 on the second, what would her score be?", "output": 10.82}, {"input": "In a video game, each enemy defeated gives you 199.72 points. If a level has 43 enemies total and you destroy all but 10 of them, how many points would you earn?", "output": 6590.76}, {"input": "Haley and her friends were recycling paper for their class. For every 3.97 pounds they recycled they earned one point. If Haley recycled 19.98 pounds and her friends recycled 10.56 pounds, how many points did they earn?", "output": 7.692695214105793}, {"input": "Edward earned 22.69 dollars for each lawn he mowed. If he had 12 lawns to mow, but forgot to mow 3 of them, how much money did he actually earn?", "output": 204.21}, {"input": "April's discount flowers was having a sale where each rose was $16.76. If April started with 10 roses and had 9 roses left, how much money did she earn?", "output": 16.76}, {"input": "At Tom's Restaurant a group with 14 adults and 1 children came in to eat. If each meal cost 29.39 dollars, how much was the bill?", "output": 440.85}, {"input": "Oliver had 31.68 dollars. For his birthday he got 96 more dollars but spent 29.52 on a new game. How much money does he have now?", "output": 98.16000000000001}, {"input": "At lunch a waiter had 93 customers and 42 of them didn't leave a tip. If he got 10.05 each from the ones who did tip, how much money did he earn?", "output": 512.5500000000001}, {"input": "A painter needed to paint 18 rooms in a building. Each room takes 8.28 hours to paint. If he already painted 7 rooms, how much longer will he take to paint the rest?", "output": 91.08}, {"input": "A magician was selling magic card decks for 14.11 dollars each. If he started with 11 decks and by the end of the day he had 10 left, how much money did he earn?", "output": 14.11}, {"input": "Haley and her friends were recycling paper for their class. For every 4.64 pounds they recycled they earned one point. If Haley recycled 14.49 pounds and her friends recycled 11.28 pounds, how many points did they earn?", "output": 5.553879310344828}, {"input": "In a video game, each enemy defeated gives you 162.28 points. If a level has 49 enemies total and you destroy all but 7 of them, how many points would you earn?", "output": 6815.76}, {"input": "Katie was selling her necklaces at a garage sale. She sold 4 bead necklaces and 17 gem stone necklaces. If each necklace cost 5.64 dollars, how much money did she earn?", "output": 118.44}, {"input": "Mike had 22 video games but 2 of them weren't working. If he wanted to sell the working games for 21.24 each, how much money could he earn?", "output": 424.79999999999995}, {"input": "Lana's favorite band was holding a concert where tickets were 211.21 dollars each. Lana bought 6 tickets for herself and her friends and 4 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 2112.1}, {"input": "Bianca earned 4.93 points for each bag of cans she recycled. If she had 58 bags, but didn't recycle 17 of them, how many points would she have earned?", "output": 202.13}, {"input": "Luke had 10.18 dollars in January. By March he had spent 5.13 dollars. If he got another 28 dollars from his mom, how much money would he have?", "output": 33.05}, {"input": "John made 4.23 dollars mowing lawns and 15.80 dollars weed eating. If he only spent 3.05 dollar a week, how long would the money last him?", "output": 6.567213114754099}, {"input": "A trivia team had 11 members total, but during a game 3 members didn't show up. If each member that did show up scored 68.62 points, how many points were scored total?", "output": 548.96}, {"input": "A new building needed 96 windows. The builder had already installed 6 of them. If it takes 2.55 hours to install each window, how long will it take him to install the rest?", "output": 229.49999999999997}, {"input": "A trivia team had 21 members total, but during a game 3 members didn't show up. If each member that did show up scored 62.30 points, how many points were scored total?", "output": 1121.3999999999999}, {"input": "John made 6.31 dollars mowing lawns and 26.59 dollars weed eating. If he only spent 4.57 dollar a week, how long would the money last him?", "output": 7.199124726477024}, {"input": "John made 8.60 dollars mowing lawns and 12.61 dollars weed eating. If he only spent 1.26 dollar a week, how long would the money last him?", "output": 16.833333333333332}, {"input": "Edward earned 75.78 dollars for each lawn he mowed. If he had 16 lawns to mow, but forgot to mow 4 of them, how much money did he actually earn?", "output": 909.36}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 144.72 dollars mowing lawns and in the summer he made 347.47 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 482.19000000000005}, {"input": "Luke had 14.82 dollars in January. By March he had spent 4.91 dollars. If he got another 40 dollars from his mom, how much money would he have?", "output": 49.91}, {"input": "Lana's favorite band was holding a concert where tickets were 137.47 dollars each. Lana bought 4 tickets for herself and her friends and 5 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1237.23}, {"input": "John had 85.99 dollars. At the store he spent 31.03 on a new game. If he got another 57 dollars for his allowance, how much money does he have now?", "output": 111.96}, {"input": "Edward was working as a sacker at a grocery store where he made 7.27 dollars an hour. On Monday he worked 3.17 hours and on Tuesday he worked 5 hours. How much money did Edward make in those two days?", "output": 59.3959}, {"input": "A chef needs to cook 74 potatoes. He has already cooked 41 If each potato takes 2.33 minutes to cook, how long will it take him to cook the rest?", "output": 76.89}, {"input": "A trivia team had 17 members total, but during a game 10 members didn't show up. If each member that did show up scored 58.26 points, how many points were scored total?", "output": 407.82}, {"input": "A chef needs to cook 73 potatoes. He has already cooked 41 If each potato takes 12.18 minutes to cook, how long will it take him to cook the rest?", "output": 389.76}, {"input": "Edward was working as a sacker at a grocery store where he made 5.01 dollars an hour. On Monday he worked 1.67 hours and on Tuesday he worked 4 hours. How much money did Edward make in those two days?", "output": 28.406699999999997}, {"input": "Edward earned 86.59 dollars for each lawn he mowed. If he had 12 lawns to mow, but forgot to mow 2 of them, how much money did he actually earn?", "output": 865.9000000000001}, {"input": "Mike had 37 video games but 7 of them weren't working. If he wanted to sell the working games for 88.38 each, how much money could he earn?", "output": 2651.3999999999996}, {"input": "Edward earned 74.37 dollars for each lawn he mowed. If he had 18 lawns to mow, but forgot to mow 4 of them, how much money did he actually earn?", "output": 1041.18}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 95.94 dollars mowing lawns and in the summer he made 149.72 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 235.66}, {"input": "Rachel bought 3 new chairs and 4 new tables for her house. If she spent 28.75 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 201.25}, {"input": "John had 82.62 dollars. At the store he spent 16.86 on a new game. If he got another 66 dollars for his allowance, how much money does he have now?", "output": 131.76}, {"input": "Tiffany was playing a video game where she scores 6.91 points for each treasure she finds. If she found 3 treasures on the first level and 4 on the second, what would her score be?", "output": 48.370000000000005}, {"input": "Haley and her friends were recycling paper for their class. For every 4.77 pounds they recycled they earned one point. If Haley recycled 13.56 pounds and her friends recycled 13.12 pounds, how many points did they earn?", "output": 5.59329140461216}, {"input": "Will had 75.46 dollars. If he spent 53.56 bucks on a new game, how many 4 dollar toys could he buy with the money he had left?", "output": 5.474999999999998}, {"input": "Each chocolate bar in a box cost $2.02. If a box had 9 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 14.14}, {"input": "April's discount flowers was having a sale where each rose was $16.30. If April started with 10 roses and had 7 roses left, how much money did she earn?", "output": 48.900000000000006}, {"input": "A new building needed 135 windows. The builder had already installed 7 of them. If it takes 2.97 hours to install each window, how long will it take him to install the rest?", "output": 380.16}, {"input": "Jerry had 5 action figures, but needed 20 total for a complete collection. If each one costs 68.86 how much money would he need to finish his collection?", "output": 1032.9}, {"input": "A painter needed to paint 14 rooms in a building. Each room takes 7.32 hours to paint. If he already painted 7 rooms, how much longer will he take to paint the rest?", "output": 51.24}, {"input": "Haley and her friends were recycling paper for their class. For every 4.57 pounds they recycled they earned one point. If Haley recycled 11.22 pounds and her friends recycled 17.02 pounds, how many points did they earn?", "output": 6.179431072210066}, {"input": "Katie was selling her necklaces at a garage sale. She sold 12 bead necklaces and 11 gem stone necklaces. If each necklace cost 11.42 dollars, how much money did she earn?", "output": 262.66}, {"input": "Luke had 49.04 dollars in January. By March he had spent 5.99 dollars. If he got another 74 dollars from his mom, how much money would he have?", "output": 117.05}, {"input": "A trivia team had 15 members total, but during a game 5 members didn't show up. If each member that did show up scored 44.91 points, how many points were scored total?", "output": 449.09999999999997}, {"input": "Katie was selling her necklaces at a garage sale. She sold 16 bead necklaces and 14 gem stone necklaces. If each necklace cost 16.91 dollars, how much money did she earn?", "output": 507.3}, {"input": "Tom and his friend were buying trick decks from the magic shop for 7.19 dollars each. How much did they spend if Tom bought 3 decks and his friend bought 3 decks?", "output": 43.14}, {"input": "Jerry had 3 action figures, but needed 10 total for a complete collection. If each one costs 55.27 how much money would he need to finish his collection?", "output": 386.89000000000004}, {"input": "In a video game, each enemy defeated gives you 132.27 points. If a level has 78 enemies total and you destroy all but 6 of them, how many points would you earn?", "output": 9523.44}, {"input": "At a restaurant each adult meal costs 13.84 and kids eat free. If a group of 5 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 55.36}, {"input": "Tom and his friend were buying trick decks from the magic shop for 13.33 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 3 decks?", "output": 93.31}, {"input": "Will had 89.10 dollars. If he spent 56.71 bucks on a new game, how many 7 dollar toys could he buy with the money he had left?", "output": 4.627142857142856}, {"input": "Each chocolate bar in a box cost $4.71. If a box had 14 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": 51.81}, {"input": "Tom and his friend were buying trick decks from the magic shop for 10.11 dollars each. How much did they spend if Tom bought 1 decks and his friend bought 3 decks?", "output": 40.44}, {"input": "Tiffany was playing a video game where she scores 6.40 points for each treasure she finds. If she found 1 treasures on the first level and 6 on the second, what would her score be?", "output": 44.800000000000004}, {"input": "Tiffany was playing a video game where she scores 4.22 points for each treasure she finds. If she found 2 treasures on the first level and 6 on the second, what would her score be?", "output": 33.76}, {"input": "Edward was working as a sacker at a grocery store where he made 7.87 dollars an hour. On Monday he worked 2.10 hours and on Tuesday he worked 5 hours. How much money did Edward make in those two days?", "output": 55.876999999999995}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 190.34 dollars mowing lawns and in the summer he made 152.13 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 332.47}, {"input": "At Tom's Restaurant a group with 13 adults and 2 children came in to eat. If each meal cost 20.24 dollars, how much was the bill?", "output": 303.59999999999997}, {"input": "At a restaurant each adult meal costs 15.30 and kids eat free. If a group of 4 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 45.900000000000006}, {"input": "Edward made 1738.25 dollars mowing lawns over the summer. If he spent 77.39 dollars buying new mower blades, how many 85 dollar games could he buy with the money he had left?", "output": 19.539529411764704}, {"input": "At Tom's Restaurant a group with 18 adults and 10 children came in to eat. If each meal cost 24.70 dollars, how much was the bill?", "output": 691.6}, {"input": "Jerry had 2 action figures, but needed 14 total for a complete collection. If each one costs 36.07 how much money would he need to finish his collection?", "output": 432.84000000000003}, {"input": "A trivia team had 12 members total, but during a game 9 members didn't show up. If each member that did show up scored 93.46 points, how many points were scored total?", "output": 280.38}, {"input": "John made 7.64 dollars mowing lawns and 11.31 dollars weed eating. If he only spent 2.20 dollar a week, how long would the money last him?", "output": 8.613636363636363}, {"input": "Katie was selling her necklaces at a garage sale. She sold 20 bead necklaces and 45 gem stone necklaces. If each necklace cost 14.53 dollars, how much money did she earn?", "output": 944.4499999999999}, {"input": "While playing a trivia game, Adam answered 16 questions correct in the first half and 5 questions correct in the second half. If each question was worth 147.58 points, what was his final score?", "output": 3099.1800000000003}, {"input": "John had 72.84 dollars. At the store he spent 8.08 on a new game. If he got another 18 dollars for his allowance, how much money does he have now?", "output": 82.76}, {"input": "Edward was working as a sacker at a grocery store where he made 9.75 dollars an hour. On Monday he worked 4.87 hours and on Tuesday he worked 3 hours. How much money did Edward make in those two days?", "output": 76.7325}, {"input": "A magician was selling magic card decks for 11.99 dollars each. If he started with 19 decks and by the end of the day he had 10 left, how much money did he earn?", "output": 107.91}, {"input": "John had 53.62 dollars. At the store he spent 49.15 on a new game. If he got another 23 dollars for his allowance, how much money does he have now?", "output": 27.47}, {"input": "Paul had saved up 36.53 dollars. If he received another 30 dollars for his allowance, how many 19.38 dollar toys could he buy?", "output": 3.432920536635707}, {"input": "Rachel bought 16 new chairs and 2 new tables for her house. If she spent 13.06 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 235.08}, {"input": "Each chocolate bar in a box cost $6.23. If a box had 10 bars total and Emily sold all but 5 bars, how much money would she have made?", "output": 31.150000000000002}, {"input": "Will had 61.62 dollars. If he spent 58.52 bucks on a new game, how many 10 dollar toys could he buy with the money he had left?", "output": 0.30999999999999944}, {"input": "Katie was selling her necklaces at a garage sale. She sold 15 bead necklaces and 20 gem stone necklaces. If each necklace cost 4.80 dollars, how much money did she earn?", "output": 168.0}, {"input": "Haley and her friends were recycling paper for their class. For every 3.72 pounds they recycled they earned one point. If Haley recycled 12.34 pounds and her friends recycled 17.78 pounds, how many points did they earn?", "output": 8.096774193548386}, {"input": "Paul had saved up 36.62 dollars. If he received another 17 dollars for his allowance, how many 10.43 dollar toys could he buy?", "output": 5.140939597315436}, {"input": "Oliver had 83.67 dollars. For his birthday he got 73 more dollars but spent 18.97 on a new game. How much money does he have now?", "output": 137.70000000000002}, {"input": "Tiffany was playing a video game where she scores 7.83 points for each treasure she finds. If she found 5 treasures on the first level and 5 on the second, what would her score be?", "output": 78.3}, {"input": "Tom and his friend were buying trick decks from the magic shop for 8.84 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 6 decks?", "output": 88.4}, {"input": "At a restaurant each adult meal costs 22.27 and kids eat free. If a group of 7 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 133.62}, {"input": "While playing a trivia game, Adam answered 16 questions correct in the first half and 8 questions correct in the second half. If each question was worth 251.98 points, what was his final score?", "output": 6047.5199999999995}, {"input": "Each chocolate bar in a box cost $2.10. If a box had 13 bars total and Emily sold all but 4 bars, how much money would she have made?", "output": 18.900000000000002}, {"input": "In a video game, each enemy defeated gives you 34.37 points. If a level has 56 enemies total and you destroy all but 5 of them, how many points would you earn?", "output": 1752.87}, {"input": "Paul had saved up 60.02 dollars. If he received another 21 dollars for his allowance, how many 21.62 dollar toys could he buy?", "output": 3.7474560592044406}, {"input": "A magician was selling magic card decks for 13.35 dollars each. If he started with 10 decks and by the end of the day he had 6 left, how much money did he earn?", "output": 53.4}, {"input": "Will had 66.56 dollars. If he spent 42.47 bucks on a new game, how many 8 dollar toys could he buy with the money he had left?", "output": 3.0112500000000004}, {"input": "Each chocolate bar in a box cost $6.71. If a box had 10 bars total and Emily sold all but 5 bars, how much money would she have made?", "output": 33.55}, {"input": "Bianca earned 61.69 points for each bag of cans she recycled. If she had 42 bags, but didn't recycle 12 of them, how many points would she have earned?", "output": 1850.6999999999998}, {"input": "Each chocolate bar in a box cost $6.11. If a box had 8 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 36.660000000000004}, {"input": "Mike had 24 video games but 9 of them weren't working. If he wanted to sell the working games for 80.57 each, how much money could he earn?", "output": 1208.55}, {"input": "A magician was selling magic card decks for 11.98 dollars each. If he started with 14 decks and by the end of the day he had 8 left, how much money did he earn?", "output": 71.88}, {"input": "Each chocolate bar in a box cost $4.56. If a box had 14 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": 50.16}, {"input": "A new building needed 106 windows. The builder had already installed 41 of them. If it takes 2.80 hours to install each window, how long will it take him to install the rest?", "output": 182.0}, {"input": "Tiffany was playing a video game where she scores 8.72 points for each treasure she finds. If she found 2 treasures on the first level and 4 on the second, what would her score be?", "output": 52.32000000000001}, {"input": "At Tom's Restaurant a group with 4 adults and 10 children came in to eat. If each meal cost 17.70 dollars, how much was the bill?", "output": 247.79999999999998}, {"input": "Each chocolate bar in a box cost $7.87. If a box had 10 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 62.96}, {"input": "A chef needs to cook 67 potatoes. He has already cooked 39 If each potato takes 6.35 minutes to cook, how long will it take him to cook the rest?", "output": 177.79999999999998}, {"input": "Edward made 3978.80 dollars mowing lawns over the summer. If he spent 56.24 dollars buying new mower blades, how many 65 dollar games could he buy with the money he had left?", "output": 60.347076923076926}, {"input": "Paul had saved up 31.81 dollars. If he received another 86 dollars for his allowance, how many 20.25 dollar toys could he buy?", "output": 5.817777777777778}, {"input": "A trivia team had 14 members total, but during a game 10 members didn't show up. If each member that did show up scored 54.74 points, how many points were scored total?", "output": 218.96}, {"input": "John made 8.07 dollars mowing lawns and 15.26 dollars weed eating. If he only spent 4.26 dollar a week, how long would the money last him?", "output": 5.476525821596244}, {"input": "April's discount flowers was having a sale where each rose was $9.45. If April started with 13 roses and had 8 roses left, how much money did she earn?", "output": 47.25}, {"input": "Luke had 17.68 dollars in January. By March he had spent 9.12 dollars. If he got another 44 dollars from his mom, how much money would he have?", "output": 52.56}, {"input": "A painter needed to paint 14 rooms in a building. Each room takes 7.50 hours to paint. If he already painted 4 rooms, how much longer will he take to paint the rest?", "output": 75.0}, {"input": "A painter needed to paint 18 rooms in a building. Each room takes 5.96 hours to paint. If he already painted 5 rooms, how much longer will he take to paint the rest?", "output": 77.48}, {"input": "Jerry had 3 action figures, but needed 13 total for a complete collection. If each one costs 57.98 how much money would he need to finish his collection?", "output": 579.8}, {"input": "April's discount flowers was having a sale where each rose was $12.34. If April started with 12 roses and had 4 roses left, how much money did she earn?", "output": 98.72}, {"input": "Tiffany was playing a video game where she scores 8.96 points for each treasure she finds. If she found 3 treasures on the first level and 5 on the second, what would her score be?", "output": 71.68}, {"input": "Tiffany was playing a video game where she scores 8.80 points for each treasure she finds. If she found 5 treasures on the first level and 3 on the second, what would her score be?", "output": 70.4}, {"input": "Luke had 11.92 dollars in January. By March he had spent 7.46 dollars. If he got another 75 dollars from his mom, how much money would he have?", "output": 79.46}, {"input": "Each chocolate bar in a box cost $5.76. If a box had 9 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 40.32}, {"input": "At Tom's Restaurant a group with 19 adults and 6 children came in to eat. If each meal cost 18.54 dollars, how much was the bill?", "output": 463.5}, {"input": "A magician was selling magic card decks for 14.18 dollars each. If he started with 14 decks and by the end of the day he had 5 left, how much money did he earn?", "output": 127.62}, {"input": "Mike had 20 video games but 2 of them weren't working. If he wanted to sell the working games for 71.42 each, how much money could he earn?", "output": 1285.56}, {"input": "John had 99.99 dollars. At the store he spent 8.93 on a new game. If he got another 83 dollars for his allowance, how much money does he have now?", "output": 174.06}, {"input": "A trivia team had 12 members total, but during a game 5 members didn't show up. If each member that did show up scored 46.71 points, how many points were scored total?", "output": 326.97}, {"input": "Paul had saved up 41.48 dollars. If he received another 18 dollars for his allowance, how many 6.86 dollar toys could he buy?", "output": 8.670553935860058}, {"input": "Haley and her friends were recycling paper for their class. For every 4.07 pounds they recycled they earned one point. If Haley recycled 17.30 pounds and her friends recycled 16.95 pounds, how many points did they earn?", "output": 8.415233415233415}, {"input": "Jerry had 2 action figures, but needed 16 total for a complete collection. If each one costs 41.24 how much money would he need to finish his collection?", "output": 577.36}, {"input": "A trivia team had 18 members total, but during a game 7 members didn't show up. If each member that did show up scored 43.11 points, how many points were scored total?", "output": 474.21}, {"input": "In a video game, each enemy defeated gives you 98.23 points. If a level has 70 enemies total and you destroy all but 5 of them, how many points would you earn?", "output": 6384.95}, {"input": "At Tom's Restaurant a group with 7 adults and 6 children came in to eat. If each meal cost 28.97 dollars, how much was the bill?", "output": 376.61}, {"input": "Edward was working as a sacker at a grocery store where he made 5.32 dollars an hour. On Monday he worked 2.55 hours and on Tuesday he worked 3 hours. How much money did Edward make in those two days?", "output": 29.526}, {"input": "John made 9.98 dollars mowing lawns and 27.67 dollars weed eating. If he only spent 3.07 dollar a week, how long would the money last him?", "output": 12.263843648208471}, {"input": "Paul had saved up 62.31 dollars. If he received another 63 dollars for his allowance, how many 29.73 dollar toys could he buy?", "output": 4.214934409687185}, {"input": "A new building needed 103 windows. The builder had already installed 47 of them. If it takes 2.24 hours to install each window, how long will it take him to install the rest?", "output": 125.44000000000001}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 33.18 dollars mowing lawns and in the summer he made 384.85 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 408.03000000000003}, {"input": "Rachel bought 17 new chairs and 5 new tables for her house. If she spent 106.33 minutes on each piece furniture putting it together, how many minutes did it take her to finish?", "output": 2339.2599999999998}, {"input": "In a video game, each enemy defeated gives you 194.29 points. If a level has 77 enemies total and you destroy all but 5 of them, how many points would you earn?", "output": 13988.88}, {"input": "Edward made 3013.25 dollars mowing lawns over the summer. If he spent 32.48 dollars buying new mower blades, how many 56 dollar games could he buy with the money he had left?", "output": 53.22803571428572}, {"input": "Mike had 33 video games but 12 of them weren't working. If he wanted to sell the working games for 82.59 each, how much money could he earn?", "output": 1734.39}, {"input": "John had 58.11 dollars. At the store he spent 15.22 on a new game. If he got another 70 dollars for his allowance, how much money does he have now?", "output": 112.89}, {"input": "Paul had saved up 63.32 dollars. If he received another 26 dollars for his allowance, how many 2.68 dollar toys could he buy?", "output": 33.32835820895522}, {"input": "Mike had 26 video games but 9 of them weren't working. If he wanted to sell the working games for 18.32 each, how much money could he earn?", "output": 311.44}, {"input": "A trivia team had 19 members total, but during a game 6 members didn't show up. If each member that did show up scored 85.56 points, how many points were scored total?", "output": 1112.28}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 199.96 dollars mowing lawns and in the summer he made 133.30 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 323.26}, {"input": "Bianca earned 75.79 points for each bag of cans she recycled. If she had 72 bags, but didn't recycle 19 of them, how many points would she have earned?", "output": 4016.8700000000003}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 95.79 dollars mowing lawns and in the summer he made 386.68 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 472.47}, {"input": "Edward earned 22.97 dollars for each lawn he mowed. If he had 20 lawns to mow, but forgot to mow 1 of them, how much money did he actually earn?", "output": 436.42999999999995}, {"input": "Luke had 27.74 dollars in January. By March he had spent 5.07 dollars. If he got another 36 dollars from his mom, how much money would he have?", "output": 58.67}, {"input": "Edward was working as a sacker at a grocery store where he made 7.76 dollars an hour. On Monday he worked 2.07 hours and on Tuesday he worked 6 hours. How much money did Edward make in those two days?", "output": 62.6232}, {"input": "At a restaurant each adult meal costs 22.87 and kids eat free. If a group of 4 people came in and 1 were kids, how much would it cost for the group to eat?", "output": 68.61}, {"input": "Edward earned 20.17 dollars for each lawn he mowed. If he had 15 lawns to mow, but forgot to mow 2 of them, how much money did he actually earn?", "output": 262.21000000000004}, {"input": "A chef needs to cook 62 potatoes. He has already cooked 11 If each potato takes 18.52 minutes to cook, how long will it take him to cook the rest?", "output": 944.52}, {"input": "While playing a trivia game, Adam answered 17 questions correct in the first half and 2 questions correct in the second half. If each question was worth 74.48 points, what was his final score?", "output": 1415.1200000000001}, {"input": "At lunch a waiter had 77 customers and 28 of them didn't leave a tip. If he got 1.06 each from the ones who did tip, how much money did he earn?", "output": 51.940000000000005}, {"input": "At Tom's Restaurant a group with 8 adults and 6 children came in to eat. If each meal cost 27.36 dollars, how much was the bill?", "output": 383.03999999999996}, {"input": "Katie was selling her necklaces at a garage sale. She sold 6 bead necklaces and 23 gem stone necklaces. If each necklace cost 16.95 dollars, how much money did she earn?", "output": 491.54999999999995}, {"input": "Tom and his friend were buying trick decks from the magic shop for 13.41 dollars each. How much did they spend if Tom bought 3 decks and his friend bought 5 decks?", "output": 107.28}, {"input": "April's discount flowers was having a sale where each rose was $14.25. If April started with 11 roses and had 3 roses left, how much money did she earn?", "output": 114.0}, {"input": "At lunch a waiter had 98 customers and 21 of them didn't leave a tip. If he got 11.80 each from the ones who did tip, how much money did he earn?", "output": 908.6}, {"input": "Jerry had 3 action figures, but needed 20 total for a complete collection. If each one costs 56.22 how much money would he need to finish his collection?", "output": 955.74}, {"input": "Katie was selling her necklaces at a garage sale. She sold 13 bead necklaces and 46 gem stone necklaces. If each necklace cost 1.87 dollars, how much money did she earn?", "output": 110.33000000000001}, {"input": "Tom and his friend were buying trick decks from the magic shop for 8.88 dollars each. How much did they spend if Tom bought 4 decks and his friend bought 7 decks?", "output": 97.68}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 170.75 dollars mowing lawns and in the summer he made 118.55 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 279.3}, {"input": "April's discount flowers was having a sale where each rose was $6.95. If April started with 11 roses and had 3 roses left, how much money did she earn?", "output": 55.6}, {"input": "Katie was selling her necklaces at a garage sale. She sold 5 bead necklaces and 9 gem stone necklaces. If each necklace cost 9.65 dollars, how much money did she earn?", "output": 135.1}, {"input": "Edward earned 94.00 dollars for each lawn he mowed. If he had 19 lawns to mow, but forgot to mow 3 of them, how much money did he actually earn?", "output": 1504.0}, {"input": "At lunch a waiter had 98 customers and 12 of them didn't leave a tip. If he got 6.63 each from the ones who did tip, how much money did he earn?", "output": 570.18}, {"input": "John had 88.99 dollars. At the store he spent 48.74 on a new game. If he got another 24 dollars for his allowance, how much money does he have now?", "output": 64.25}, {"input": "Lana's favorite band was holding a concert where tickets were 269.17 dollars each. Lana bought 3 tickets for herself and her friends and 2 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 1345.8500000000001}, {"input": "Haley and her friends were recycling paper for their class. For every 2.69 pounds they recycled they earned one point. If Haley recycled 17.16 pounds and her friends recycled 14.44 pounds, how many points did they earn?", "output": 11.747211895910782}, {"input": "Katie was selling her necklaces at a garage sale. She sold 6 bead necklaces and 15 gem stone necklaces. If each necklace cost 17.50 dollars, how much money did she earn?", "output": 367.5}, {"input": "Each chocolate bar in a box cost $5.13. If a box had 15 bars total and Emily sold all but 4 bars, how much money would she have made?", "output": 56.43}, {"input": "Katie was selling her necklaces at a garage sale. She sold 3 bead necklaces and 50 gem stone necklaces. If each necklace cost 7.74 dollars, how much money did she earn?", "output": 410.22}, {"input": "Paul had saved up 45.55 dollars. If he received another 97 dollars for his allowance, how many 29.08 dollar toys could he buy?", "output": 4.901994497936727}, {"input": "A magician was selling magic card decks for 7.86 dollars each. If he started with 14 decks and by the end of the day he had 7 left, how much money did he earn?", "output": 55.02}, {"input": "While playing a trivia game, Adam answered 15 questions correct in the first half and 7 questions correct in the second half. If each question was worth 257.16 points, what was his final score?", "output": 5657.52}, {"input": "Katie was selling her necklaces at a garage sale. She sold 14 bead necklaces and 12 gem stone necklaces. If each necklace cost 7.98 dollars, how much money did she earn?", "output": 207.48000000000002}, {"input": "A painter needed to paint 13 rooms in a building. Each room takes 5.04 hours to paint. If he already painted 10 rooms, how much longer will he take to paint the rest?", "output": 15.120000000000001}, {"input": "Mike had 39 video games but 6 of them weren't working. If he wanted to sell the working games for 26.35 each, how much money could he earn?", "output": 869.5500000000001}, {"input": "Tiffany was playing a video game where she scores 9.79 points for each treasure she finds. If she found 6 treasures on the first level and 3 on the second, what would her score be?", "output": 88.10999999999999}, {"input": "John made 8.92 dollars mowing lawns and 15.10 dollars weed eating. If he only spent 4.82 dollar a week, how long would the money last him?", "output": 4.983402489626556}, {"input": "Jerry had 1 action figures, but needed 12 total for a complete collection. If each one costs 30.80 how much money would he need to finish his collection?", "output": 338.8}, {"input": "John had 91.26 dollars. At the store he spent 35.86 on a new game. If he got another 89 dollars for his allowance, how much money does he have now?", "output": 144.4}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 29.71 dollars mowing lawns and in the summer he made 320.05 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 339.76}, {"input": "Paul had saved up 86.34 dollars. If he received another 32 dollars for his allowance, how many 12.40 dollar toys could he buy?", "output": 9.543548387096774}, {"input": "At lunch a waiter had 81 customers and 43 of them didn't leave a tip. If he got 16.88 each from the ones who did tip, how much money did he earn?", "output": 641.4399999999999}, {"input": "A chef needs to cook 92 potatoes. He has already cooked 5 If each potato takes 16.00 minutes to cook, how long will it take him to cook the rest?", "output": 1392.0}, {"input": "A painter needed to paint 14 rooms in a building. Each room takes 7.27 hours to paint. If he already painted 7 rooms, how much longer will he take to paint the rest?", "output": 50.89}, {"input": "Each chocolate bar in a box cost $2.24. If a box had 13 bars total and Emily sold all but 3 bars, how much money would she have made?", "output": 22.400000000000002}, {"input": "Will had 73.66 dollars. If he spent 58.43 bucks on a new game, how many 10 dollar toys could he buy with the money he had left?", "output": 1.5229999999999997}, {"input": "Each chocolate bar in a box cost $5.63. If a box had 13 bars total and Emily sold all but 5 bars, how much money would she have made?", "output": 45.04}, {"input": "Edward made 4608.06 dollars mowing lawns over the summer. If he spent 36.32 dollars buying new mower blades, how many 44 dollar games could he buy with the money he had left?", "output": 103.90318181818184}, {"input": "A painter needed to paint 13 rooms in a building. Each room takes 6.91 hours to paint. If he already painted 8 rooms, how much longer will he take to paint the rest?", "output": 34.55}, {"input": "A painter needed to paint 11 rooms in a building. Each room takes 7.03 hours to paint. If he already painted 9 rooms, how much longer will he take to paint the rest?", "output": 14.06}, {"input": "Katie was selling her necklaces at a garage sale. She sold 17 bead necklaces and 2 gem stone necklaces. If each necklace cost 7.93 dollars, how much money did she earn?", "output": 150.67}, {"input": "April's discount flowers was having a sale where each rose was $6.79. If April started with 16 roses and had 5 roses left, how much money did she earn?", "output": 74.69}, {"input": "Edward made 2054.38 dollars mowing lawns over the summer. If he spent 80.06 dollars buying new mower blades, how many 33 dollar games could he buy with the money he had left?", "output": 59.827878787878795}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 102.85 dollars mowing lawns and in the summer he made 304.26 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 397.11}, {"input": "Haley and her friends were recycling paper for their class. For every 2.58 pounds they recycled they earned one point. If Haley recycled 10.39 pounds and her friends recycled 17.31 pounds, how many points did they earn?", "output": 10.736434108527131}, {"input": "At a restaurant each adult meal costs 12.09 and kids eat free. If a group of 5 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 36.269999999999996}, {"input": "Jerry had 2 action figures, but needed 12 total for a complete collection. If each one costs 63.26 how much money would he need to finish his collection?", "output": 632.6}, {"input": "Each chocolate bar in a box cost $4.34. If a box had 15 bars total and Emily sold all but 5 bars, how much money would she have made?", "output": 43.4}, {"input": "At lunch a waiter had 79 customers and 32 of them didn't leave a tip. If he got 15.38 each from the ones who did tip, how much money did he earn?", "output": 722.86}, {"input": "In a video game, each enemy defeated gives you 115.80 points. If a level has 76 enemies total and you destroy all but 10 of them, how many points would you earn?", "output": 7642.8}, {"input": "In a video game, each enemy defeated gives you 43.24 points. If a level has 75 enemies total and you destroy all but 7 of them, how many points would you earn?", "output": 2940.32}, {"input": "A magician was selling magic card decks for 7.24 dollars each. If he started with 16 decks and by the end of the day he had 9 left, how much money did he earn?", "output": 50.68}, {"input": "John had 55.55 dollars. At the store he spent 36.20 on a new game. If he got another 36 dollars for his allowance, how much money does he have now?", "output": 55.349999999999994}, {"input": "Edward earned 62.65 dollars for each lawn he mowed. If he had 16 lawns to mow, but forgot to mow 4 of them, how much money did he actually earn?", "output": 751.8}, {"input": "A chef needs to cook 83 potatoes. He has already cooked 4 If each potato takes 1.71 minutes to cook, how long will it take him to cook the rest?", "output": 135.09}, {"input": "At a restaurant each adult meal costs 11.70 and kids eat free. If a group of 5 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 35.099999999999994}, {"input": "Oliver had 28.78 dollars. For his birthday he got 68 more dollars but spent 28.31 on a new game. How much money does he have now?", "output": 68.47}, {"input": "A new building needed 141 windows. The builder had already installed 16 of them. If it takes 1.46 hours to install each window, how long will it take him to install the rest?", "output": 182.5}, {"input": "Edward made 435.35 dollars mowing lawns over the summer. If he spent 14.70 dollars buying new mower blades, how many 86 dollar games could he buy with the money he had left?", "output": 4.891279069767442}, {"input": "Will had 60.55 dollars. If he spent 52.62 bucks on a new game, how many 7 dollar toys could he buy with the money he had left?", "output": 1.1328571428571428}, {"input": "Lana's favorite band was holding a concert where tickets were 271.27 dollars each. Lana bought 5 tickets for herself and her friends and 4 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 2441.43}, {"input": "Tiffany was playing a video game where she scores 8.53 points for each treasure she finds. If she found 5 treasures on the first level and 4 on the second, what would her score be?", "output": 76.77}, {"input": "Edward made 1417.01 dollars mowing lawns over the summer. If he spent 63.75 dollars buying new mower blades, how many 51 dollar games could he buy with the money he had left?", "output": 26.53450980392157}, {"input": "Oliver had 38.55 dollars. For his birthday he got 25 more dollars but spent 19.75 on a new game. How much money does he have now?", "output": 43.8}, {"input": "April's discount flowers was having a sale where each rose was $16.00. If April started with 12 roses and had 8 roses left, how much money did she earn?", "output": 64.0}, {"input": "John had 58.78 dollars. At the store he spent 14.22 on a new game. If he got another 40 dollars for his allowance, how much money does he have now?", "output": 84.56}, {"input": "At lunch a waiter had 80 customers and 25 of them didn't leave a tip. If he got 12.34 each from the ones who did tip, how much money did he earn?", "output": 678.7}, {"input": "Edward was working as a sacker at a grocery store where he made 8.75 dollars an hour. On Monday he worked 4.93 hours and on Tuesday he worked 4 hours. How much money did Edward make in those two days?", "output": 78.1375}, {"input": "Paul had saved up 47.42 dollars. If he received another 48 dollars for his allowance, how many 7.56 dollar toys could he buy?", "output": 12.621693121693122}, {"input": "Paul had saved up 41.63 dollars. If he received another 47 dollars for his allowance, how many 10.35 dollar toys could he buy?", "output": 8.56328502415459}, {"input": "Edward was working as a sacker at a grocery store where he made 9.82 dollars an hour. On Monday he worked 3.41 hours and on Tuesday he worked 7 hours. How much money did Edward make in those two days?", "output": 102.2262}, {"input": "Jerry had 4 action figures, but needed 19 total for a complete collection. If each one costs 74.20 how much money would he need to finish his collection?", "output": 1113.0}, {"input": "Bianca earned 91.63 points for each bag of cans she recycled. If she had 43 bags, but didn't recycle 7 of them, how many points would she have earned?", "output": 3298.68}, {"input": "A magician was selling magic card decks for 12.82 dollars each. If he started with 14 decks and by the end of the day he had 6 left, how much money did he earn?", "output": 102.56}, {"input": "At Tom's Restaurant a group with 15 adults and 5 children came in to eat. If each meal cost 24.43 dollars, how much was the bill?", "output": 488.6}, {"input": "A magician was selling magic card decks for 14.27 dollars each. If he started with 16 decks and by the end of the day he had 7 left, how much money did he earn?", "output": 128.43}, {"input": "Tom and his friend were buying trick decks from the magic shop for 14.34 dollars each. How much did they spend if Tom bought 2 decks and his friend bought 4 decks?", "output": 86.03999999999999}, {"input": "Each chocolate bar in a box cost $2.37. If a box had 12 bars total and Emily sold all but 2 bars, how much money would she have made?", "output": 23.700000000000003}, {"input": "A chef needs to cook 50 potatoes. He has already cooked 35 If each potato takes 14.50 minutes to cook, how long will it take him to cook the rest?", "output": 217.5}, {"input": "Jerry had 1 action figures, but needed 12 total for a complete collection. If each one costs 40.49 how much money would he need to finish his collection?", "output": 445.39000000000004}, {"input": "While playing a trivia game, Adam answered 17 questions correct in the first half and 18 questions correct in the second half. If each question was worth 185.01 points, what was his final score?", "output": 6475.349999999999}, {"input": "Edward made 1337.09 dollars mowing lawns over the summer. If he spent 89.24 dollars buying new mower blades, how many 44 dollar games could he buy with the money he had left?", "output": 28.360227272727272}, {"input": "A painter needed to paint 15 rooms in a building. Each room takes 5.98 hours to paint. If he already painted 7 rooms, how much longer will he take to paint the rest?", "output": 47.84}, {"input": "John made 6.67 dollars mowing lawns and 23.86 dollars weed eating. If he only spent 4.73 dollar a week, how long would the money last him?", "output": 6.454545454545454}, {"input": "Will had 91.41 dollars. If he spent 45.18 bucks on a new game, how many 9 dollar toys could he buy with the money he had left?", "output": 5.136666666666667}, {"input": "A trivia team had 27 members total, but during a game 10 members didn't show up. If each member that did show up scored 80.43 points, how many points were scored total?", "output": 1367.3100000000002}, {"input": "Lana's favorite band was holding a concert where tickets were 118.00 dollars each. Lana bought 2 tickets for herself and her friends and 2 extra tickets in case anyone else wanted to go. How much did she spend?", "output": 472.0}, {"input": "A trivia team had 14 members total, but during a game 6 members didn't show up. If each member that did show up scored 63.92 points, how many points were scored total?", "output": 511.36}, {"input": "Edward was working as a sacker at a grocery store where he made 6.64 dollars an hour. On Monday he worked 4.47 hours and on Tuesday he worked 4 hours. How much money did Edward make in those two days?", "output": 56.24079999999999}, {"input": "Edward was working as a sacker at a grocery store where he made 5.78 dollars an hour. On Monday he worked 3.19 hours and on Tuesday he worked 4 hours. How much money did Edward make in those two days?", "output": 41.5582}, {"input": "Katie was selling her necklaces at a garage sale. She sold 13 bead necklaces and 48 gem stone necklaces. If each necklace cost 9.65 dollars, how much money did she earn?", "output": 588.65}, {"input": "Will had 78.93 dollars. If he spent 45.18 bucks on a new game, how many 3 dollar toys could he buy with the money he had left?", "output": 11.250000000000002}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 156.89 dollars mowing lawns and in the summer he made 228.12 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 375.01}, {"input": "John made 9.29 dollars mowing lawns and 13.17 dollars weed eating. If he only spent 1.35 dollar a week, how long would the money last him?", "output": 16.637037037037036}, {"input": "While playing a trivia game, Adam answered 11 questions correct in the first half and 15 questions correct in the second half. If each question was worth 212.14 points, what was his final score?", "output": 5515.639999999999}, {"input": "John made 8.40 dollars mowing lawns and 12.91 dollars weed eating. If he only spent 1.73 dollar a week, how long would the money last him?", "output": 12.317919075144511}, {"input": "Luke had 43.60 dollars in January. By March he had spent 6.34 dollars. If he got another 69 dollars from his mom, how much money would he have?", "output": 106.26}, {"input": "Paul had saved up 70.28 dollars. If he received another 49 dollars for his allowance, how many 16.81 dollar toys could he buy?", "output": 7.095776323616895}, {"input": "Mike had 29 video games but 8 of them weren't working. If he wanted to sell the working games for 73.57 each, how much money could he earn?", "output": 1544.9699999999998}, {"input": "Kaleb started his own lawn mowing business. In the spring he made 197.77 dollars mowing lawns and in the summer he made 172.06 dollars. If he had to spend 10.00 dollars buying supplies, how much money did he end up with?", "output": 359.83000000000004}, {"input": "At a restaurant each adult meal costs 21.16 and kids eat free. If a group of 7 people came in and 2 were kids, how much would it cost for the group to eat?", "output": 105.8}]